{
    "the_offer": {},
    "1_reddit_the_offer": {
        "author": "Latter_Feeling2656",
        "content": "Offer screenwriter Michael Tolkin, on his writing process: \"You start with a set of facts and a set of memories, and then you find that, in order to make the drama work, you have to shift things around. And then you forget what’s real and what’s not, and that’s when you’re really flying. Once you forget that, then you just write.”\n\nGodfather director Francis Ford Coppola: \"That’s the point of view of, I guess, the producer but it doesn’t really reflect what really happened, in my opinion.\"",
        "created": "1673813801.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "2_reddit_the_offer": {
        "author": "planetjeff86",
        "content": "I really enjoyed this show. Matthew Goode and Burn Gorman is awesome. Truly recommended.",
        "created": "1673811113.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "3_reddit_the_offer": {
        "author": "Avicennaete",
        "content": "I watched it like a couple of months ago and for me it seemed like a masterpiece.",
        "created": "1673811069.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "4_reddit_the_offer": {
        "author": "GarlVinland4Astrea",
        "content": "It was a fantastic show that weirdly fell under the radar. Definitely one of the best shows of last year.",
        "created": "1673812291.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "5_reddit_the_offer": {
        "author": "ColdCruise",
        "content": "I liked it. I felt a lot of the really direct references to the movie were a bit cheesy at times, but other than that it was pretty good.",
        "created": "1673816770.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "6_reddit_the_offer": {
        "author": "anasui1",
        "content": "I found it pretty mediocre; the main hook, the making of The Godfather isn't strong enough to warrant a serie, even with its billion artistic licences, and I couldn't stand any of the characters",
        "created": "1673815516.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "7_reddit_the_offer": {
        "author": null,
        "content": "It's weird when you watch it and you're like \"wait, who the fuck is Gulf Western\" and then you actually watch *The Godfather* and the Paramount logo comes up, just like it always had throughout your whole childhood, and it says \"A Gulf Western company\" like it probably always had, and you didn't even notice.\n\nAnd then you find out that what happened was that Paramount became the only part of Gulf Western that was making any money so Paramount basically took over the holdings company that was holding them. In a lot of ways, it's not just the story of *The Godfather*, it's the story of Paramount, on Paramount+.\n\n>\tI am learning so much about the film\n\nWell... remember, not everybody remembers it happening this way.",
        "created": "1673947707.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "8_reddit_the_offer": {
        "author": "bakedl0gic",
        "content": "Late to the party on this show as well. I thought it was spectacular. I love stories about Hollywood and the ins and outs behind the scenes. This show was also rich in characters. Matthew Goode was phenomenal in his portrayal of Robert Evans. \n\nI know it will never happen… but I’d honestly love to see a spin-off about Robert Evans production of Chinatown. I would just love to see more of this character. The real Robert Evans had quite the life. I’d love to see more tales from Hollywood.",
        "created": "1694591947.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "9_reddit_the_offer": {
        "author": "Dna87",
        "content": "It was really solid. Wasn’t hugely historically accurate but definitely entertaining. And there were a lot of good performances. Not one I’m gonna rewatch regularly, but it’s well worth a watch.",
        "created": "1673816540.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "10_reddit_the_offer": {
        "author": "TheMegaWhopper",
        "content": "I thought it was good not great. It was cool seeing the dramatization of some of the stories behind the making of one of the best movies of all time",
        "created": "1673827788.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "11_reddit_the_offer": {
        "author": "Glittering_Deer_261",
        "content": "I really enjoyed it. I thought writing and acting were passable but the sets and costumes were the real scene stealers. Really solidified my appreciation for Miles Teller as well.",
        "created": "1673839173.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "12_reddit_the_offer": {
        "author": "slymm",
        "content": "Very very entraining, but as I was being entertained, I was mentally debating if it was mediocre or outright bad.",
        "created": "1673827169.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "13_reddit_the_offer": {
        "author": null,
        "content": "[deleted]",
        "created": "1673813311.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "14_reddit_the_offer": {
        "author": null,
        "content": "[deleted]",
        "created": "1673831300.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "15_reddit_the_offer": {
        "author": "Sks44",
        "content": "Some of the acting was good but the story was bullshit.",
        "created": "1673862496.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "16_reddit_the_offer": {
        "author": "ratfinkprojects",
        "content": "Matthew Goode stole the show imo",
        "created": "1683935860.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "17_reddit_the_offer": {
        "author": "slymm",
        "content": "Yeah I don't understand why they felt the need to put those in. It was confusing at first (at least to me) because I was wondering if that's how the writers came up with the lines\n\nAlso Paramount patting themselves on the back was a bit much",
        "created": "1673827647.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "18_reddit_the_offer": {
        "author": "anbeck",
        "content": "Yeah, the “Leave the cannoli” line early on made me expect the worst for the rest of the show. But I’m glad I continued, because it was a very good show overall.",
        "created": "1673875178.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "19_reddit_the_offer": {
        "author": "AzovApologist",
        "content": "You're not missing anything",
        "created": "1673821603.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "20_reddit_the_offer": {
        "author": null,
        "content": "yeah I'm surprised at the praise from users in this post; I thought when this first aired that everyone was shitting on it, saying it was terrible.",
        "created": "1673877516.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "21_reddit_the_offer": {
        "author": "RedDurden_00",
        "content": "That was Robert Redford. Also Dan Fogel and the actor who plays Puzo stated in a interview that they’d like to do a follow up series into the making of godfather part 2 transitioning into Superman & Apocalypse Now",
        "created": "1663783670.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "22_reddit_the_offer": {
        "author": "Sks44",
        "content": "Haven’t even watched a full episode and declare it “great”.\n\nFunfact: Robert Evans, who was running Paramount at the time, was best friends with Sidney Korshak. Korshak was a famous Hollywood fixer and was a member of the Chicago Outfit. Evans wouldn’t have any mafia issues as long as Korshak was his friend.",
        "created": "1663784656.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "23_reddit_the_offer": {
        "author": "MehradHidden",
        "content": "I loved it\n\nboth Movie and the show is pure cinema and anyone who is or wants to come to this industry must watch and learn",
        "created": "1663783557.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "24_reddit_the_offer": {
        "author": "Latter_Feeling2656",
        "content": "It seems the screenwriter Tolkin spent a couple of weeks with the producer (now 93). This is what Tolkin said about his writing process:\n\n\"This is a question that’s always a hard one to answer,” Tolkin said. “You start with a set of facts and a set of memories, and then you find that, in order to make the drama work, you have to shift things around. And then you forget what’s real and what’s not, and that’s when you’re really flying. Once you forget that, then you just write.”\n\nhttps://datebook.sfchronicle.com/movies-tv/wondering-how-accurate-the-offer-is-about-the-making-of-the-godfather-dont-ask-its-writer/amp\n\nI don't think there's a claim to accuracy or even some nebulous authenticity in there.\n\nAs one example, the show presents the gangster Joe Gallo as shaking down the production, and the production being saved by Gallo's assassination. The real Gallo survived the end of filming by about six months, and was even still alive when the movie opened in New York.\n\n(Edit) Francis Coppola: \"That’s the point of view of, I guess, the producer but it doesn’t really reflect what really happened, in my opinion.”\n\nhttps://variety.com/2022/film/awards/francis-coppola-godfather-anniversary-walk-of-fame-1235204672/amp/",
        "created": "1663784326.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "25_reddit_the_offer": {
        "author": "AMA_requester",
        "content": "It was decent, though I felt it kinda felt it was repeating the same plotline for most of the episodes. Parent company of Paramount start getting cold feet about the movie, Ruddy convinces them otherwise, repeat. I get that likely happens all the time in production but doesn't really make for good tv, especially when it's a miniseries. I think it should've been maybe two-three episodes shorter with some fat trimming.",
        "created": "1663785341.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "26_reddit_the_offer": {
        "author": "Erick_Galdino",
        "content": "This show made me understand what a producer does lol",
        "created": "1663798423.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "27_reddit_the_offer": {
        "author": "jackdicker5117",
        "content": "One of the best things  I watched this year.  I had never even watched the Godfather before.  Really strong all around.",
        "created": "1663845669.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "28_reddit_the_offer": {
        "author": "WayneArnold1",
        "content": "It was kinda entertaining but also had a lot of forced drama that was never present during the original shoot.  Also, I would never fully trust a first hand account from a producer's pov.  Would probably recommend a fan of the movies go read any of the making of books instead.",
        "created": "1663787493.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "29_reddit_the_offer": {
        "author": "ThunderRage",
        "content": "Got hooked by the first episode.  Got my brother hooked when he visited.  I think he got my SIL hooked when he got back.  Great cast and interesting story even if not accurate.  Never noticed the plot repeats.  The guy playing Evans is a hoot and Gorman is always good in anything I watch him in.  \n\nEvans himself:  https://youtu.be/1a2qr-DKTxM?t=1",
        "created": "1663801796.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "30_reddit_the_offer": {
        "author": null,
        "content": "A TV show about making a movie. Hollywood stays innovating.",
        "created": "1663816480.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "31_reddit_the_offer": {
        "author": "amelie190",
        "content": "I'm halfway through and shocked it was so overlooked.",
        "created": "1674497807.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "32_reddit_the_offer": {
        "author": "hopalongigor",
        "content": "Ooops. Thanks. Fixed.",
        "created": "1663783983.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "33_reddit_the_offer": {
        "author": "hopalongigor",
        "content": "I choose not to read reviews about anything, anymore. I have a sentient brain, capable of making decisions of my own.",
        "created": "1664416408.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "34_reddit_the_offer": {
        "author": "hour_of_the_rat",
        "content": "Ruddy is constantly saying, \"Trust me\".\n\nEvans' character was chewing the scenery for the first half. Coppola seemed the most \"real\". \n\nMiles Teller doesn't bring anything to his character. Any one of a dozen other actors could have done the same thing.\n\nStill have two episodes to go.",
        "created": "1674636364.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "35_reddit_the_offer": {
        "author": "cynic74",
        "content": "So you’d rather read 2nd hand account written by some one who wasn’t there, rather than the producer who was?",
        "created": "1663794053.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "36_reddit_the_offer": {
        "author": "RedDurden_00",
        "content": "No worries. You’ll love the series",
        "created": "1663784031.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "37_reddit_the_offer": {
        "author": "AMA_requester",
        "content": "It’s a tricky line to walk. You either do it with someone who was involved and thus they have an inherent bias towards the situation, pro or con, or an unaffiliated person with no bias tackle it, though it’s likely aspects will get disputed by folk involved who are either also biased or actually clarifying. In my opinion we’ll never likely see a truly accurate biopic about anyone or any situation.",
        "created": "1674666001.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "38_reddit_the_offer": {
        "author": "Cr8z13",
        "content": "It's probably 90% fiction but it's entertaining as shit and a lot of fun for Godfather superfans.",
        "created": "1654893669.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "39_reddit_the_offer": {
        "author": "Chickens1",
        "content": "Brilliant TV.   I love it.  The scenes from the movie being scouted in Sicily had me giggling.  The portrayal of the characters has been phenomenal.   It's probably hollywooded up, but I love the back story with the mob being involved.  I watched all three movies while waiting for the next episode.",
        "created": "1654891263.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "40_reddit_the_offer": {
        "author": "The_Nauseous_Avenger",
        "content": "I’m enjoying it.  Would love to see a whole series on Robert Evans",
        "created": "1654901216.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "41_reddit_the_offer": {
        "author": "KryptonicxJesus",
        "content": "I look forward to it every week. Juno temple, miles teller, Colin hanks*, Matthew Goode, and Jake Canavale have been great. It may not be historically accurate but it’s been a fun watch.",
        "created": "1654893471.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "42_reddit_the_offer": {
        "author": "looster2018",
        "content": "Love it !  Enjoy all of it.   The guy who plays Robert Evans is just fantastic.  Giovanni Ribisi was surprisingly really good as joe columbo.\n\nlove the whole series.",
        "created": "1654895174.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "43_reddit_the_offer": {
        "author": "AMA_requester",
        "content": "It's decent, but rather repetitive. I understand that there's alot of drama in productions that have problems stemming from BTS or outside reasons, but it felt a bulk of the episodes were \"Company loses faith in production, they get convinced otherwise\", then next episode \"Company loses faith in person on film and wants to fire, is convinced otherwise\". It really tells me it didn't need 10 episodes, could've been 6-8 at most if they focused up the story too. Personally, I wasn't interested in seeing the Colombo end of things, especially when they have to tweak with history to make it work in a story. I felt Colombo could've been a better guest appearance in the episode where he and Ruddy meet and make the deal about removing mafia from the script. Have him be an unseen threat, instead of seeing him plan the scare attack on Ruddy by shooting up his car, seeing his car abruptly shot up would've worked way better.\n\nThere's a few instances where an episode felt it was at a perfect end point then the episode kept going. I think I noticed this more in episode 6.\n\nAs well, I also started feeling like Paramount was constantly patting itself on the back with references to other hits of theirs. In a movie about the making of The Godfather, I didn't really need to see scenes of them talking about Chinatown, or The Great Gatsby. Love Story made slight sense as Robert Evans was married to Ali McGraw at that point so reference to that makes sense, but other than that the namedropping was a bit eyerolling.\n\nIn the latest episode there was a scene of Evans talking about what the audience needs to see and what they should give them. It rings a bit hollow when a month or so ago, the same studio unveiled a slew of reboots and sequels and remakes of their old films, one of them being Love Story.\n\nOutside of that, I still enjoy seeing the ins and outs of working on a set, the acting is pretty great, Matthew Goode as Evans especially. It's nowhere near a bad show but I don't see myself rewatching it after the finale.",
        "created": "1654896063.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "44_reddit_the_offer": {
        "author": "MrBoliNica",
        "content": "i loved it, as a huge godfather fan, this show felt made for me.\n\nHeres hoping Juno Temple gets roles that arent just \"assistant who turns out to be way more competent than their bosses\" lol, even though shes great here\n\nAlso, they totally glossed over Coppola's family involvement in the film - not even mentioning that he cast his sister as Connie. And why cast Lou Ferrigno as Luca Brasi's actor, and not even give that any screen time! Weird decisions when the history is ripe for drama, but i think its worth a watch for sure",
        "created": "1654958617.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "45_reddit_the_offer": {
        "author": "jorlev",
        "content": "I'm loving every minute of this series. I only have one pet peeve.. The Title Sequences of each episode in this Paramount Plus series has subliminal Paramount logos throughout. It is the weirdest choice I've ever scene.\n\nYeah, we get it. The Godfather was made at Paramount and there's enough of Paramount references in the series and shots of the Paramount Water Tower, etc to promote Paramount. What exec at Paramount green lite this annoying intrusion of the logo everywhere in the Title Sequence thinking they have promote their streaming service there? I'm shaking my head every time I see it. Are they doing this for all their new original programming? Ugh!",
        "created": "1655611138.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "46_reddit_the_offer": {
        "author": "Grouchy_Extreme7626",
        "content": "Could care less about the Francois and Al storyline so far",
        "created": "1657758654.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "47_reddit_the_offer": {
        "author": "mhennessy348",
        "content": "I went into not expecting to be as good as it is. I'm loving it so far",
        "created": "1654900901.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "48_reddit_the_offer": {
        "author": "Granpa0",
        "content": "I really enjoyed the show.",
        "created": "1655681671.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "49_reddit_the_offer": {
        "author": "MartyVanB",
        "content": "Hated it.  Its more a movie about Al Ruddy, from his perspective mind you, than a movie about The Godfather",
        "created": "1655822428.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "50_reddit_the_offer": {
        "author": "SlotaProw",
        "content": "9 of the 10 episodes were fantastic. Episode 8 was so poorly written, it seemed like it was from a different series stuck in to break up pacing and rhythm.",
        "created": "1655770657.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "51_reddit_the_offer": {
        "author": null,
        "content": "And I hate the trope of turning Ruddy’s interesting wife into the girlfriend character that leaves him bc of work",
        "created": "1656755383.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "52_reddit_the_offer": {
        "author": "Main_Perspective3763",
        "content": "I just finished the series last night.  At first I wasn’t sure about it but by the middle , I was hooked.  I loved it.  The sets and costumes were great and the actor playing Bob really sounded like him.  I didn’t know of Juno Temple till now and she was fantastic  the actors who played Bob, Al Ruddy, Francis, and Mario were great.  Now I want to read Al’s book and Re watch the Godfather trilogy.",
        "created": "1679602959.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "53_reddit_the_offer": {
        "author": "katatafiish",
        "content": "I’m loving it, even that Miles douche is killing it.",
        "created": "1654891943.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "54_reddit_the_offer": {
        "author": null,
        "content": "Loving it so far. The whole cast is great but Juno, Giovanni and Miles killed it",
        "created": "1654914535.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "55_reddit_the_offer": {
        "author": "hipnosister",
        "content": "I don't understand how there were so many critics giving this show terrible reviews. Did they watch the show?! I haven't even seen the Godfather except bits and pieces (you can't get through life without seeing something from the movie) before but I'm really enjoying The Offer.\n\nI was also put off by the reviews and didn't start watching until episode 4 was out. The only good thing about that is that I had 4 episodes to watch.",
        "created": "1654959082.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "56_reddit_the_offer": {
        "author": "ThunderRage",
        "content": "One of the few roles Goram doesn't play a cad.  Least from when I catch him in a show.",
        "created": "1654908407.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "57_reddit_the_offer": {
        "author": "Ldbgcoleman",
        "content": "I really enjoyed it I like The Godfather but not a super fan or anything like that. It was well acted and fun to see younger actors play some of the greats. I love nostalgia and period pieces so right up my ally. I do agree it could have been cut down an episode or two",
        "created": "1656691735.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "58_reddit_the_offer": {
        "author": "Latter_Feeling2656",
        "content": "It's been pretty well rejected as history by Coppola and others. I've been through eight episodes, wasn't impressed with it as entertainment, either. I thought it jumped the shark around episode 7.",
        "created": "1654891888.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "59_reddit_the_offer": {
        "author": "Hour_Worldliness9786",
        "content": "It's entertaining. The mafia shouldn't be glorified or romanticised.",
        "created": "1654906796.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "60_reddit_the_offer": {
        "author": null,
        "content": "[removed]",
        "created": "1654890264.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "61_reddit_the_offer": {
        "author": null,
        "content": "I think they shouldve made Evans filthier. Add the coke and women.",
        "created": "1656748711.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "62_reddit_the_offer": {
        "author": null,
        "content": "I also have to say, they kind of go out of their way to make up stories to make the Italians look gross. Unless the stories are true, meaning they are in Al Ruddy’s stories, I think they are tacky.",
        "created": "1656754599.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "63_reddit_the_offer": {
        "author": "whatapisserrrr",
        "content": "95% of the acting is good. Giovanni Ribisi, Matthew Goode, Burn Gorman: excellent. Miles Teller: wooden actor. The characters, Frank Sinatra, Brando, and Pacino are ridiculously miscast and hard to take seriously. The production is cheap though. It's hilarious when the characters are walking on the back lots of Paramount, through pretend NYC, but then the actual movie try to pass off the same pretend NYC back lots in the movie. So cheezy.\n\nAfter watching how incredibly accurate the movie Gaslit was produced, which was the same period as The Offer, it's hard to overlook how cheaply the sets and costuming were done in this. \n\nPS: The mafia always drove Cadillacs, never old Lincolns.",
        "created": "1658632730.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "64_reddit_the_offer": {
        "author": "PumaNem",
        "content": "being inlove with the godfather trilogy and every other movie that dies in with these ideologies and morality as well, I got to say as this was amazing so far, currently about to go on Episode 6 . Though it's based on a true story, i'm sure 10% could've been made up to contrast a little on the more drastic moments.",
        "created": "1660058421.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "65_reddit_the_offer": {
        "author": null,
        "content": "I thought it was entertaining. But it takes waaay top many liberties with the truth to be taken seriously.",
        "created": "1660421843.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "66_reddit_the_offer": {
        "author": null,
        "content": "Fucking loved it. Just finished it now. Kept me on edge the whole show. \n\nAlso - I couldn’t fucking stand BARRY. Stupid fucking idiots that think they know what they’re talking about but they’re always 99.9% wrong 99.9% of the time.",
        "created": "1662785468.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "67_reddit_the_offer": {
        "author": "Matt215634",
        "content": "Total bullshit that crazy joe brought in Nicky Barnes for a sit down with Carlo gambling it would never happen 😂",
        "created": "1679988857.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "68_reddit_the_offer": {
        "author": "PurgatoryMountain",
        "content": "My lady and I love it. Puzzled by bad reviews.",
        "created": "1706554170.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "69_reddit_the_offer": {
        "author": "PurgatoryMountain",
        "content": "I work in the art gallery business in NYC, Chicago and Miami. The mafia and Union shutting down production seems plausible. Sometimes we still have to “grease some wheels” to get shit done on time.",
        "created": "1706617503.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "70_reddit_the_offer": {
        "author": "whatapisserrrr",
        "content": "Why on earth would they make a movie supposed to be based on true events, 90% fiction?",
        "created": "1658631979.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "71_reddit_the_offer": {
        "author": "Molow-",
        "content": "The real events that happened will surely surprise you. I was personally shocked. Look into it",
        "created": "1675195778.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "72_reddit_the_offer": {
        "author": "jorlev",
        "content": "Get a hold of this documentary: \"The Kid Stays In The Picture.\" It's the Robert Evans story and it's amazing. It makes you appreciate how spot on Goode is with his Evans character. As close as Ippolito is to Pacino.\n\n[https://www.imdb.com/title/tt0303353/?ref\\_=nv\\_sr\\_srsg\\_0](https://www.imdb.com/title/tt0303353/?ref_=nv_sr_srsg_0)",
        "created": "1655611518.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "73_reddit_the_offer": {
        "author": "redtornado02",
        "content": "Colin Ferrell is in that show?",
        "created": "1654900822.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "74_reddit_the_offer": {
        "author": "PetyrDayne",
        "content": "Matthew Goode. He's a phenomenal actor. He needs his own HBO show.",
        "created": "1654895632.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "75_reddit_the_offer": {
        "author": "frankmint",
        "content": "A lot of the script is eyerolling but I agree, not as bad a show as I expected.",
        "created": "1655834283.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "76_reddit_the_offer": {
        "author": "dreambully",
        "content": "The acting is great.\nNo matter any story. If the actors sell it and the story is worth anyone's time it wins.\nYou are right about some of the series, but the events required for this film are unmistakable and unprecedented.\nThen to have 11 Oscar nominations on top of the team, this film was in a class all is own.",
        "created": "1655696711.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "77_reddit_the_offer": {
        "author": null,
        "content": "As someone that creates software and hardware sometimes, it is a constant uphill battle to get things made when managers can cancel or redirect projects to failure at any point, you have to keep defending and correcting course or else products get canceled or is setup for failure, things getting made in corporate world is not easy, you don’t have all the decision making allowance, and others usually don’t know what they are doing, I related to every part of that. \n\nPretty much every job I had where I didn’t have full control, there is always a manager or supervisor actively trying to destroy something directly or indirectly, a lot of times just through sheer incompetence.\n\nFelt the same with Ford vs Ferrari",
        "created": "1659287834.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "78_reddit_the_offer": {
        "author": "softtouchesonly",
        "content": "I think they did mention Talia Shire being cast. I believe they show her character around episode 5 or 6, when they are in production. They also did show Ferrigno practice his lines to play Luca, also around the same episodes as the mentions of Talia. They were quick, tho.",
        "created": "1655698364.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "79_reddit_the_offer": {
        "author": "Keating5",
        "content": "In episode 7 they allude to this.",
        "created": "1655810396.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "80_reddit_the_offer": {
        "author": null,
        "content": "They mentioned it, Coppola said his sister would be good for the role, then after the slap scene, the producer and Coppola watched as her husband got hit for real",
        "created": "1659288171.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "81_reddit_the_offer": {
        "author": null,
        "content": "It’s not a documentary about the film, it’s about the producer getting the film made they way it was done, not cut to 120min, Sicily, and the most important part is probably Coppola, it would have been a different movie without Coppola. I think Coppola is the secret sauce in this and apocalypse now",
        "created": "1659288455.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "82_reddit_the_offer": {
        "author": "ratfinkprojects",
        "content": "SPOILERS\n\nwas this the episode they fired ruddy for 30 minutes, he does nothing, and they kill gallo magically making it easy to make the movie, then hire ruddy back? \n\nyeah that was weird pacing.",
        "created": "1683935819.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "83_reddit_the_offer": {
        "author": "eatyourveggiesnow21",
        "content": "Juno kills it in season 5 of Fargo. Definitely worth a watch.",
        "created": "1715966625.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "84_reddit_the_offer": {
        "author": "safeway1472",
        "content": "Have you seen Juno Temple in Ted Lasso yet? If not you got to see her and the series! You won’t be disappointed.",
        "created": "1702940404.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "85_reddit_the_offer": {
        "author": "Buttons3",
        "content": "I thought the actor who was Charlie was the guys from Theres something about Mary!  Lee Evens Hahaha",
        "created": "1658717856.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "86_reddit_the_offer": {
        "author": "qtx",
        "content": "Reviewers usually only watch the very first episode and base their score on that. It's why I never trust Rotten Tomatoes, majority of reviews are based on one episode and not the whole show.",
        "created": "1654986270.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "87_reddit_the_offer": {
        "author": "Britneyfan123",
        "content": "You should watch it",
        "created": "1677608175.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "88_reddit_the_offer": {
        "author": null,
        "content": "To have a movie with this much Bob Evans in the 70s and not have him in a pile of cocaine, seems like a loss",
        "created": "1656755513.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "89_reddit_the_offer": {
        "author": "JohnnyStunad",
        "content": "Mafia guy here.  I think you’re wrong about dat...",
        "created": "1659657004.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "90_reddit_the_offer": {
        "author": "ho1ycrapitsmatt311",
        "content": "Shut up loser",
        "created": "1677529792.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "91_reddit_the_offer": {
        "author": "HarvesternC",
        "content": "You lost?",
        "created": "1654890572.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "92_reddit_the_offer": {
        "author": "anasui1",
        "content": "Two dragons walk into a bar. The first one says, “man, it sure is hot in here.” His friend snaps back, “Shut your mouth dumbass\"",
        "created": "1654903723.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "93_reddit_the_offer": {
        "author": "Chickens1",
        "content": "r/lostredditors",
        "created": "1654891284.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "94_reddit_the_offer": {
        "author": null,
        "content": "You gotta call the judge to get some fudge",
        "created": "1654893461.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "95_reddit_the_offer": {
        "author": "Wonderful-Mountain-1",
        "content": "I’m sorry but the actor playing Pacino is PERFECT! Pacino was not the loud over the top yelling actor he is now. Have you watched anything with him back then? He was EXACTLY like the guy portraying him. That guy did his homework.  Please check out Dog Day Afternoon and you’ll get it.",
        "created": "1658642042.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "96_reddit_the_offer": {
        "author": null,
        "content": "They don’t get extra money for making it 100% fact",
        "created": "1658979169.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "97_reddit_the_offer": {
        "author": "hvr2hvr",
        "content": "It's a tv show",
        "created": "1659336222.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "98_reddit_the_offer": {
        "author": null,
        "content": "Cause it’s super entertaining and their goal is to make it entertaining",
        "created": "1658979112.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "99_reddit_the_offer": {
        "author": "The_Nauseous_Avenger",
        "content": "I’ve seen it many times.",
        "created": "1655651898.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "100_reddit_the_offer": {
        "author": "KryptonicxJesus",
        "content": "Hanks my apologies.",
        "created": "1654903014.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "101_reddit_the_offer": {
        "author": "fathermeow",
        "content": "seconded! He's one of the best parts of every movie/show he's involved in",
        "created": "1655669841.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "102_reddit_the_offer": {
        "author": "looster2018",
        "content": "He sure does !",
        "created": "1654895779.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "103_reddit_the_offer": {
        "author": "MartyVanB",
        "content": "It’s a “look how great I am” movie as told by Al Ruddy",
        "created": "1659292235.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "104_reddit_the_offer": {
        "author": "JustACasualFan",
        "content": "There is one scene with him cutting up lines.",
        "created": "1678460726.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "105_reddit_the_offer": {
        "author": null,
        "content": "That's my problem with it. It doesn't feel like acting. It feels like an impersonation.",
        "created": "1660421790.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "106_reddit_the_offer": {
        "author": "The_Nauseous_Avenger",
        "content": "He would be thrilled to be confused with Colin Farrell",
        "created": "1654916769.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "107_reddit_the_offer": {
        "author": "A_Feast_For_Trolls",
        "content": "Sure, but it was still fun as shit.",
        "created": "1679023219.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "108_reddit_the_offer": {
        "author": "safeway1472",
        "content": "And snorting it off the top of his fist. You can totally tell that Evans is off the rail on coke and booze. But, then again I know what that looks like.",
        "created": "1702940172.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "109_reddit_the_offer": {
        "author": "MartyVanB",
        "content": "It would have been fun if they focused on Puzo and Coppola",
        "created": "1679066048.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "110_reddit_the_offer": {
        "author": "Klin24",
        "content": "Ok whoever is playing the young Al Pacino is doing a fantastic job.",
        "created": "1651264084.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "111_reddit_the_offer": {
        "author": null,
        "content": "[removed]",
        "created": "1651153301.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "112_reddit_the_offer": {
        "author": "super_shizmo_matic",
        "content": "I kinda like the show. I guess you gotta be familiar with the players (Bob Evans). Also, I dunno if anybody noticed but its like a \"band of brothers\" cast reunion. There is a LOT of them in there.",
        "created": "1651243947.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "113_reddit_the_offer": {
        "author": "Sks44",
        "content": "Lots of talent in this show. It’s just bullshit. Al Ruddy and co weren’t afraid of the mob. Sid Korshack was on their side. Fucking Mickey Cohen takes a shot at Al Ruddy? Cohen was a pogue. Sid Korshack was miles above Mickey Cohen.\n\nThat being said, the dude who plays Robert Evans deserves an award.",
        "created": "1651567196.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "114_reddit_the_offer": {
        "author": "BryanW94",
        "content": "This show is good. And Miles is also good in this show. You can not like Miles personally and still think he did a good job.",
        "created": "1651621077.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "115_reddit_the_offer": {
        "author": "charles_brunson",
        "content": "I finally caught up with all the episodes aired and I really enjoy it. I don't know if the appreciation of the show would be the same if I wasn't a big fan of the Godfather.  \nThe casting is terrific, especially for such distinguished characters as Marlon Brando or Pacino. \n\nBut for me, the winner is Matthew Goode as producer Bob Evans. Does anybody else have a vibe of Ari Gold from Entourage in Goode's character? Jeremy Piven was more hilarious and Goode is more likeable, but for me it's like the same character. ",
        "created": "1654672555.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "116_reddit_the_offer": {
        "author": "SaintOlgasSunflowers",
        "content": "This is an incredible series. Every episode causes me to read more and do some research on different characters and their real-life counterparts. I end up watching old movies again looking for things I never realized when I first watched decades ago.\n\nAnyone wondering if the producers of The Offer series were harassed by the Mafia while putting this series togethers and filming it? Episode 7 left me wondering - a lot!  I hope no one was assassinated while putting this project together. \n\nI watched the original Godfather again since it had been decades since watched it. I watched Love Story as well because I started wondering more about the Ali MacGraw real-life story. \n\nDid the producers have just as many issues with the Mafia while filming the sequels to The Godfather? \n\nWatching this series is a welcome distraction from covid and other craziness in the world right now.",
        "created": "1653941183.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "117_reddit_the_offer": {
        "author": "Pop_Substantial",
        "content": "It baffles me that The Offer has received so many negative reviews from critics. I loved the show! It was so fun to see each new character show up, all were so well cast. Found it highly enjoyable and was sad when I finished the final episode!",
        "created": "1656917776.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "118_reddit_the_offer": {
        "author": "Catfantexas",
        "content": "Is there anyone else who can't take their eyes off Burn Gorman?? I LOVE Charlie, and especially his scenes with Bettye.  I'm almost rooting for them to hook up, though I doubt they will. It's amazing what she can get away with in talking to him. Like in episode 6 - \\\\\"Get me another scotch, you crazy Austrian fuck!\"",
        "created": "1653092572.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "119_reddit_the_offer": {
        "author": "Seandouglasmcardle",
        "content": "I wish they would do a second season, and shoot the series in that same style as The Godfather Part II, cross cutting the making of the movie with with Robert Evan’s backstory.",
        "created": "1655736306.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "120_reddit_the_offer": {
        "author": "CurlSagan",
        "content": "Damn, some of the reviews of this are brutal.\n\n> A soulless, vapid piece of Content™ that’s about as far removed from “art” as professionally produced television can get. \n\n.\n\n> The Offer is an illustrated Wikipedia entry stretched illogically to 10 hours by pandering to cinema fans with endless winking and nudging, and with performances that range from likably cartoonish to Madame Tussauds in a heatwave. It’s bad, but never quite boring.",
        "created": "1651131423.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "121_reddit_the_offer": {
        "author": "MrBoliNica",
        "content": "i dont get all the negativity. Or maybe im biased, i love the godfather and know alot about the story behind the making of it, but im enjoying the show\n\nany cinephile who loves the gritty 70s era of film, would love this.",
        "created": "1651268086.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "122_reddit_the_offer": {
        "author": "Yankeesbillfinger",
        "content": "Best show on TV right now.",
        "created": "1653568410.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "123_reddit_the_offer": {
        "author": "KyloRenKardashian",
        "content": "Episode 7 \"Mr Producer\" is a masterpiece. \n\ndon't get me wrong, the entire series is amazing so far,\n\nbut episode 7 was just WOW!",
        "created": "1653886690.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "124_reddit_the_offer": {
        "author": "BFaus916",
        "content": "I like it so far. Ribisi's portrayal of Joe Colombo is better than I expected and a bit heartwarming considering how it ends for him...based on history. The Joey Gallo side story will undoubtedly be the gangster subplot of this. Glad they're showing Gallo's association with black gangsters. A lot of people didn't know that about him.",
        "created": "1653117883.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "125_reddit_the_offer": {
        "author": "quangtran",
        "content": "This is yet another example of a show accused of binge-bloat. Say what you want about the old days of episodic television, but at least they tried to tell one interesting story every episode, as opposed to stretching it out to one every season.",
        "created": "1651135956.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "126_reddit_the_offer": {
        "author": "Jeffdogefan",
        "content": "It's mainly all white characters and has no woke bs in it, that's why the negative reviews. Talent is talent and a good show is a good show. This show is amazing.",
        "created": "1652075168.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "127_reddit_the_offer": {
        "author": "yahkiln",
        "content": "I just wanna say after watching it all.... I had no clue except what was in Bobs doc which wasn't much about the process of the making of the Godfather. That Al ruddy was really missed out on Godfather Part 2. And that is Insane.",
        "created": "1655451444.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "128_reddit_the_offer": {
        "author": "LA_roma",
        "content": "Guys why there is nothing about the soundtrack. It's one of the key elements making that movie exceptional.",
        "created": "1655010802.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "129_reddit_the_offer": {
        "author": "tnydnceronthehighway",
        "content": "I mean... I'm enjoying it so far. I think many of the actors (especially the ones portraying Bob Evans and Pacino) are great and I will never understand why Giovanni Ribisi isn't a much bigger star as he makes you fully believe his character regardless of how varied they are from his other rolls. I am a fan of the Godfather trilogy but have only seen it twice in my life with decades between viewings so I am not getting the easter eggs I'm sure they are dropping.  I also wasn't familiar with the story behind the making of the film so I don't know how much is true but it's interesting nonetheless.  Why do so many people seem to hate the actor who plays Ruddy? I don't really keep up with celebrity news. He does seem like he's trying too hard or something? Can't put my finger on it. I couldn't tell you the first thing about the real Ruddy so idk if that's just the character?",
        "created": "1653009065.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "130_reddit_the_offer": {
        "author": "jakdin",
        "content": "Episode 1 question: Right when we are introduced to Coppola, there's a man who walks behind him in the background, then we see the same man sitting with 2 other people. I believe that is supposed to be George Lucas and possibly his 1st wife, Marcia.\n\nThoughts?",
        "created": "1654839083.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "131_reddit_the_offer": {
        "author": "deepinterwebz",
        "content": "I found an article that details how many of the cast were guest of the actor Al Lettieri(sp?), who played Virgil Solozzo, at his family's house. His brother in law was a Capo in the Genovese Family and had given Al permission to be in it. In one visit it was many of the cast (Brando, Caan, Al Ruddy, and others). In another visit it was Pacino to practice the dinner scene. A really good article describing everything in the visits id never heard before. \n\nhttps://www.vanityfair.com/news/2009/03/godfather-family200903",
        "created": "1655146564.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "132_reddit_the_offer": {
        "author": null,
        "content": "[deleted]",
        "created": "1655016524.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "133_reddit_the_offer": {
        "author": "visual_overflow",
        "content": ">Paramount being on the losing team in Hollywood is hardly a secret. You know, VARIETY needs to find a new fucking story, man.\n\nThat actor absolutely killed that line lmao.",
        "created": "1652099374.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "134_reddit_the_offer": {
        "author": "njseahawk",
        "content": "Why is Robert Duvall/Tom Hagen omitted from the show? \nCan't find anything online....",
        "created": "1653628200.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "135_reddit_the_offer": {
        "author": "TuToneShoes",
        "content": "Loving the show. So much talk about people having body odor and bad breath which I find a little odd.",
        "created": "1655011653.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "136_reddit_the_offer": {
        "author": "SamuraiJackBauer",
        "content": "Can’t stand Miles Teller and am shocked he keeps showing up in stuff that’s supposed to be “tentpole”\n\nI mean he’s got a string of meh/failures and is an antivaxxer/douche. I don’t get it. Who are his fans?",
        "created": "1651199091.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "137_reddit_the_offer": {
        "author": "maleficentatl",
        "content": "I may have to watch this just because Miles Teller and Mathew Goode are so HAWT geez.",
        "created": "1651851901.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "138_reddit_the_offer": {
        "author": "Dnashotgun",
        "content": "Can't say i'm surprised. I know the phrase gets thrown around a lot but this genuinely feels like a \"who asked for this\" series, based off the couple reviews i've read there's not nearly enough to stretch it into 10 hr long episodes.",
        "created": "1651134283.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "139_reddit_the_offer": {
        "author": "VaKaRiSP1",
        "content": "Why are some accents weard",
        "created": "1652473059.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "140_reddit_the_offer": {
        "author": "Ok-Sink5514",
        "content": "Did Carlo Gambino make it to the private screening? I didn't see him in the audience.",
        "created": "1654908892.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "141_reddit_the_offer": {
        "author": "PadThai70",
        "content": "Lame fake built-up drama that's full of itself. Praises some of the most overrated movies ever and puts them on an untouchable pedestal. It's like a requirement to love The Godfather movies to work in Hollywood. If you don't love The Godfather movies, and kiss Coppola's ass, you're blacklisted.\n\nGoodfellas and Donnie Brasco are much better mafia movies.",
        "created": "1659844269.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "142_reddit_the_offer": {
        "author": "whycuthair",
        "content": "I wanted to like this show so much. The cinematography is exquisite, the cast is amazing, but the writing... ugh. It feels so freaking forced. And then they change little details from what actually happened for no reason at all. What I mean by forced is... for example, episode 9, we just meet Apollonia, and the casting girl asks her if she speaks any English and she goes \"Sure. Monday. Tuesday. Wednesday\", her exact lines from the movie. And this is just one example. As if the entire movie was created by this little coincidences that just happened to happen during the production. It disconnects me entirely, and it feels like I am watching a parody making of of the movie. \n\nAlso the guy playing Coppolla is way way off. The guy playing Pacino is good just for the looks, but does nothing otherwise. The guy playing Brando though, that was a top choice.",
        "created": "1674168589.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "143_reddit_the_offer": {
        "author": "psugrad98",
        "content": "I really enjoyed this show.  A bit uneven in storytelling, but I loved the acting.  I enjoyed it.",
        "created": "1676058610.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "144_reddit_the_offer": {
        "author": "Billthebutchr",
        "content": "Unwatchable because of the big idiot",
        "created": "1651159225.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "145_reddit_the_offer": {
        "author": "Fogmagnet",
        "content": "Love Miles, but Cage looks more like Al Ruddy.",
        "created": "1652185759.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "146_reddit_the_offer": {
        "author": "Alone-Community6899",
        "content": "What was wrong with Bob Evans? He praises the art of cinema and movies but still not let a director pick his cast, a director clearly in love with the opportunity to create art?",
        "created": "1672852561.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "147_reddit_the_offer": {
        "author": "mumbaiperson23",
        "content": "Just saw that episode, he was fab!!",
        "created": "1652030735.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "148_reddit_the_offer": {
        "author": "ZealousidealBend2681",
        "content": "I had to rewatch to movie to see the Christmas shopping scene. Darned if the presents DON’T make him look short!!",
        "created": "1655057078.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "149_reddit_the_offer": {
        "author": "dddfgggggdddfff",
        "content": "It kind of reminds me of John barrenthal's voice I keep thinking it's Shane talking or the punisher",
        "created": "1653072424.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "150_reddit_the_offer": {
        "author": "Jack1715",
        "content": "Even the two cops",
        "created": "1653059394.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "151_reddit_the_offer": {
        "author": null,
        "content": "Band of Brothers was unbelievable. I mean fantastic.",
        "created": "1654049493.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "152_reddit_the_offer": {
        "author": "BryanW94",
        "content": "He's great in the crown.",
        "created": "1652041594.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "153_reddit_the_offer": {
        "author": null,
        "content": "The show is described as having fictionalized versions of these real people and actors.",
        "created": "1654049407.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "154_reddit_the_offer": {
        "author": "Jack1715",
        "content": "I understand they have to add a bit of drama in there but it’s still good to see all the stuff behind it",
        "created": "1653059330.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "155_reddit_the_offer": {
        "author": "str8sin",
        "content": "That's exactly how I feel about Miles.  He's a very good actor and he's usually in good productions.  Seems like he'd be a dick though.",
        "created": "1653888408.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "156_reddit_the_offer": {
        "author": "abortizjr",
        "content": "My wife and I started watching this a couple weeks ago, also catching up.\n\nFUCKING PHENOMENAL!\n\nI watched a few interviews of Bob Evans and then looked up who the actor was that played him in the show because I honestly didn't know who he was.  My wife was a Downton Abbey watcher and I showed her this short video of Mr. Goode.  Wait until the end.  The channeling is SO uncanny.\n\n&#x200B;\n\nhttps://www.youtube.com/watch?v=8EPH2vajTU4",
        "created": "1654807081.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "157_reddit_the_offer": {
        "author": "ZealousidealBend2681",
        "content": "Put off by “size” of performance at first but it really grew on me. Justin Chambers’s Brando was the sleeper hit for me - little physical resemblance but voice, mannerisms, it “felt” like watching Brando. And as an aside, I rewatched Part 1 afterward and Brando’s performance really is mesmerizing (and yup, there’s the cat!).",
        "created": "1655056242.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "158_reddit_the_offer": {
        "author": "maayday696969",
        "content": "Actually I keep seeing Eric Roberts. I definitely agree with you regarding casting of Pacino and Brando but even being a big fan of The Godfather I think I would still enjoy this series and would definitely make me want to watch the movie.",
        "created": "1654802166.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "159_reddit_the_offer": {
        "author": "RonJonSandy",
        "content": "It has me excited to watch Chinatown again. I agree though, this has been the best show I’ve seen in quite a while.",
        "created": "1654349327.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "160_reddit_the_offer": {
        "author": "RepresentativeIce633",
        "content": "I wonder if the character of Jack was real, he was a massive prick.",
        "created": "1653941428.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "161_reddit_the_offer": {
        "author": "whatifniki23",
        "content": "Loved this show.  It was a great message to execs to let their creatives work.  There would be so many more good shows if the “money guys” and execs didn’t keep the talent stifled.  \n\nI hope the team behind this show do more behind the scenes shows.",
        "created": "1655619077.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "162_reddit_the_offer": {
        "author": "Peteskies",
        "content": "If you've seen The Sopranos, you'd know The Godfather redefined what the mafia was in the eyes of the public, and to themselves.",
        "created": "1705219038.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "163_reddit_the_offer": {
        "author": "rbinphx",
        "content": "Ditto! I’m on my second time throigh!",
        "created": "1659938510.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "164_reddit_the_offer": {
        "author": "ZealousidealBend2681",
        "content": "His is another ENORMOUS performance that threw me at first then grew on me. And his friendship with Bettye (pretty sure that’s all she allowed), and also Bettye’s with Ruddy are presented in a manner i find refreshingly realistic in a medium that rarely allows male and female characters to simple be platonic friends.",
        "created": "1655056575.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "165_reddit_the_offer": {
        "author": "str8sin",
        "content": "Burn Gorman is always great",
        "created": "1653888175.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "166_reddit_the_offer": {
        "author": "aphoticphoton",
        "content": "Late comment but I heard that the making of the godfather 2 was alot less chaotic",
        "created": "1709957945.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "167_reddit_the_offer": {
        "author": "Catfantexas",
        "content": "Yeah, I don't get the hate. I am enjoying it very much and was sorry this week's drop was only one episode...I thought it was going to be three.\n\nI love Coppolla and Puzo's scenes together especially. I didn't know who Miles Teller was before ...he's okay but not the main interest for me. Matthew Goode is exceptional as Robert Evans. Columbo and his goons are like comic relief.",
        "created": "1651872420.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "168_reddit_the_offer": {
        "author": "Jack1715",
        "content": "Let’s be honest it’s because it’s a all white cast that it’s getting hate and that shits me the motherfuckers that made the movie were white. Hollywood stop changing history to be diverse it was the fucking 70s",
        "created": "1653059594.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "169_reddit_the_offer": {
        "author": "deepinterwebz",
        "content": "Sonny I've been meaning to talk to you. I think I could be doing a lot more for the family.",
        "created": "1651740575.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "170_reddit_the_offer": {
        "author": "Jack1715",
        "content": "Like people have said probably cause it’s a all white cast and they hate that this days",
        "created": "1653059372.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "171_reddit_the_offer": {
        "author": "DestinyCE",
        "content": "i've been dying to talk about the show but theres no individual episode discussoin anywhere, unless im mistaken u guys got any links?",
        "created": "1654360206.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "172_reddit_the_offer": {
        "author": "KyloRenKardashian",
        "content": "I like the dude playing Francis Ford Coppola as well, the ping pong dude did pretty good",
        "created": "1653886767.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "173_reddit_the_offer": {
        "author": "igotbabydick",
        "content": "According to [people](https://youtu.be/2Mj05pU2eRI) close to the real Joe Colombo he’s nothing like the boss.",
        "created": "1654202229.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "174_reddit_the_offer": {
        "author": "LingeringLonger",
        "content": "Just got caught up over the past two days. Love the show as well, but I feel like Ribissi is acting on a completely different show. He is so over the top compared to everyone else. Even the guy who plays Crazy Joe Gallo is a little nutty, but it’s understandable because he was a schizophrenic in real life.",
        "created": "1654379513.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "175_reddit_the_offer": {
        "author": "uziair",
        "content": "22 episodes of season 3 lost. Says otherwise it only got good again once they had an ending pointing.",
        "created": "1651140540.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "176_reddit_the_offer": {
        "author": "Jack1715",
        "content": "I feel like someone should say “ guess what 1970s Hollywood was mostly white we shouldn’t change history to make you happy",
        "created": "1653059280.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "177_reddit_the_offer": {
        "author": "dekethecreep",
        "content": "Agreed",
        "created": "1652812852.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "178_reddit_the_offer": {
        "author": "FuckYourFuckYou",
        "content": "Based",
        "created": "1652119962.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "179_reddit_the_offer": {
        "author": "Keating5",
        "content": "From what people (aka right winger) mean for woke I'm really surprised there's been no peep on Bettye. Usually women who do less than her get labelled as 'woke' for just existing.",
        "created": "1655810204.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "180_reddit_the_offer": {
        "author": "ChampagneDragon",
        "content": "I wondered that too!  The music is iconic and beautiful.  It was wrong of them not to mention it at all.",
        "created": "1655555857.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "181_reddit_the_offer": {
        "author": "whatifniki23",
        "content": "Great point.  By the way, the theme song of The Offer was pretty awesome.  I stayed and listened to it  every time.",
        "created": "1655618730.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "182_reddit_the_offer": {
        "author": null,
        "content": "[deleted]",
        "created": "1653020598.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "183_reddit_the_offer": {
        "author": "str8sin",
        "content": "I think Teller, the guy who plays Ruddy, is kind of an ass. He'd a solid actor though.",
        "created": "1653888286.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "184_reddit_the_offer": {
        "author": "ChampagneDragon",
        "content": ">I will never understand why Giovanni Ribisi isn't a much bigger star as he makes you fully believe his character\n\nAbsolutely!  Personally, I thought he was terrific in this part (as always).  I don't understand why so many people on here thought he overplayed the role.",
        "created": "1655556671.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "185_reddit_the_offer": {
        "author": "rebelpancake94",
        "content": "I thought the same thing!",
        "created": "1655343012.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "186_reddit_the_offer": {
        "author": "whatifniki23",
        "content": "Don’t forget Paper Moon, The Longest Yard, and The Getaway.",
        "created": "1655618546.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "187_reddit_the_offer": {
        "author": "str8sin",
        "content": "They mentioned Duvall as a secured cast member. I was hoping for a short Vigoda intro.  Guess they can't do everybody.",
        "created": "1653888105.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "188_reddit_the_offer": {
        "author": "ZealousidealBend2681",
        "content": "He’s seen briefly with Brando’s lines on a cuecard stuck into his suit!",
        "created": "1655056348.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "189_reddit_the_offer": {
        "author": "ZealousidealBend2681",
        "content": "I know, right????!!",
        "created": "1655056020.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "190_reddit_the_offer": {
        "author": "Which_way_witcher",
        "content": "I don't know if it's his acting or if it's how his character is written but I feel like killing myself out of boredom every time he's on screen. I feel like they want us to like him/relate to him, but the power he has over everyone (gorgeous girl, studio giving him the best projects), I just don't understand.",
        "created": "1651440478.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "191_reddit_the_offer": {
        "author": "kodaiko_650",
        "content": "Without knowing anything about the series beforehand, I thought he was going to be playing James Caan from the poster",
        "created": "1651619558.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "192_reddit_the_offer": {
        "author": null,
        "content": "I mean, I think he did a decent job. If he’s a prick in real life, then so be it. Ribisi is a life long Scientologist dipshit, but I still love him as an actor.",
        "created": "1654049653.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "193_reddit_the_offer": {
        "author": "DebtFreeDad",
        "content": "He was great in Whiplash and has been terrible in everything else. I can't stand his acting. He is terrible and comes off arrogant about his acting talent. I don't know how he is so in demand.",
        "created": "1652391534.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "194_reddit_the_offer": {
        "author": "tnydnceronthehighway",
        "content": "Oh wow. This is the first I've ever heard of him. That's disappointing.  He's definitely just ok in this but I really like the rest of the cast's performances so far.",
        "created": "1653009510.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "195_reddit_the_offer": {
        "author": "Jodester723",
        "content": "He does nothing for me in the role. There's no inflection or emotion, other than anger. Least favorite of the ensemble.",
        "created": "1660112744.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "196_reddit_the_offer": {
        "author": "Jack1715",
        "content": "I’m finding it interesting",
        "created": "1653059486.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "197_reddit_the_offer": {
        "author": "str8sin",
        "content": "I disagree.  I think there are plenty of interesting characters and storyline. I just wish they were historically accurate.",
        "created": "1653888643.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "198_reddit_the_offer": {
        "author": "Britneyfan123",
        "content": "The Godfather ain’t overrated",
        "created": "1677608364.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "199_reddit_the_offer": {
        "author": "BradCastellano",
        "content": "Facts.",
        "created": "1672059256.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "200_reddit_the_offer": {
        "author": "dddfgggggdddfff",
        "content": "Who's the big idiot huh? I'm confused by this completely out of context conversational point. It's unwatchable because it's not good? Or because you have a bias against a certain actor?",
        "created": "1653072404.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "201_reddit_the_offer": {
        "author": null,
        "content": "Incredible. Nailed the voice of young Pacino.",
        "created": "1653948943.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "202_reddit_the_offer": {
        "author": "KyloRenKardashian",
        "content": "What two cops ?!!??????",
        "created": "1653886852.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "203_reddit_the_offer": {
        "author": "safeway1472",
        "content": "Thanks for putting that interview in your post. I enjoyed the hell out of it.",
        "created": "1702940691.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "204_reddit_the_offer": {
        "author": "maayday696969",
        "content": "Watching Chinatown now!",
        "created": "1654804834.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "205_reddit_the_offer": {
        "author": "SaintOlgasSunflowers",
        "content": "Me too. I have been reading up on Chinatown and will watch the movie soon. So far, I do not recall watching it ever in the past. Maybe it will ring a bell when I start watching it.",
        "created": "1654367316.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "206_reddit_the_offer": {
        "author": "SaintOlgasSunflowers",
        "content": "I agree! Jack Ballard was real. And a real prick.",
        "created": "1653943161.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "207_reddit_the_offer": {
        "author": "ChampagneDragon",
        "content": "Hear, hear!  Couldn't agree more!  It's wonderful to see Bettye's relationship with Al - two equals and friends with no hint of romance.  And Charlie's harmless flirting, rooted in respect and friendship, is great too.  BG is such a phenomenal actor. I don't think he gets enough credit.  He was outstanding in Turn, too.",
        "created": "1655556461.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "208_reddit_the_offer": {
        "author": "TellYouEverything",
        "content": "First off, let me say that as a Godfather superfan, I’m really enjoying this show.\n\nA blast to binge.\n\nHaving said that:\n\nThe dialogue is corny\n\nThe coolest “happy accidents” trivia that I’m sure most of you have heard about are rushed through. For example, they fix Luca Brasi’s actor’s performance within a minute of the issue being brought up. They just clip along from trivia point to trivia point with no realistic dialogue and moments in between.\n\nThere are no real profound moments mining a scene for deeper meaning. A larger parallel about the elements of family/ corruption/ power and influence could have been weaved in, instead, it’s all very surface-level.\n\nI’m gonna savour the last three episodes. After having seen so many films/ interviews of cast and crew, it’s quite a pleasure just to watch the performances of the recognisable faces and imagine what it must really have been like. As if the show is just to nudge the imagination and provide context clues for a bit of mental time-travel.\n\nI wonder if they were hoping to do a season around Godfather Part II?",
        "created": "1653867441.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "209_reddit_the_offer": {
        "author": "ZealousidealBend2681",
        "content": "I honestly don’t think that has anything whatsoever yo do with it; I love the show but it’s sloppily made and arguably cheapens the legacy of a classic film to “tv movify” it. So I think it’s a natural target for “Cinefile” critics. I’ve seen no sign of a “political correctness” backlash but happy to see examples to the contrary.",
        "created": "1655056909.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "210_reddit_the_offer": {
        "author": "RepresentativeIce633",
        "content": "Dan Fogler, he’s great",
        "created": "1653941473.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "211_reddit_the_offer": {
        "author": "RonJonSandy",
        "content": "Ping pong movie with James Hong who was in the movie Chinatown which was produced by Robert Evans. This means absolutely nothing but I find it interesting to some degree.",
        "created": "1654349647.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "212_reddit_the_offer": {
        "author": "BFaus916",
        "content": "Good story, the acting is good enough. I certainly didn't expect anything Scorsese-like out of this and anyone who did had their expectations a little high. Again, I think Ribisi plays Colombo fine in scenes with him and Miles. Him with the other actors playing mob bosses, none of them are good, honestly. But in juxtaposition to a civilian character and the fact that they were building a friendship made him more plausible in my opinion.",
        "created": "1654391136.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "213_reddit_the_offer": {
        "author": "upstatestruggler",
        "content": "Ribisi is overacting and it’s distracting",
        "created": "1655251809.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "214_reddit_the_offer": {
        "author": "quangtran",
        "content": "Can't agree. There were a handful of episodes I didn't care for (the tattoo one, Expose), but after the bumpy mini season the episodes just got better and better. Even \"filler\" like the one with the birds were good episodes.",
        "created": "1651149786.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "215_reddit_the_offer": {
        "author": "SlimShadyM80",
        "content": "Season 3 of Lost is argueably the best season",
        "created": "1651143918.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "216_reddit_the_offer": {
        "author": null,
        "content": "Did you dislike season 3 of Lost?\n\nI'm confused by this comment.",
        "created": "1651142012.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "217_reddit_the_offer": {
        "author": "Craphole-Island",
        "content": "Episode 6-22 of season 3 are all bangers though (except the Jack tattoo ep).",
        "created": "1651198842.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "218_reddit_the_offer": {
        "author": "ChampagneDragon",
        "content": "Exactly.  No one should rewrite history based on current trends.",
        "created": "1655556753.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "219_reddit_the_offer": {
        "author": "LA_roma",
        "content": "I can only guess there are copyright issues. There is no reason not to have anything on that masterpiece.",
        "created": "1655624968.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "220_reddit_the_offer": {
        "author": "LA_roma",
        "content": "Maybe there are copyright issues...",
        "created": "1655624888.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "221_reddit_the_offer": {
        "author": "Tree24K",
        "content": "He is absolutely killing it as Evans and should win best supporting actor.  I can't even believe this is Matthew Goode.",
        "created": "1654113209.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "222_reddit_the_offer": {
        "author": "ChampagneDragon",
        "content": "Ugh, he is?  I thought he was great as Ruddy.  That's a shame that he's a disappointment as himself.",
        "created": "1655556556.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "223_reddit_the_offer": {
        "author": "tnydnceronthehighway",
        "content": "I do wonder how much of that is the real life Ruddy who is telling the story, right?",
        "created": "1653009617.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "224_reddit_the_offer": {
        "author": "SamuraiJackBauer",
        "content": "You know what’s interesting?\n\nI’ve had about 1 person a day, every other day since this show was launched message me either for/against him. \n\nThis thread has had more legs than any other I’ve seen in years. \n\nI’m going to see his this weekend in Top Gun cuz there’s no way I’m not seeing that movie.",
        "created": "1654054495.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "225_reddit_the_offer": {
        "author": "PadThai70",
        "content": "The Godfather is boring AF, just like all FF Coppola movies",
        "created": "1677628596.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "226_reddit_the_offer": {
        "author": "Britneyfan123",
        "content": "Nope",
        "created": "1677608368.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "227_reddit_the_offer": {
        "author": "Billthebutchr",
        "content": "Teller is a big fucking idiot",
        "created": "1653073982.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "228_reddit_the_offer": {
        "author": "Jack1715",
        "content": "The detectives that see him after micky Colleen shit his car",
        "created": "1653904447.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "229_reddit_the_offer": {
        "author": "RepresentativeIce633",
        "content": "Wow. The actor did a real good job making him hatable.",
        "created": "1653943248.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "230_reddit_the_offer": {
        "author": "Scotfighter",
        "content": "This doesn’t cheapen it. It values it if theirs a tv show made about the making of a movie.",
        "created": "1659796650.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "231_reddit_the_offer": {
        "author": "tetoffens",
        "content": "I love it but I get their point. That was the season where we had like 6 episodes of characters in zoo cages and a whole episode dedicated to a tattoo.",
        "created": "1651144307.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "232_reddit_the_offer": {
        "author": "uziair",
        "content": "I dont dislike it was around 7 episodes too long. With all those shit filler episodes.",
        "created": "1651144871.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "233_reddit_the_offer": {
        "author": "ChampagneDragon",
        "content": "Yes, probably but they still could have discussed it.  That music was everywhere in the 70s.  I remember my first grown up jewelry box had the theme music, lol!",
        "created": "1655625957.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "234_reddit_the_offer": {
        "author": "A_Feast_For_Trolls",
        "content": "Nothing more pathetic than someone who feels the need to find a discussion thread about a show focuses on a certain subject just to let everyone know they find it overrated. Great contribution...",
        "created": "1678985026.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "235_reddit_the_offer": {
        "author": "dddfgggggdddfff",
        "content": "Oh I had to look it up the Dude that plays ruddy. I don't know him personally so I just know him from his work. \n\nI make it a point to not give a crap what people are like in real life just ask the question do I enjoy their performances or not and I really liked whiplash so that's the only other thing I've seen him in and I checked this out. \n\nAnd he seems to be good in this as well. I wasn't sure who you were talking about.",
        "created": "1653074144.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "236_reddit_the_offer": {
        "author": "KyloRenKardashian",
        "content": "the ones that asked Ruddy to wear a wire ? I think I got it now, thanks. this shows fantastic. episode 7 was a masterpiece",
        "created": "1653905843.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "237_reddit_the_offer": {
        "author": "SaintOlgasSunflowers",
        "content": "True! He did a great job triangulating and playing an asshole. \n\nJack getting fired in real life might have saved his life. He died of an unknown illness in 1983, I believe. AIDS?",
        "created": "1653943531.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "238_reddit_the_offer": {
        "author": "Jodester723",
        "content": "The actor played a very hated doctor on ER, a Dr Romano. Plays a good \"guy you love to hate.\"",
        "created": "1660112297.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "239_reddit_the_offer": {
        "author": "whycuthair",
        "content": "It cheapens it from an artistic point of view. Just finished it andI thought the same.",
        "created": "1674174651.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "240_reddit_the_offer": {
        "author": "ACID_pixel",
        "content": "This only happened because ABC requested a pretty short concise six episode run to start Season 3 with before they took a mid season break, and then came back with the rest of the episodes the following year. Lindelof and Cuse weren’t super thrilled about that but thats why we ended up spending a bit too long in the cages at the Hydra Station with Kate, Jack, and Sawyer.\n\nIt was all worth it though when they went back to get Jack and they see him playing football.\n\nI’m also currently rewatching Lost with my fiancé after having not seen it in about 6 years and the show absolutely still has all its gusto. Groundbreaking stuff for the time.",
        "created": "1651169829.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "241_reddit_the_offer": {
        "author": "SlimShadyM80",
        "content": "True the tattoo episode was shit house.",
        "created": "1651144663.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "242_reddit_the_offer": {
        "author": "PadThai70",
        "content": "Nothing more pathetic than someone who spends their time writing a response like that. Great contribution...",
        "created": "1679065463.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "243_reddit_the_offer": {
        "author": "Jack1715",
        "content": "I don’t think that was them it was the ones who parked next to him",
        "created": "1653906713.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "244_reddit_the_offer": {
        "author": null,
        "content": "Roten tomatoes  critics give score of 50%  and the  audience give  95% ... that's pretty good... \n\nSome critics say it's not funny enough, others wanted it to be a documentary,  some are angry that it cost too much to produce, everybody has their 2 cents.\n\nThe  subscribers of Paramount Plus would rate it  100%",
        "created": "1654279638.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "245_reddit_the_offer": {
        "author": "Corvettedriver",
        "content": "The Offer is fantastic. Most of all it’s a great story about the making of The Godfather movie and has some great actors in the leading roles. It’s been a long time since i’ve had so much fun watching a tv series. Thumbs up from me👍",
        "created": "1654273430.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "246_reddit_the_offer": {
        "author": "WayneRooneysHairPlug",
        "content": "I like the show a lot. I wouldn't compare it to the Sopranos myself, but I really like it.",
        "created": "1654263937.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "247_reddit_the_offer": {
        "author": "K_ThomasWhite",
        "content": "I've also been watching and enjoying it.\n\nI'll agree on your other point as well. I recently tried Apple TV+ because people were talking about how great their shows are. There are maybe a couple or three shows on it I like, but the rest...not so much. I think some of their shows are pretentious or downright boring. Like they tried to stretch a two hour movie into a ten episode mini-series and wound up with a soap opera. I do find more content I like on Paramount+.",
        "created": "1654265561.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "248_reddit_the_offer": {
        "author": "rh60",
        "content": "I love this show and came here looking for a sub-reddit expecting 100k subscribers. I can't believe it's not the hottest show on TV right now. It is for me.",
        "created": "1655327026.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "249_reddit_the_offer": {
        "author": "MazW",
        "content": "Patamount+ does have some good shows. I also liked \"The Dollar\" or maybe it was called \"One Dollar,\" anyway I was the only person who watched it.",
        "created": "1654267391.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "250_reddit_the_offer": {
        "author": "StrengthComplete914",
        "content": "I haven't watched it yet but I heard it was good. Critics got it wrong.",
        "created": "1654313033.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "251_reddit_the_offer": {
        "author": "DankFrank777",
        "content": "Fantastic show! It has been one of my faves along with all my friends to watch every week together. Also everyone kills it in acting in the show, the dinner sequence with the whole cast of the movie getting together for the first time might be one of my all time favorite scenes in a show ever.",
        "created": "1654840639.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "252_reddit_the_offer": {
        "author": "DirtyMikeandtheBoysz",
        "content": "Because the app sucks. I can’t get through one episode without lagging or having to restart the app. It’s a shame because I really want to watch the show. All my other streaming services work great so I now it’s not my WiFi.",
        "created": "1656455867.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "253_reddit_the_offer": {
        "author": "XxDankShrekSniperxX",
        "content": "I though the title said \"the office\" I was like wat.",
        "created": "1654265603.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "254_reddit_the_offer": {
        "author": "godspilla98",
        "content": "I was about to post about this show when I saw this. The show is the only show on streaming that I truly love and its over next week. I will get it if it hits Blu Ray it is a work of art and the comedy is top notch. Everything from acting to the story I mostly accurate . I have the out dated making of the trilogy book I think the only thing changed was Gallo gets it after the release of the film I have to go relook it up. But time well spent on a great show.",
        "created": "1654797845.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "255_reddit_the_offer": {
        "author": "3dpimp",
        "content": "It's a little overly sentimental about Hollywood in general. I don't think it's as bad as I did when it started; I get the jokes now. But that's probably the answer to your question.",
        "created": "1654820224.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "256_reddit_the_offer": {
        "author": "patdoc199",
        "content": "Great show - anytime Puzo & Coppola are left alone together it is genius/hilarious",
        "created": "1657129985.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "257_reddit_the_offer": {
        "author": null,
        "content": "Mostly cause it’s so far removed from reality that the whole thing feels like a weird vanity project. Some of the cast is great, others are pure pantomime. But mostly it’s the fact basically nothing happened this way, not even close, and that makes this alternate history drama masquerading as the real thing a chore to watch.",
        "created": "1654288928.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "258_reddit_the_offer": {
        "author": "Jack3ww",
        "content": "I never seen it but I think it's funny how they are trying to make it look like some behind the scenes  crime stuff was going on when it came to making the godfather",
        "created": "1654629952.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "259_reddit_the_offer": {
        "author": "BiffBiffkenson",
        "content": "Watching the last episode now.  It's really well done imo.  \n\nI wasn't watching a documentary so there is that.",
        "created": "1654796594.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "260_reddit_the_offer": {
        "author": "Jkane007",
        "content": "By far one of my favorite series in a long time. Would love more!",
        "created": "1656549100.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "261_reddit_the_offer": {
        "author": "LoyalAries",
        "content": "Whether it's  true or not I'm getting a kick out of it. Really enjoying it.",
        "created": "1656642738.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "262_reddit_the_offer": {
        "author": "IV4K",
        "content": "In love it however,\n\nWatching Actors playing other Actors many of whom are still alive is a bit weird.\n \nYou can’t really enjoy it properly unless you’re a big fan of the Godfather in the first place, this hurts the shows wide accessibility.",
        "created": "1659094312.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "263_reddit_the_offer": {
        "author": "Unusual_Relation1392",
        "content": "I got hooked since episode 1. Still on my way to finishing the 1st season, tho.",
        "created": "1661818763.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "264_reddit_the_offer": {
        "author": "WayneRooneysHairPlug",
        "content": "> some are angry that it cost too much to produce\n\nWhy would anyone care about that?",
        "created": "1654281134.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "265_reddit_the_offer": {
        "author": "K_ThomasWhite",
        "content": "> Roten tomatoes critics\n\nI've said it before, but I still can't imagine why anyone would pay any attention to them. I think they need to find real jobs.",
        "created": "1654281345.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "266_reddit_the_offer": {
        "author": "JoeMcKim",
        "content": "It seems like these critics worry about a bunch of silly stuff.  Who cares how much a production cost?  Your job as a reviewer is to review the movie/series based on the onscreen merits of the project.  It seems like most of them can't just sit down and enjoy or don't enjoy something like a normal person.",
        "created": "1655847213.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "267_reddit_the_offer": {
        "author": "Ldbgcoleman",
        "content": "Those critics only watch the first one or two episodes I feel like this really started hitting its stride in episode three. Also nothing Hollywood ever does is true and factual they play with what really happened in practically every true story they make sometimes to the point of unfairly smearing some historical figures. I actually enjoy exploring the true story after I watch the Hollywood version on things",
        "created": "1656692209.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "268_reddit_the_offer": {
        "author": "godspilla98",
        "content": "serious comedy that makes me laugh out loud is a 100% winner in my book but the sad part its over next week.",
        "created": "1654798021.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "269_reddit_the_offer": {
        "author": "JoeMcKim",
        "content": "Masters of the Air mini-series later this year produced by Tom Hanks is the thing I'll wait to get AppleTV+ for.  But I'll just wait till all of the episodes are up then and watch them all during the 1 week trial and cancel afterwards.  That's what I just did with The Offer.  I already have Disney+, Hulu, Prime, subscribing to another service for a single show is overkill.",
        "created": "1655847359.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "270_reddit_the_offer": {
        "author": "TheNewNewYarbirds",
        "content": "Ted Lasso is life tho",
        "created": "1657688167.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "271_reddit_the_offer": {
        "author": "bisesar",
        "content": "Yeah that was a cool little show.",
        "created": "1654282942.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "272_reddit_the_offer": {
        "author": "marndar",
        "content": "I've read quite a bit on the making of the movie, and there is no question that they are portraying a lot of it quite accurately (certainly the casting elements to the movie and the dilemma as to whether Francis Ford Coppola was the right choice for director).\n\nI'm guessing they're stretching some of the mafia side plots a bit (although some of the stories involving Joe Columbo and Joey Gallo are correct, even if the dates are a bit off). Maybe it's a bit of a vanity project for Al Ruddy (certainly not for Robert Evans), but that's to be expected a bit since he's the executive producer of the series.",
        "created": "1654824699.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "273_reddit_the_offer": {
        "author": "K_ThomasWhite",
        "content": "> But mostly it’s the fact basically nothing happened this way\n\nHow do you know that?",
        "created": "1654347067.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "274_reddit_the_offer": {
        "author": "marndar",
        "content": "The final episode is next week.",
        "created": "1654824308.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "275_reddit_the_offer": {
        "author": "hurtsdonut_",
        "content": "I thought I heard they were going to do a spinoff based on Bob Evans but I can't seem to find anything to back that up.",
        "created": "1657252623.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "276_reddit_the_offer": {
        "author": "Dry-Paint-2621",
        "content": "Had never seen the godfather until after this series, for me it was actually almost better that way. Watching the godfather one and two afterwards made me appreciate the offer even more 🤷‍♂️",
        "created": "1699858160.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "277_reddit_the_offer": {
        "author": "miamipolicedep",
        "content": "You mean you don't want them to disagree with you.  If they liked the movies you liked you'd support them all the way.",
        "created": "1659979048.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "278_reddit_the_offer": {
        "author": null,
        "content": "Because it's one of the most documented productions in the history of film? Because the people actually involved, who are still alive, have all stated the Paramount series is wildly fictitious?",
        "created": "1654350893.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    },
    "279_reddit_the_offer": {
        "author": "BiffBiffkenson",
        "content": "Oh even better!",
        "created": "1654853438.0",
        "rating": "",
        "show": "the_offer",
        "source": "Reddit",
        "title": "",
        "type": "Human"
    }
}