{
  "yellowjackets": [
    {
      "review": "No entiendo cómo el público puede calificarla mal, cómo si no la  hubiesen visto. La segunda temporada es maravillosa,  oscura,  entretenida,  tiene un desarrollo de personajes genial.",
      "date": "May 23, 2024",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Weird but so entertaining! It's not afraid of going dark and keeps it believable.",
      "date": "May 9, 2024",
      "rating": 4.0,
      "episode info": "Season 2"
    },
    {
      "review": "What made the first season great it’s ramped up in the second season and the toll of living in the wilderness without food & hope of rescue begins to take effect on the girls. The only issue I have, same as the first season, is the modern day scenes don’t quite match up.",
      "date": "May 7, 2024",
      "rating": 3.5,
      "episode info": "Season 2"
    },
    {
      "review": "This Is The Worst Thing I've Ever Seen In My Life!!!!",
      "date": "May 4, 2024",
      "rating": 0.5,
      "episode info": "Season 2"
    },
    {
      "review": "Just as good as season 1.",
      "date": "Mar 11, 2024",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Nope. Pulling the plug after episode 3. Had enough.\n\nI did enjoy the first season though.\n\nWhy on Earth are the critics' reviews so out-of-step with the audience?",
      "date": "Mar 3, 2024",
      "rating": 0.5,
      "episode info": "Season 2"
    },
    {
      "review": "Season 2 was super frustrating. No real answers to any mysteries. There are no likeable characters. I can't watch 3 more seasons of this despicable silliness.",
      "date": "Feb 29, 2024",
      "rating": 1.0,
      "episode info": "Season 2"
    },
    {
      "review": "Very stimulating.  I loved season 1, season 2 really ramps up the mystery of this show.",
      "date": "Feb 22, 2024",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "The drama is a lot less believable than season 1, and the mystery elements are too farfetched. Without any grounding or likeable characters, it's hard to get excited about season 3.",
      "date": "Jan 17, 2024",
      "rating": 2.0,
      "episode info": "Season 2"
    },
    {
      "review": "One of this show's greatest strengths is also perhaps its greatest weakness. Every show of prominence needs a hook to gain a viewer's attention. J.J. Abrams put it best in his discussion of the \"mystery box.\" It's what drives the show forward. It's reason for being. In the case of Yellowjackets, it's been the question of \"what happened in the woods\" that would drive the girls to be who they eventually became. Yet, one other lingering question, alluded to in the first season, is what extent of their actions was influenced by the supernatural. The writer's hesitation to fully embrace the supernatural leaves me, and subsequently the characters in a state of limbo. Stephen King is a master of this medium. His material makes it abundantly clear from the start that the supernatural drives the madness in his characters (usually has some form of metaphor). The rest of the story usually focuses on the characters decisions to rectify the situation (sometimes to horrific consequences).\n\nMy issues aside all the strengths of the first season carry over into the second season. There are some absolutely captivating performances from all those involved that only help to bolster the story and really keep you invested. Plus, I would be remiss if I didn't mention the ending of episode 2. This has to be the single best use of a Radiohead song in a TV show or movie... Ever. The scene is disturbing and haunting and the song lends to a sense of foreboding that can't help but leave you with the feeling that there's no turning back.",
      "date": "Jan 10, 2024",
      "rating": 4.0,
      "episode info": "Season 2"
    },
    {
      "review": "Loved it just as much as the first season, even though at times parts seemed strange. But overall an enjoyable second installment",
      "date": "Jan 9, 2024",
      "rating": 4.5,
      "episode info": "Season 2"
    },
    {
      "review": "I can't believe how terrible the whole second season was … won't waste anytime on the third !",
      "date": "Jan 7, 2024",
      "rating": 1.0,
      "episode info": "Season 2"
    },
    {
      "review": "I can not in good faith give this show anything more than I have. The final episode was in a way thee worst season finale I have ever seen for any show that I have ever watched in my life. I have no clue what they were attempting to do. Every moment of the last episode was corny and didn't make sense what so ever. Pure goofiness at every turn. I don't know what else to say, I have nothing, I just know I won't ever watch another episode of this again under ANY circumstances. I am through.",
      "date": "Jan 5, 2024",
      "rating": 0.5,
      "episode info": "Season 2"
    },
    {
      "review": "Started out loving the show, but then it just got creepy, will probably skip if there is a season 2.",
      "date": "Dec 9, 2023",
      "rating": 3.0,
      "episode info": "Season 2"
    },
    {
      "review": "With a more uneven and jumbled narrative coupled with a more lackluster dramatic weight, Yellowjackets Season 2 is acted and shot well with some solid scenes occasionally, but overall this is a step down from the first season.",
      "date": "Nov 10, 2023",
      "rating": 2.5,
      "episode info": "Season 2"
    },
    {
      "review": "An underwhelming but well-acted sophomore season.",
      "date": "Nov 9, 2023",
      "rating": 2.5,
      "episode info": "Season 2"
    },
    {
      "review": "I've been obsessed with this show since the first episode!",
      "date": "Oct 30, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Season two wasn't impressive as the first season. It is still one best shows going, yet the show needs to decide if it is fantastic or psychological? Lost-ification is the main problem. More questions than answers.",
      "date": "Oct 29, 2023",
      "rating": 3.0,
      "episode info": "Season 2"
    },
    {
      "review": "Your curled up under a blanket but also somehow on the edge of your seat, this season ending had me desperately grasping for more. Not only is it sickening (in a good way) 😂, it's also comical. Without Misty the show would have been pure horror.",
      "date": "Oct 21, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "The second season took a dip in quality from the first.  Where the present and past storylines were both mysterious, engaging, and shocking in Season One we find here that the past storyline far outshines the present.  I have difficulty buying what the present storyline is selling for these characters.  They are losing my interest but the young actors in the past are crushing every scene and keeping me watching.  Is it just me or are there two or three characters from the past that just weren't even in season one?  The rapture that was the first season and a decent second season will keep me watching but I hope the story grows stronger.",
      "date": "Oct 17, 2023",
      "rating": 3.5,
      "episode info": "Season 2"
    },
    {
      "review": "Season 1 felt slow (I could've done without 80% of the present day nonsense) but this season drags it's feet even more painfully.",
      "date": "Oct 2, 2023",
      "rating": 2.0,
      "episode info": "Season 2"
    },
    {
      "review": "Goddamn the performances in this show making me almost enjoy this drivel. Every single actor is working their ass off in every scene, and multiple times did it actually grip me. Especially THAT scene from the end of one of the later episodes. \n\nHowever, the rest of the show is average at a push. Some of the effects are a little janky, especially the green screen when out in the wilderness. And the pacing is so slow it's even less than a crawl. I spent two seasons watching the script tell me how crazy the girls got while being out in the woods, yet it shows next to none of it outside of one scene. And, I have to say, that scene comes out of nowhere without really any buildup or reasoning, they just suddenly go insane. The script and writing really is 90% of my issue with the show. It's an interesting premise executed relatively poorly. I don't get the hype around this show. \n\nAlso, season 2 actually rounds things out quite nicely. I'd have happily had it end here. So, while I'll watch a 3rd season at some point once it's released, I'm not exactly excited for it!",
      "date": "Sep 26, 2023",
      "rating": 2.0,
      "episode info": "Season 2"
    },
    {
      "review": "I enjoyed season 1 because of the buildup, the feeling of impending doom (thanks to what viewers got glimpse of in the very 1st episode), and the many questions dancing in my boggled mind. But in the end, I was immensely disappointed. I felt so let down by the first season's finale that I wasn't sure if I'd even bother with the second. Because I didn't begin watching it until the 2nd season was already out, I was able to jump right back in. I'M SO GLAD I CONTINUED WATCHING!! Season 2 was a delicious surprise (okay, poor wording haha). Sure, the audience is still WTF-ing throughout, but as Season 2 unfolds, more and more pieces (yuck) come together making it will worth the watch for anyone who invested time into Season 1. \n\nThe entertainment factor is dead-on! I don't mind the ambiguity of not knowing whether or not \"it\" is an external force or something internal within each character due to everything endured and all that was done in order to survive. But there are still so many WTF's left to be deflowered! I look forward to Season 3. With many new and old questions begging to be answered, I hope Showtime delivers and that they clean the storyline up a bit and patch up some plot holes to make season 3 worth 5 stars. (The cast, btw, is consistently 5-star worthy)\n\nSuch a disturbingly interesting show this is.",
      "date": "Sep 26, 2023",
      "rating": 4.0,
      "episode info": "Season 2"
    },
    {
      "review": "I know a lot of people were more disappointed with season 2, but I LOVED it. The adult plot line won me over this season. ESPECIALLY Lottie's and Misty's storylines. I loved Lottie's calm yet unnerving presence. I loved Natalie and Lottie's dynamic (in both the past and present), and I especially loved Misty, who is constantly doing the most for Natalie and doing all she can to rescue her, even when Natalie doesn't need rescuing. The visuals this season were amazing, the character dynamics were so well done, and the character growth (whether it be redemption or corruption) was fantastic. And this season was also so heartbreaking as well, with Shauna's pregnancy, and Crystal's death, and that last scene between Coach Ben and Natalie... the emotions felt so much more raw this season than the last, and this season made me love this show even more. I know we're impatiently waiting to see what exactly happened in the woods, but I love a good slow burn, and Yellowjackets is definitely giving me one",
      "date": "Sep 25, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "I finally had to bail on this show after nearing the end of Season 2...\n\nThe series has just completely jumped the shark.\n\nEvents are getting just too ridiculous (and horrible!), and the lack of verisimilitude in the winter starvation sequences in the wilderness is more than I can take.\n\nPhooey!",
      "date": "Sep 15, 2023",
      "rating": 1.5,
      "episode info": "Season 2"
    },
    {
      "review": "AMAZING, MASTERPIECE, IM IN LOVE",
      "date": "Sep 10, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "The first season was almost perfect. The second season became so FUKKlNG_STUPID! Am I the only one that thinks the screenplay just went batshit crazy towards the end?",
      "date": "Sep 4, 2023",
      "rating": 0.5,
      "episode info": "Season 2"
    },
    {
      "review": "Usually the second seasons of great series are not as good as the first, or maybe the audience has always great expectations.\nThis is maybe the case of this second season too.\nThe narrative seems a bit slower and twisted, compared to the first season, even if the dramatic unexpected end keeps alive the curiosity to watch the third season.\nAnyway the great cast makes everything go well and the characters stay always in your heart so...anxious to watch the third season!",
      "date": "Aug 29, 2023",
      "rating": 4.0,
      "episode info": "Season 2"
    },
    {
      "review": "E genre work dar e superb",
      "date": "Aug 27, 2023",
      "rating": 4.5,
      "episode info": "Season 2"
    },
    {
      "review": "Great season mostly but the last episode's adult plotline was bad.",
      "date": "Aug 26, 2023",
      "rating": 3.5,
      "episode info": "Season 2"
    },
    {
      "review": "It's decent, kinda slow, first season was better.",
      "date": "Aug 17, 2023",
      "rating": 3.5,
      "episode info": "Season 2"
    },
    {
      "review": "Love it 10/10 for both seasons 💰🔥😊",
      "date": "Aug 12, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Seriously. What happened? This season lacks continuity and fundamentally went from creepy and mysterious horror story to awful ZANY character plot lines that make no sense and do not contribute to the overall story. This is bad writing with clear motivations by executives to string the viewer's eyeballs along for screen time. What a waste of money. This could have been done in two seasons, or even one. GLAD I WATCHED THIS GARBAGE WITH A FREE TRIAL.",
      "date": "Aug 5, 2023",
      "rating": 1.5,
      "episode info": "Season 2"
    },
    {
      "review": "Temporada terriblemente floja, parece otra serie distinta al nivel que mostraron en la temporada anterior. El downgrade que le hicieron al personaje de Lottie es lo que, a mi parecer, mato esta temporada ya que la anterior cerró mostrándola a ella como líder de un culto y la antagonista de la serie y en esta la mostraron como una mártir que ni siquiera fue la precursora de la carnicería que pasó en el bosque, eso dejo sin rumbo alguno la trama.",
      "date": "Aug 1, 2023",
      "rating": 2.0,
      "episode info": "Season 2"
    },
    {
      "review": "Brilliant show, great characters and edge of the seat! Can't wait to see how it all comes together in the end!",
      "date": "Jul 30, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Boring, nonsensical, character progression went in the completely wrong direction, did not earn any of the \"dramatic\" moments.",
      "date": "Jul 21, 2023",
      "rating": 0.5,
      "episode info": "Season 2"
    },
    {
      "review": "I remain more committed to the contemporary cast, even when their plot lines go off the rails - Ricci, Lewis and especially Lynskey are often hilarious and always watchable.  Adding Elijah Wood to that mix was a brilliant idea - like Ricci's Misty, his Walter is kind of scary, always hilarious, and easy to root for.\n\nThat said, I don't wish to belittle the work of the younger cast.  Shauna, Tai, Natalie, Travis and Misty are always engaging.  Lottie I am still not completely sold on in either timeline, but maybe that is how we are supposed to feel about her. \nShe is bat shit crazy and dangeous, and those lemming-like characters whose names I still don't know threaten to bring down the entire group with their Lottie worship.  \n\nI am guessing they will be food eventually, but I thought the girl whose hunt and eating we saw in S1, E1 was a blonde! Now I have to go back and watch that again - although once was enough...",
      "date": "Jul 21, 2023",
      "rating": 4.0,
      "episode info": "Season 2"
    },
    {
      "review": "Perfect blend of occult, the psychological toil of collective trauma, & heartache. The pacing is excellent & the influx of supporting characters tied into the world of the survivors keeps things interesting! Well done!",
      "date": "Jul 19, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "The second season started of strong, but 7 of the 9 episodes are filler garbage. I can't count how many scenes are just crying or screaming making it hard to watch at times. The writing was cringy and the pace of the show so stagnant it was a battle trying to uncover the  plot. It's a shame because the first season was great.",
      "date": "Jul 18, 2023",
      "rating": 2.0,
      "episode info": "Season 2"
    },
    {
      "review": "Never fails to shock or delight. Femdrama with a dark core.",
      "date": "Jul 12, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "All the worst parts of season 1 and none of the good ones. The worst part is that we already all know they gonna make 3-4 more seasons, milk it until everybody hates this show.\nSo much promise.... I don't get it.... \nNext season I'll just watch the recap.",
      "date": "Jul 9, 2023",
      "rating": 2.0,
      "episode info": "Season 2"
    },
    {
      "review": "Hope to see more of this series.",
      "date": "Jun 26, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "This season got better and better. Humour mixed in with suspense and intrigue to where things will go.\nSuperb soundtrack to accompany",
      "date": "Jun 21, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Disappointing as hell.",
      "date": "Jun 18, 2023",
      "rating": 2.5,
      "episode info": "Season 2"
    },
    {
      "review": "The show just became annoying, from awful opening to every single character it just feels bad.",
      "date": "Jun 16, 2023",
      "rating": 3.0,
      "episode info": "Season 2"
    },
    {
      "review": "Not as good as season one but still a great watch season three needs to step in up",
      "date": "Jun 16, 2023",
      "rating": 4.0,
      "episode info": "Season 2"
    },
    {
      "review": "The second season falls a bit short compared to the first but seems to put everyone and everything in place in preparation for season 3.",
      "date": "Jun 13, 2023",
      "rating": 3.5,
      "episode info": "Season 2"
    },
    {
      "review": "Season 1 had me absolutely hooked and I waw so excited for season 2, but from the very first episode I could tell the writing had severely declined. So many unnecessary plots or characters that didn't go anywhere. Writing seemed all over the place and I was so pissed about the death at the end. The storyline for the character didn't feel finished! Really disappointed about a show that I had become so invested in.",
      "date": "Jun 12, 2023",
      "rating": 2.0,
      "episode info": "Season 2"
    },
    {
      "review": "The first season was pretty good all around.  You could tell they were stalling the story but you figured by season 2 you'd see what you came for.  That simply didn't happen.  They still just hint at the hunts and cannibalism to come.  It's not convincing that they are starving.  Throw some make up and make them look emaciated at least.  The whole angle of some mystical wilderness force is really dumb.  I think they wanted to make a tight mini-series and then saw the potential for a cash cow and hit the brakes.  The adult sequences just aren't all that interesting even though the actresses are great.  There isn't enough meat here.  This should have been a tight 2 season mini-series, instead it's going to be a 6 season slog that goes nowhere.  I'm too old for this.  I'm not investing any more time, I'm done with this.  I guess Juliette Lewis felt the same way.",
      "date": "Jun 8, 2023",
      "rating": 1.5,
      "episode info": "Season 2"
    },
    {
      "review": "One of the biggest fall from grace seasons I've ever seen, they abandoned all their interesting plotlines and focused on the quirky ones to the point of actual stupidity. The baby latching sequence was almost incredible, and ALMOST saved the season... But then they chalked it up to a dream sequence, which was frankly the worst writing decision I've ever seen. The show was dead after that, nothing matters so why care about any of it?",
      "date": "Jun 5, 2023",
      "rating": 1.5,
      "episode info": "Season 2"
    },
    {
      "review": "Ehh, season 2 took a deep dive. Very much mid tier now",
      "date": "Jun 3, 2023",
      "rating": 2.5,
      "episode info": "Season 2"
    },
    {
      "review": "Strong second season with more cannabilism and more consequences of that past seeping into their present. Didn't see much of the yellowjackets together in the first half, allowing for greater development of said consequences individually. I enjoyed the sccene of them together in the latter half. Overall good escalation of desperation in the scenes set in the past.\n\nPossible spoilers:\nI enjoyed the Shauna scenes in the present, mainly because I liked getting to see more of Callie (with hopes that she plays more of a role in the third season) and the breath of fresh air that Jeff's intentionally humorous scenes were. Shauna's madness was definitely there in the first season as far as I can remember, but they don't let us forget about it this season. I also just love Melanie Lynsky's voice. Speaking of madness, those last scenes set in the present during the final episode required greater suspension of disbelief than the rest of show did, which is saying a lot. Walter was an interesting addition to the cast, that fits almost too well with Misty, but his acting is good and the scenes are entertaining so I'm find with it. I was expecting Tai's sleepwalking to get worse in the second half, but it's almost forgotten, which might not be a plot hole assuming thats because Tai was acting in favor of what her \"other side\" wanted, but it threw me off because I thought the sleepwalking flare-ups were associated with stress levels - and I can't imagine her stress subsided after that crash. Coach Ben's increasing distance from the rest of the group was well-developed throughout season, though I didn't dig the transitions to his pre-flight-crash scenes - the scenes themselves were meaningful, and honestly the transitions were probably made to be intentionally jarring since the reason he was experiencing these \"flashbacks\" is because he felt increasingly out of place with the group, so I don't actually mind it.",
      "date": "Jun 3, 2023",
      "rating": 4.0,
      "episode info": "Season 2"
    },
    {
      "review": "Weird and interesting. Hooks you right away. Great characters!",
      "date": "Jun 2, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "My favorite show of the season, fantastic follow up to season 1! It's definitely trauma inducing and might give you a panic attack, but necessary viewing for young women, especially how early adolescent trauma can stay with you to adulthood",
      "date": "Jun 2, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Season 1 was amazing. Left us with interesting cliffhanger that just went nowehere in season 2 or rather have been made to a much less interesting thing. The first two episodes were great, but from then on it just started going downhill. Huge dissapointment and waste of time.",
      "date": "May 31, 2023",
      "rating": 1.5,
      "episode info": "Season 2"
    },
    {
      "review": "Went way downhill this season",
      "date": "May 31, 2023",
      "rating": 2.0,
      "episode info": "Season 2"
    },
    {
      "review": "What happened? What happened to the story, to the characters (some of them are just empty, bad-asses are just dumb now), to the danger in the wilderness, to the thrill, to the mystery? Why all this pseudo-mysticism now? There are literally \"holes\" in the story now. Nonsenses. I did love season 1 so much but season 2 is so so so disappointing. No more fun. No more suspense. No more interest. In one word, this season 2 is: boring.",
      "date": "May 31, 2023",
      "rating": 0.5,
      "episode info": "Season 2"
    },
    {
      "review": "I think this show is losing its way. The teenagers' storyline is engaging, but the adults' storylines are aimless and much less interesting.  In certain key moments, the characters suddenly lose all common sense for the sake of the plot. Elijah Wood and Christina Ricci were great though. \n\nHopefully next season they will have better stories for the adults, or else I'm giving up on it.\n\nHopefully next season",
      "date": "May 31, 2023",
      "rating": 2.5,
      "episode info": "Season 2"
    },
    {
      "review": "Season one was fantastic but season two just got unrealistic and gratuitous, loosing it's story telling ability.",
      "date": "May 30, 2023",
      "rating": 1.0,
      "episode info": "Season 2"
    },
    {
      "review": "Picking up right were season one ended the second season of Yellowjackets will lead us further into the wilderness and impact of it on the now adult members of the team. This season also finally shows how the team ended up driven into cannibalism and how they realized that it was their only chance for survival. In the present timeline the survivors of the plane crash are force to accept their traumas and face the wilderness once again with a tragic ending.\n\nThe most remarkable element of this season and show is the acting. Both cast, teen and adults, deliver outstanding performances with Melanie Lynskey, Sophie Nélisse, Christina Ricci, Samantha Hanratty, and Sophie Thatcher taking the spotlight. The soundtrack selection for each episode is spot on adding more emotions and completing the atmosphere already created by the scrip and the cast's members. The only flaw that can be found on this season is the writing. While it's written in a way that the timelines are easy to understand, by moments they're adding more information without answering previous questions first. It also jumps from one event to another leaving the girls trauma response into a surface level overusing the \"I don't wanna talk about it\" feeling. This can hurt the series on the long run since some details will be left behind in order to wrap up the story.\n\nWith a lot yet to be revealed this triller drama is far from being over. With a third season confirmed we can only hope for at least one more season to give the series the proper ending. The season finale leaves both timelines in a cliffhanger rising the expectations for what will come next. This is the perfect show for people who want to get started into cannibalism content since it doesn't features the usual amount of gore yet.",
      "date": "May 30, 2023",
      "rating": 4.5,
      "episode info": "Season 2"
    },
    {
      "review": "Thought this season wasn't as good as the first however still awesome. \n\nVarious exciting story lines and at the end keeps you on your feet. Hopefully there is season 3.",
      "date": "May 30, 2023",
      "rating": 4.0,
      "episode info": "Season 2"
    },
    {
      "review": "Season 1 was great...this season really jumped the shark. Plot is all over the place and numerous storyline inconsistencies make in hard to watch",
      "date": "May 29, 2023",
      "rating": 0.5,
      "episode info": "Season 2"
    },
    {
      "review": "Season two ruined the show for me. Bad storylines, cringe writing, and a waste of good talent. Not sure what they were thinking this season.",
      "date": "May 29, 2023",
      "rating": 3.0,
      "episode info": "Season 2"
    },
    {
      "review": "The second season looses its steam after an excellent first season. In a weird way, the past storyline goes way faster than expected and, on the other hand, the present storyline takes its time and drags a little.\n\nFinally, the show is taking the cannibalistic route that was foreshadowed for the whole first season, and it is glorious as it is terrifying and provocative. That said, it goes so fast that the big question is, what's left in the story for future season? We still have more than one year in the past storyline after all (and season since to be limited to 3 months maybe).\n\nThe present storyline has its up and down, if we get some new interesting characters, we spend too much time with the main protagonists separated with stories that don't feel as urgent as the first season. One storyline with police officers was frustrating to get through. Eventually the finale bring all the gang together put doesn't go high enough to make for the drag of the whole season.",
      "date": "May 29, 2023",
      "rating": 3.5,
      "episode info": "Season 2"
    },
    {
      "review": "Sadly this season was a huge miss in my opinion.\nThis season just ends up dragging storylines that are not very interesting and completely rushes the ones that are relevant to the story progression and that we want to see. Also, particularly in the finale, a lot of the stuff that happened was very conviniently woven and not believable at all.\nAt this point it really feels like there is no one to root for, especially in the present storyline.\nI only score it this high because I still adore the elements of this show and its ambience.",
      "date": "May 27, 2023",
      "rating": 3.0,
      "episode info": "Season 2"
    },
    {
      "review": "Such a good show!\nThe casting and writing are both phenomenal. \nWill be doing rewatching  at least  3 times to get my fix until season 3",
      "date": "May 27, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Una temporada llena de flashbacks que, en su mayoría no aportan nada a la trama principal y un final de temporada muy predecible desde el capítulo 7. \nLamentablemente esta temporada deja más preguntas que respuestas.",
      "date": "May 27, 2023",
      "rating": 2.5,
      "episode info": "Season 2"
    },
    {
      "review": "See my review from season 1 but worse now. Every critic is so in love with this show and I don't know why.  It SUCKS!!!",
      "date": "May 27, 2023",
      "rating": 0.5,
      "episode info": "Season 2"
    },
    {
      "review": "wow, I do not recommend... it takes a super long time to go through each of the Yellowjackets individual stories, going back and forth in time from the days stranded in the forest, to the current time and how the experience of eating human flesh in the forest out of necessity, created drama in their lives, some of them so emotionally damaged they took to alcohol and drugs... give me a break... then somehow someone supposedly found a journal written by one of the members outlining how they allowed a teammate to die while watching them drown in the frozen lake, just so they could butcher, skin and barbecue him to eat, and so one of the yellowjackets kills the person she thinks stole her diary and plans to expose the team, so now the twist in the story turns to a murder investigation, then a second yellowjacket member helps bury the body, so now several people are implicated in a murder 25 years after the event... it is extremely repetitive and the storyline gets more and more complicated as it goes on, with no redeeming quality, another yellowjacket wants the group to draw cards to see who must die, then she is shot by the daughter of the one of the yellowjackets, and another one is accidentally stabbed in the heart and dies protecting one of the others... you get the picture, that is truly how outlandish the script is... if it were a true story, like the Donnor party or another sports team who truly did end up eating the body of one of the dead in the group, then it would have some interesting psychological value, but don't be misled, this is a fantasy fictionalized account of things that would never ever happen in real life and the purpose of the story, if there ever was one, is lost somewhere on the writer's floor... don't waste your time... they could have told the whole story in 6 total episodes (not 18 and we are still left hanging) and it would have been much more interesting and informative... even as just a fictional fantasy story in the genre of crime horror, it stinks..,",
      "date": "May 27, 2023",
      "rating": 1.5,
      "episode info": "Season 2"
    },
    {
      "review": "FIRST SEASON - Great\nSECOND SEASON - Stupid\n\nThe first season of Yellow Jackets was a masterpiece. The second season has been a mumbled mess. The ending of the second season is like a car crash with things happening which make no sense. \nI think it has got so bad that they have lost their way with it. So sad.",
      "date": "May 26, 2023",
      "rating": 2.0,
      "episode info": "Season 2"
    },
    {
      "review": "Season 2 was even wilder and creative then the first.  Made for deep thinkers and those who want honest character development (which takes time).  Truly breathtaking endings each episode.  Bravo",
      "date": "May 26, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Season 1 was superb. Insanely good I'd say. Season 2 on the other hand is underwhelming. The addition of Lauren Ambrose did nothing mostly because she doesn't say or do anything. Significantly less fun but more actors that don't contribute much. It just feels crowded.",
      "date": "May 24, 2023",
      "rating": 1.5,
      "episode info": "Season 2"
    },
    {
      "review": "The first season was excellent, yellow jackets became my favorite show on television after only a fee episodes... loved the acting, story, twists and turns and the mystery just seemed grand..: \nBut on this season, they focus on the investigation of the murder pf Shawna's lover from season 1 ... which is not interesting ... I would've loved to continue with the plot that secrets from their time in the wilderness were about to come out... that they are hiding such a dark thing.., also, the mysterious sightings of the signs and the cult were really interesting but ended up being nothing ...  we waste the entire season dealing with Shawna trying to avoid the police and being at Lotties retreat place... I hate to say it, but it's boring...  what ever happened to the mysterious things happening in the wilderness? They just stop and we focus the most boring shit",
      "date": "May 23, 2023",
      "rating": 3.0,
      "episode info": "Season 2"
    },
    {
      "review": "First season ok with some promise and mystery. Then they lost it. Didn´t know what to do with it, lost direction and just dropped the ball. Similarly as with \"Servant\" and probably others. Definitely my last season since this is hopelessly lost forever. Shame.",
      "date": "May 22, 2023",
      "rating": 1.0,
      "episode info": "Season 2"
    },
    {
      "review": "This is so beautiful so spooky and gory full of excitement can't wait for the finale episode gonna cry lolz hehe bye thx for reading",
      "date": "May 22, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "The first few episodes of the first season were great, I liked the premise, and was interested in the characters.  It steadily went downhill afterward, with the airplane's stuffed bear episode's supernatural element ruining the show's potential for me, but I stuck with it, until the end of the season, which I will add, the finale truly was a disappointment. \n\nI thought I'd give it another chance with season 2, but it was absolutely horrible writing from start to finish.  Which for me was episode 6,  when I just couldn't take anymore of it, it was too stupid to continue watching.",
      "date": "May 21, 2023",
      "rating": 0.5,
      "episode info": "Season 2"
    },
    {
      "review": "This season is absolutely terrible. I don't know if it's the writer strike or if they just had no clue what direction they actually wanted to go when making the first season or if they just gave up but the second season is absolutely awful. Terrible terrible writing.",
      "date": "May 20, 2023",
      "rating": 0.5,
      "episode info": "Season 2"
    },
    {
      "review": "They lost it after season 2. I don't know if they have new writers in there but this season is a complete borefest.",
      "date": "May 19, 2023",
      "rating": 2.0,
      "episode info": "Season 2"
    },
    {
      "review": "Has gone from unbelievable to ridiculous compared to last season.",
      "date": "May 17, 2023",
      "rating": 3.0,
      "episode info": "Season 2"
    },
    {
      "review": "Absolutely enjoyed season 1,  season 2 seems dragged out and not satisfying in solving mysteries.  Granted there are two episodes to go, but so far it's a little disappointing.  Plus I can't stand \"old Natalies\" acting.  Young Natalie was terrific! I was amazed how the two Misty's, past and present were perfect, also the Jan's were an excellent choice.",
      "date": "May 16, 2023",
      "rating": 3.0,
      "episode info": "Season 2"
    },
    {
      "review": "Acting is superb but other wtf is even going on. Pacing is BAD. Characters and motives aren't believable. I'm just watching at this point to get to some of the \"answers\" but even those questions are beginning to fall flat. A whole lot of 'what could have been' gone to waste",
      "date": "May 16, 2023",
      "rating": 1.5,
      "episode info": "Season 2"
    },
    {
      "review": "It would be nice if RT would allow episode reviews from everyone.  Just watched episode 7 and man did they find a way to make the characters even more unlikeable.\n\nThey managed to turn the dumbness up to a 12 in episode 9.",
      "date": "May 15, 2023",
      "rating": 0.5,
      "episode info": "Season 2"
    },
    {
      "review": "This is possibly the worst second season I have ever seen. Season 1 was good, they built up the intrigue, storylines had a purpose.\n\nDon't know what changed but something clearly did between season. Silly, out of place artsy scenes. Boring storylines, why do the whole Shona baby thing for nothing to happen. Why even bother.\n\nSomeone, maybe a few people should be getting the sack for season 2, they're not fit to work on high end series.",
      "date": "May 14, 2023",
      "rating": 0.5,
      "episode info": "Season 2"
    },
    {
      "review": "Season 1 was really good but this season is awful. Each episode gets worse and worse.",
      "date": "May 13, 2023",
      "rating": 2.0,
      "episode info": "Season 2"
    },
    {
      "review": "It was a fun show to watch",
      "date": "May 9, 2023",
      "rating": 2.5,
      "episode info": "Season 2"
    },
    {
      "review": "The first season was dark and original. I don't know what happened in the second season but it suddenly feels like riverdale. It's so predictable and cheesy. It's so bad it feels like it's making fun of cheesy teen movies. The writing is lazy, the plot feels predictable, the music choice is often laughable.\n\nAlso, some new characters are just added out of nowhere at the beginning of season 2. The writers have no idea where this show is going so I guess they added some characters because they had plot idea? I don't even know\n\nDon't waste your time with this show",
      "date": "May 9, 2023",
      "rating": 0.5,
      "episode info": "Season 2"
    },
    {
      "review": "I stopped watching.  It was just too stupid.  I hung on through the first season, but I wondered if the writers had any idea where this was going.  I don't think they did.  I understand it's not a series to be taken seriously, but this turned out to be a waste of time.",
      "date": "May 8, 2023",
      "rating": 0.5,
      "episode info": "Season 2"
    },
    {
      "review": "Great first season. Moved along well, lots of revelations and we looked forward each week. Season 2 is so, so slow. I don't think after a half dozen episodes that we know anything more than we did in the first season. Characters constantly saying 'you don't know what we had to do out there to survive' with no 'so, what did you do?'. Are they even struggling to survive? Cozy fires every night, everyone tucked in their bed and all look as healthy as they did since the crash. What a waste of a good thing.",
      "date": "May 6, 2023",
      "rating": 2.0,
      "episode info": "Season 2"
    },
    {
      "review": "Its thrilling mix of coming of age, dark comedy, tense thriller and moving drama.  The casting is spot on, with some great attention paid to the younger cast members who really shine at times.  Its a bit of a slow burn, but once it kicks into gear, you have a great ride ahead.",
      "date": "May 5, 2023",
      "rating": 4.0,
      "episode info": "Season 2"
    },
    {
      "review": "A show filled with clichés and girls screaming at each other",
      "date": "May 4, 2023",
      "rating": 1.0,
      "episode info": "Season 2"
    },
    {
      "review": "the show has some heavyweight characters in the older generation. this, although doesn't help this series. somehow the producer decided to go for a third season and just stretch our every storyline. i don't appreciate this stalling in the storyline and i am about to call it quits",
      "date": "May 4, 2023",
      "rating": 2.0,
      "episode info": "Season 2"
    },
    {
      "review": "Season 2 seems like cheesy network television compared to season 1.",
      "date": "May 1, 2023",
      "rating": 0.5,
      "episode info": "Season 2"
    },
    {
      "review": "Even better than the first season. The low audience score is just a result of impatience. And honestly? Misogyny.",
      "date": "May 1, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "I loved season 1 and I am intrigued with season 2. I do think it has been a slow build but I think they pay off will be worth it in the coming episodes. It has been especially cinematic and well edited. I like the mystery around the supernatural or not. My hope is that it isn't, and it has just been a coping mechanism or trauma experience for them. I would rather it not be due to supernatural forces. I like the idea that they are doing the things they are because of the circumstances, hunger and trauma not because something is making them. It's difficult because I feel like if we were able to binge the show we wouldn't be thinking it's a slow build but as it's weekly we have more time to digest each episode which I'm really enjoying. The character building has been so clever, and you can start to see a lot more now how the young teens became the adult versions. Still all to play for and I think/hope that the last episodes here are starting to really ramp up and give more answers and questions.",
      "date": "Apr 27, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "I can't say much that hasn't already been said but this show is insanely addicting. Part of what I like is that it defies categorization because it's so many things. It's a coming of age teen show, it's a drama, it's a comedy (if you have dark humor), it has a touch of supernatural, and it's obviously a survival epic. The casting alone deserves every single possible award, not just for the actual talented ensemble that's been put together but how alike the teen and adult versions of the characters look and act. Just superb all around.",
      "date": "Apr 27, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Quality show. Second season is living up to the last season, although the first season was slightly better. Well worth a watch and way better than most shows nowadays.",
      "date": "Apr 25, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Have loved this season so far, it just keeps building of from the greatness of last season",
      "date": "Apr 25, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "RT really needs to let us comment on people's ridiculous opinions 2 episodes into a 10 episode season. Like how much TV do ya'll watch?? This audience score really is a case of having too much to watch and people being being spoiled. This season is a slow burn but it's just as good as season 1. Don't listen to the bored dummies with nothing better to do than trash a show before it's even had a chance to get going.",
      "date": "Apr 24, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Favourite series, recommended",
      "date": "Apr 23, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "The first season had my attention, but this second season feels forced and lazy. I'm bored. I miss The Wilds.",
      "date": "Apr 22, 2023",
      "rating": 2.0,
      "episode info": "Season 2"
    },
    {
      "review": "Excellent, chilling, just love this series…!!!",
      "date": "Apr 21, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "First season was great. Astounded by how bad the second season is so far. Was there a writer change? Conflict on set? Hoping it gets better.",
      "date": "Apr 21, 2023",
      "rating": 1.5,
      "episode info": "Season 2"
    },
    {
      "review": "A show with possibly too many subplots but even with that flaw it does provide a pitch perfect mix of thrills and laughs. The performances are outstanding by the entire ensemble cast. Every episode leaves me wanting more.",
      "date": "Apr 19, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Love this show and this season.",
      "date": "Apr 19, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Best show I have seen in a long time. It has a wonderful cast of actresses and actor that all have an amazing range. The writing is unique and original and every episode makes you want to know more.",
      "date": "Apr 17, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "I am thoroughly entertained. Always leaves me wanting more!",
      "date": "Apr 16, 2023",
      "rating": 3.5,
      "episode info": "Season 2"
    },
    {
      "review": "This is one of those series--like \"The Haidmaid's Tale,\" where you are invested just because you want answers. The cast members truly do bring the characters to life, but after every episode, you feel like screaming, \"COME ON NOW!\" A let's \"jump-on-the-bandwagon,\" series.",
      "date": "Apr 16, 2023",
      "rating": 2.5,
      "episode info": "Season 2"
    },
    {
      "review": "Our favorite psychological suspense thriller about a crazy, killer girl's soccer team; The Yellowjackets; is back!   The hilarious, terrifying, madcap, zany antics of that cursed high school girl's soccer team has officially started it's Season 2 on Showtime; and the show does not disappoint.  Still, as before, we get all the before and after Lost-like flashbacks of our 4 main characters; Shauna, Misty, Natalie and Tai; and their adventures in the 90s; as they survive that horrific Lord of the Flies type crash ordeal they endured for a year and a half as adolescents; and then also the aftermath now; with their adult selves; 25 years later.  We continue to see their terrifying shared history as they were stranded in the Canadian Rockies for 19 months; and then wound up resorting to all sorts of terrifying ordeals and horrifying behaviors; including orgies, witchcraft and cannibalism to survive.  We see all that, and then we see how those ordeals from the past affect them as middle aged women trying (pretty unsuccessfully) to reacclimate themselves to normal civilian life!  It's very much a \"cursed scenario\" thriller; where all the characters are under some sort cloud; much like a classic Greek Tragedy; or Final Destination and Drag Me to Hell; etc.  And it's also a you-can't-escape-from-your-past type show; like I Know What You Did Last Summer or Prom Night.... and you can't!  Try as these women might!  You can't escape your past; and you can't escape your destiny; and we see those themes play out over and over again on this show!  It's like the Yellowjackets are perennially caught in quicksand; and the more they struggle; the more things get worse and worse!  This season includes scenes of the actual cannibalism that happened back in the Canadian Rockies; and some of the other alluded-to horrors that were just hinted in Season 1!  Also Elijah Wood shows up in Season 2, becoming part of the regular cast; reuniting with his Ice Storm (1997) co-star Christina Ricci; once again playing her love interest, like he did the last time.  We see more about Lottie; her supernatural powers; and her growing cult of followers (that Natalie becomes a part of) at Camp Green Pine.  And there's even more shocking plot twists here than in season 1!  There's more twists here than a kite caught in a hurricane!  Some of it admittedly gets complicated with all the myriad running subplots here; but hey; unspooling this stuff is half the fun!  Still a great show!  Still filled with sizzling, shocking thriller elements; with all sorts of sex and gore and blue material that will make you blush; and also air-tight suspense that will keep you on the edge of your seats!  It's no Facts of Life!  That's for sure!  But it's still awesome!! Highly recommended!",
      "date": "Apr 16, 2023",
      "rating": 4.0,
      "episode info": "Season 2"
    },
    {
      "review": "The show continues to offer just enough new information and new ideas without answering too many questions. Intriguing and dark and fun. Great additions to the cast. Can't wait to see where they go with this!",
      "date": "Apr 15, 2023",
      "rating": 4.0,
      "episode info": "Season 2"
    },
    {
      "review": "The 1st season…😱 2nd is 🤬. Better start filming the 3rd season now as I'm a lost fan for having to wait so long for this?   Writer's block sucks…",
      "date": "Apr 14, 2023",
      "rating": 0.5,
      "episode info": "Season 2"
    },
    {
      "review": "it's a little too soon to actually elaborate a concrete opinion on this S2. specially in my country, Italy, where just today, April 12th, we started to be able to watch S2 on Paramount Plus. but, seems weak. very weak. UPDATE : nothing has changed for the better. the S2 E3 called digestif, actually is very hard to digest. the only positive side is that the cast is full of brilliant actress. but if the script is weak even they can't do anything. UPDATE : no land on the horizon. still an incredibly talentet cast.",
      "date": "Apr 12, 2023",
      "rating": 2.0,
      "episode info": "Season 2"
    },
    {
      "review": "Yellowjackets season 1, had me hooked.  Unfortunately, season 2 (episodes 1-3) are slow and boring. I tried to get through it, but had to turn it off. If it picks back up later on, I'll try again. The actors are some of my favorites. But even they can't save it from such a dull storyline.",
      "date": "Apr 11, 2023",
      "rating": 1.0,
      "episode info": "Season 2"
    },
    {
      "review": "This show is amazing.   Not only is the writing incredible but the acting, and cast can't be matched.",
      "date": "Apr 10, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Since WestWorld season 1 , and Euphoria I didn't found such a great TV Show, All the cast is mesmerizing, the production value is great. this show deserves lot of praises, I think most people will be hooked to this show because it's a mix of Lord of the Flies / 90's Nostalgia and the plot is great . Season 2 starts strong and fast...",
      "date": "Apr 9, 2023",
      "rating": 4.5,
      "episode info": "Season 2"
    },
    {
      "review": "A bit boring so far, especially the older characters storyline",
      "date": "Apr 9, 2023",
      "rating": 2.0,
      "episode info": "Season 2"
    },
    {
      "review": "Thought the 1st season was pretty good. The 1st 2 episodes of season 2 weren't bad but I could not make it through the 3rd episode. To me, it just went off the rails in story telling and how absurdly silly it was getting.",
      "date": "Apr 9, 2023",
      "rating": 2.0,
      "episode info": "Season 2"
    },
    {
      "review": "So far S2 has been great. It's much harder to review a show when there's only 1 episode per week & right now we're only at E3. That said, it seems to be moving along slower than S1 but that's probably because as I stated above. Things are mounting up for the adult survivors in similar & different ways. The wilderness is definitely in them. It's clear that in order for the kids to survive, blood must be spilled in order for the wilderness to provide meat to eat. Blood for blood. If I had to guess, I think Coach will be the next to succumb to the elements & starvation. I was disappointed slightly in E3 because things happened but at the same time nothing happened. E3 seems to be a catalyst of new problems that'll arrive in E4.",
      "date": "Apr 8, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Whatever planet this was made on, send it back",
      "date": "Apr 8, 2023",
      "rating": 2.0,
      "episode info": "Season 2"
    },
    {
      "review": "I find this show addictive and don't know why. I don't like how many different directions it goes in but I can't stop watching it...",
      "date": "Apr 6, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "This is a great show we watch it every week,",
      "date": "Apr 6, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "First Season was not bad, second season is a hot mess",
      "date": "Apr 6, 2023",
      "rating": 1.5,
      "episode info": "Season 2"
    },
    {
      "review": "Very unsettling, love it",
      "date": "Apr 6, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "I think the series is amazing and has a great plot twist near the end, the story is cunning, intriguing even more by the minute, and has you on the edge of your seat for 90% of it. I will continue watching until they stop making it, then I will boycott and recommend more season ideas",
      "date": "Apr 4, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Fantastic show. Second season is taking its time but it remains very unsettling.",
      "date": "Apr 4, 2023",
      "rating": 4.5,
      "episode info": "Season 2"
    },
    {
      "review": "Think I'm done with the show.  Made it to episode 3 and throwing in the towel.  this whole season is just slow and convoluted.",
      "date": "Apr 4, 2023",
      "rating": 1.0,
      "episode info": "Season 2"
    },
    {
      "review": "Waited till the second episode as I always do for second seasons, and wow \"Edible Complex\" is such a good episode introducing Elijah Wood and the show is starting to make sense of the c********* storyline and Taissa's hatred for meat.",
      "date": "Apr 3, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "I liked the first season, this season is just slow and weird.",
      "date": "Apr 3, 2023",
      "rating": 3.0,
      "episode info": "Season 2"
    },
    {
      "review": "Dumb even for fantasy",
      "date": "Apr 2, 2023",
      "rating": 2.0,
      "episode info": "Season 2"
    },
    {
      "review": "Great show! Casting for the actors playing the roles 20+ yars appart is spot on. It is a show that is taking certian subjects and bringing them to the screen.",
      "date": "Apr 1, 2023",
      "rating": 4.0,
      "episode info": "Season 2"
    },
    {
      "review": "Load of the Flys in the 21st Century. Only the players are meaner, nasty and just sick.\nJust what we need, another dark degrading digressing story plot.",
      "date": "Apr 1, 2023",
      "rating": 1.0,
      "episode info": "Season 2"
    },
    {
      "review": "Can't stop watching. Episode 1 started slow but two opens a lot of doors.",
      "date": "Apr 1, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "This show lacks any real substance and moves at a snail's pace. I agree with the person that called it convoluted.",
      "date": "Apr 1, 2023",
      "rating": 2.0,
      "episode info": "Season 2"
    },
    {
      "review": "Boring and dark, but mostly convoluted",
      "date": "Mar 29, 2023",
      "rating": 0.5,
      "episode info": "Season 2"
    },
    {
      "review": "First episode was good not great, but what is was is promising. The first episode started slow and had a solid ending, very excited for the coming episodes.",
      "date": "Mar 29, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Can't speak for the entire season but as for the first episode........INCREDIBLE! Love this show.",
      "date": "Mar 28, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "The first season was interesting and showed promise. The second season is all mood with no substance. It's style with very little content. Another series stringing us along…boring!",
      "date": "Mar 28, 2023",
      "rating": 1.0,
      "episode info": "Season 2"
    },
    {
      "review": "awesome series, cant wait for next season",
      "date": "Mar 28, 2023",
      "rating": 4.5,
      "episode info": "Season 2"
    },
    {
      "review": "As thrilling as ever",
      "date": "Mar 28, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Not a improvement from season 1. Think season 1 is still the best but it does suffer alot of problems i had with season 1 too. The show needs to explain whether there is actually any supernatural forces in presents and some action like a villain, the slow burn pasting is starting to become a problem and hope it changes in season 3.",
      "date": "Mar 27, 2023",
      "rating": 3.0,
      "episode info": "Season 2"
    },
    {
      "review": "S2E1 - Deeply Satisfying Return Takes a Step Toward Cannibalism ****\nS2E2 - Episode 2 Raises New Questions and Drives Characters Toward Madness ***1/2\nS2E3 - Episode 3 Deepens the Supernatural Mysteries ****1/2\nS2E4 - Episode 4 Sharpens the Dividing Lines and Rips Open \"Old Wounds\" ***1/2\nS2E5 - Episode 5 Transitions the Series Toward a New Type of Horror ***1/2\nS2E6 - Must-See Episode 6 Packs a Devastating Emotional Wallop *****\nS2E7 - Episode Seven Forces Its Characters to Face Harrowing Truths ****\nS2E8 - The Wild Rumpus Begins in the Penultimate Episode ***1/2\nS2E9 - Season Finale Closes This Chapter in a Blaze of Devastation ***1/2",
      "date": "Mar 27, 2023",
      "rating": 4.0,
      "episode info": "Season 2"
    },
    {
      "review": "Season 1 is still superior for me. Some scenes felt like dull. It's still good and well acted but the writing is lackluster.",
      "date": "Mar 27, 2023",
      "rating": 2.0,
      "episode info": "Season 2"
    },
    {
      "review": "LOVE this show!!!!!!",
      "date": "Mar 27, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    }
  ]
}