{
  "special_ops_lioness": [
    {
      "review": "Show was great Zoe and the main lead was all so good her struggles and getting to find something she values in life was great to watch",
      "date": "May 12, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great casting, with an inconsistent start, but well worth the time investment!",
      "date": "Apr 27, 2024",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great cast, they work well together, good main story but the back stories and the lesbian affair was dreadful and unnecessary to the story over all.  I'd watch a second season for the cast, in the hope the story improves",
      "date": "Mar 20, 2024",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "Lioness delivers an exhilarating experience with its relentless action and expertly crafted suspense leading up to an explosive climax that doesn't disappoint. However, it's worth noting that the series does contain graphic violence, making it unsuitable for all audiences. Personally, I found \"Lioness\" to be thoroughly captivating. The weekly release schedule kept me eagerly anticipating each new episode, often prompting me to re-watch them in anticipation. The performances from the entire cast are outstanding, and wow Nicole Kidman!",
      "date": "Mar 12, 2024",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Trying to hard to be what it's not. Watch SEAL team instead.",
      "date": "Mar 1, 2024",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Nailed it. Great show great cast and great writing. All around interesting and high stakes. If you like spy, military or crime shows you will like this one.",
      "date": "Jan 29, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Muy buena, súper entretenida.\nUna serie de espionaje de la que puedo decir que hace muchos años no veía una serie tan buena.",
      "date": "Jan 28, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Edge of your seat action throughout. If you love a \"will they, won't they\" you will enjoy this. Looking forward to a second season",
      "date": "Jan 15, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Loved this show! Amazing acting by ALL actors! Go watch it. You wont be disappointed!!",
      "date": "Jan 10, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Absurd levels of violence, the premise is pretty out there.",
      "date": "Jan 5, 2024",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "I'll not sure what these critics were watching, toys show excels (others that try it fall flat) in every way.... Great story telling with a perfect cast to tell it.....Tylor does it Again Again Again and Again!!!!",
      "date": "Dec 8, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Lame…so unrealistic and horrible acting…sheridan is outta milk…way too much",
      "date": "Dec 5, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Good series and characters, good climax at the end",
      "date": "Nov 30, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Its absolutely thrilling, makes you laugh and cry. I am really enjoying it.",
      "date": "Nov 27, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Don't know how they made a show about the military and got everything so wrong. There are consultants available I'm sure. The bar fight scene was ridiculous. A person plucked off the street was tortured as a test to see if they were good enough? \n\nIf you're going to cast people as special operators, have them physically look the part. Also, the finale was awful. They find the target througha series of coincidences that are impossible to believe and then a person has a boatload of armed backup almost within arm's reach, but doesn't use them? That's not how soldiers work.\n\nZoe Saldana was very good and Nicole Kidman was very bad...",
      "date": "Nov 17, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "One of the best shows this year.",
      "date": "Nov 14, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "One of those times when I genuinely don't understand the bad reviews. This was tightly directed, tautly-paced, and tensely entertaining from beginning to end. Maybe not great art, but there's nothing wrong with great entertainment and every single member of the cast committed to this 100% as if it were high drama. Maybe no dialogue to quote, but also none to fault. It also manages the feat of not being simplistic, unlike most of the action fare out there. At the end there's a thought-provoking sub-text about the complexities of going ahead with an op, the moral questions, and how often the virtues of an op can change on a dime. I loved it and can't wait for Season 2.",
      "date": "Nov 11, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "It was a solid show!",
      "date": "Nov 8, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "The writing was incredible. The action scenes were amazing. I was drawn in from the very first episode and didn't stop until I watched all 8. I teared up, I tensed up and felt everything. The actors were spectacular, especially Laysla De Oliveria. It was such a rollercoaster of a show and I loved every second of it.",
      "date": "Nov 8, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I am only episode 5 and I am blown away! I love ALL of Taylor Sheridan projects! I like how it's  very true and wonderfully acted! Must watch!!!",
      "date": "Nov 6, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Huge fan of Zoe S.\nCast is perfect..love the story line\nIm speechless..really..i am!\nNow i have to wait till Autumn  2024?\nI might not live to see season 2\nBut at least i got see My Zoe..Someone give her an Oscar!",
      "date": "Nov 1, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Unbearably full of cliches of some illegally operating soldiers, which makes them terrorists, trying to save the world while sacrificing their private lives.",
      "date": "Oct 29, 2023",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "So cliched it's laughable.  And Zoe just can't pull this off. This is like Terminator two Linda Hamilton in a porcelain doll.",
      "date": "Oct 28, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "This show was a great binge-worthy show to watch, and I recommend it.",
      "date": "Oct 23, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The repetitive scenes of violence, in circumstances that strain credulity to the breaking point, overshadow the ludicrous plot lines. For example, to \"test\" and \"train\" an operative who was basically picked up off the streets, the special operations teams grabs her while she is jogging and then beats her to a pulp, waterboard her, and borderline sexually assaults her. If you want gratuitous violence and sexual suggestiveness fit for a middle school boy, this is your show.",
      "date": "Oct 3, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Awesome show! great writing",
      "date": "Oct 3, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "For a show that began with a bang, the finale felt rushed to the extent that even a wealth of talent couldn't help but let us down.",
      "date": "Oct 3, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "It was more than I expected all of the actors are awesome my favorite Bobby hands down",
      "date": "Oct 1, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Morgan Freeman was wasted! He cusses like a sailor, it is so cringeworthy.  They have to talk about race in a show that it is not needed. The ending is lackluster...It could have been so much better!!!!!!!!",
      "date": "Oct 1, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Slowly growing with complexity and have a potential for something big.",
      "date": "Sep 30, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great show, I sped through this series, Zoe had the perfect balance between being tough and soft at the same time. Love how the family aspect is interwoven into the story.   Can't wait for season 2",
      "date": "Sep 28, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Sometimes you're in the mood for \"high society drama\" and sometimes you want an easy action show to watch (it IS what the whole Fast & Furious franchise is built on - good looking actors, good action scenes, easy to follow plot line, and some violence thrown in for good measure). While I can't watch things like SVU anymore (the violence against women gets to me too much), in this show I find the violence not overwhelming but actually even entertaining, in a schadenfreude sorta way. I like that it's a female cast of hot buff women who are out there kickin' ass. And the male actors are nice looking too ;) \nI hope it gets renewed and that the [male] haters don't take away a show that's kinda believable but not so believable it's overwhelming or traumatizing (like SVU or Criminal Minds). As you can see, lots of women like the show, and this show is the only reason I pay for Paramount Plus.",
      "date": "Sep 27, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great.  Critics dumb.",
      "date": "Sep 26, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "This felt like something from 20 years ago... I don't even understand how they got all these big name actors to be involved and speak all that cringe dialogue. I found the actual action and movement within the show well done and captivating, and the side characters felt organic, but as soon as anyone started to have \"serious conversations\" it was just bad.",
      "date": "Sep 25, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "Whenever I see a movie or show with a bad critic rating I automatically assume it will be good..... This one is no different, the entire thing had me on the edge of my seat. Must watch TV. Everything Taylor Sheridan writes is pure gold.",
      "date": "Sep 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Much better than the reviews would have had me think.  Acting is great, writing is solid, pacing is doesn't drop and keeps building.  Good binge.",
      "date": "Sep 24, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "It was AMAZING.  Good action, suspense, drama, adversity with real life issues.  Can't wait for season 2",
      "date": "Sep 22, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Absolutely amazing! I really hope there will be a season 2!!!",
      "date": "Sep 21, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Finally a well rounded perspective from a women's point of view in what has always been a traditional male genre. About time.",
      "date": "Sep 20, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Need a season two asap ! such a great show",
      "date": "Sep 19, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I found Zoe Saldana's acting to be a major win for this series. With many strong female leads that were written with great nuance, I really leaned into this one. The writing was good, although rushed at certain points. I liked the family drama that's mixed into this political action show. It had a lot of heart, and didn't feel like an accessory for Saldana's character to wear. The high stakes of the finale felt inconsequential in certain ways that failed to deliver on expectations, but thwarted some worries I had for certain beloved characters - so, I'll reduce that statement to a \"good not great\" conclusion. I would recommend this show. It is very entertaining, and quick and worthwhile binge.",
      "date": "Sep 19, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Captivating from start to finish. Not sure how some critics don't like this show. One says \"swing and miss\" but prob some anti Yellowstone people.",
      "date": "Sep 19, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Incredible first season. Don't be fooled by the low ratings here. I'll cancel my subscription to Paramount if they don't renew it.",
      "date": "Sep 17, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "One of my favorite new series. The action was great and the characters adapted with each episode.",
      "date": "Sep 17, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Wanted to give this show a chance, but Nicole Kidman's face is so gross and I can't even stand to watch another episode. Seriously. A CIA boss!?!?  Lolololol. She's not even American",
      "date": "Sep 17, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Just another example of the U.S. factwashing its politics and propagating a narrative that portrays the Arabs as the villains for things the U.S. is responsible for. Anyone who likes this series doesn't seem to understand how the world really works. This series is disgusting.",
      "date": "Sep 16, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "It would be a shame if they didn't renew this show. I wish there were more episodes but it was the appropriate point in the story to end it. Could not stop watching it. If you like fast-paced special ops shows watch this!",
      "date": "Sep 16, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great! However, Nicole Kidman looks horrible. Why did she do that to her face? Cmon!! We would have liked you to age gracefully. You and Jennifer Aniston. Cmon!!!",
      "date": "Sep 16, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It's nice to see a dominant female cast. Intense and interesting. Love it.",
      "date": "Sep 15, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Very engaging and entertaining drama. Great acting all around. Writing and directing are superb. Glorifies USA war-mongering around the world, but what's new..?",
      "date": "Sep 14, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The love scenes are really unnecessary for this type of series. This series could've been on par with Jack Ryan had it not been for that. Booo!!",
      "date": "Sep 13, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "I was very disappointed in this series. Sheridan does best with Westerns and I really enjoy his detailed writing there: Yellowstone and an upcoming series. I don't think the writers ever met a federal bureaucrat, excepted or civil service. Nicole Kidman with her throaty whispering and bad acting was not impressive as a CIA officer. Granted this is TV, so the woke parts they get right. I am also a big fan of Saldana and she is pretty good in this but again not a federal bureaucrat type. I did like Saladana's team as they were somewhat realistic.",
      "date": "Sep 12, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "This Series was totally Bad Ass...It was the correct mixture or Story Line, Shoot em Bang Bang, Reality and Hollywood.  The Actresses and Actors were perfect for their roles.  The Biggest \"Named\" stars were NOT the biggest stars.  It was a welcome relief to get involved in a Series with the final episode having some ridiculous totally unreal cliff hanger.  Great Series, Hope to see another season.",
      "date": "Sep 12, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Packed a punch! Don't miss this one. Great cast, script, and action! Well done. Bring on season 2!",
      "date": "Sep 12, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Excellent show.  Nicole Kidman hits hard in this series, I don't care what people think.  I love confident characters.  She and the CIA white boy rocked!!",
      "date": "Sep 11, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great show with honest dialogue. Could do without seeing Morgan Freeman and his tired old retread character as a White House president or some other top official.  Mad respect to his career, but he's needs to be put out to Hollywood pasture.  Gotta stop putting old ass actors in roles that are unbelievable for actors as old as Freeman. Wasn't Denzel or Idris available if its gotta be diverse? Oh, and hard to watch the new plastic face that Nicole KIdman is sporting, nothing moves when she talks except her lips....weird.",
      "date": "Sep 11, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Absolutely sensational writing, gripping SOF / SAD adventure. Overcomes the improbability of the protagonist's physical excellence while female by admitting its rarity. Totally immersive spy / action drama. Loved every second. Luminous and kick-ass acting from the entire cast",
      "date": "Sep 11, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Just gonna say, I liked the concept of this show, it grabbed my attention from the start. The music was awesome. The plot just sucked, everything felt like it was just thrown in there and nothing had time to develop. The story had too many elements, things were hinted at but never explored further. There was zero character arch, they'd try to throw conflict in there, but then somehow everything would work out with very little struggle. I thought the last episode was just quickly and sloppily tying up bunch of loose ends. Even the argument between Joe & her husband made no sense and was never resolved properly. This show could have been so much better if the plot made sense, and wasn't just a bunch of random story lines squeezed into too few episodes.",
      "date": "Sep 11, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "The cast and story line were good. The ending was terrible. No resolution for most characters and Saldana is crying? Really?",
      "date": "Sep 10, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "Don't be an idiot and follow this website. Form your own opinion. It's a great show with tons of action and really good acting. This website sucks and it's negative reviews are most likely from trolls that just give negative reviews without watching shows.",
      "date": "Sep 10, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "So much big-name talent wasted.  Mis-cast, poorly written and poorly acted.  I like the actors, but this was one of the worst collection of performances I have ever seen.  Stick to writing Westerns, Sheridan.  This is not your genre.\nZoe Saldana is not energetic or convincing at all.  Her helmet doesn't even fit, and the rifle is bigger than she is.  Dialog was all cliche and the action scenes were awful.  The filming locations were nice, though.  With all of the actors also being executive producers, this looks like a paid vacation for them.",
      "date": "Sep 10, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great writing, juicy story, balance between action and drama.",
      "date": "Sep 9, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The critics got this way wrong. This show is well paced, entertaining, the right balance of character drama and action. Taylor Sheridan's best tv work since 1883. Zoe Saldana and the cast knock this one out of the park",
      "date": "Sep 9, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "One of the best shows I've ever seen. It's not for you if you don't like heart stopping clever fast action dramas. The cast was incredible.",
      "date": "Sep 9, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "What started out promising drifted midway through and then ended very poorly. Zoe was superb. I thought her character was well written and acted. The other star power really pulled their weight too. But ultimately the show devolved into weak story telling, over acted characters, and unbelievable plot points. I knew halfway through it wouldn't end well. Way too much drama devoted to side characters and backstory that was needless. I actually fast forwarded through most of that to just watch the operational parts. It's truly sad because this show could have been so much better and really launched a new series.  But with how this one played out I wouldn't bother watching another.",
      "date": "Sep 9, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "This show has so much to like from good combat to great story and amazing cast.\n\noverall\n8.6/10",
      "date": "Sep 9, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Amazing thriller and action! Great story with unforeseen twists and turns! Also the ending was everything !! I hope to see a season 2!",
      "date": "Sep 8, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It was definitely a good one. It felt like a movie and the story made sense. I really hope there will be more seasons.",
      "date": "Sep 8, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "it's a great show,the best ive seen this year",
      "date": "Sep 8, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "i absolutely enjoyed this show!! (i've watched the season 3 times now lol) especially with laysla and stéphanie!! i'd love to see them both in the next season for sure 😩",
      "date": "Sep 7, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I believe this is the first Taylor Sheridan misfire (first I can think of). While Laysla and Zoe do a great job, the writing is poor and derivative, the premise is flawed and I feel like there was a little of bait and switch (at least until episode 3, I couldn't go any further).",
      "date": "Sep 7, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "To far fetch women are to angry they try to hard to be tough always using badwords to prove a point. Men don't talk that way to each other respect is more important and the way she talks to her husband so she can be in control he always backs down and makes him look week but she loves him for his weakness.",
      "date": "Sep 7, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Stefanie Nur and Laysla De Oliveira were just fantastic in another Taylor Sheridan hit TV show. A packed cast including Zoë Saldaña, Nicole Kidman, Morgan Freeman and more! I enjoyed the way this season played out, so for me - Absolutely Fresh!",
      "date": "Sep 6, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Overwrought, overacted action soap opera.  I wanted to like it because of the star power, but in the end Lioness was a mixed message mess.",
      "date": "Sep 6, 2023",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "Just finished the last episode and I was a bit disappointed in the ending. I appreciated the overall mixture of Special Ops tactics with telling the human stories of Joe's family life and Cruz falling in love with her mark but the last episode was full of plot holes. It was like they ran out of budget and just had to end production really quickly. So Aaliyah's father, one of the most protected terrorist funders in the world, just happens to be on the women's side in his underwear getting a snack when an undercover Marine is there getting some water? So Aaliyah's skeptical fiancee runs a basic Google Image search and discovers there's an assassin in the house and he doesn't immediately arm himself and round up one of the 100 armed bodyguards to hunt her? And wouldn't they have run that same search in the very beginning on a complete stranger that's getting close to the family of the most proceed terrorist funder in the world? And why wouldn't that elite security detail fly a drone over the yacht that just seems parked a little too close to where, say it with me, the most protected terrorist funder is staying?\n\nGreat start to the series. I loved Cruz's backstory. Stefanie Nur and Zoe Saldaña were fantastic but, I'm sorry, Nicole Kidman was wooden and unbelievable in every single scene. I didn't buy it for a second.\n\nThis series was good but not great...and it had the potential to be great.",
      "date": "Sep 6, 2023",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "Watched the first seven episodes.. so far so good. Got me hooked... characterization, dialog.. great drama with the occasional action. Still a fan of Taylor Sheridan & his storytelling & style.",
      "date": "Sep 6, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Great show.  Ready for Season 2.  Great action, lots of tension, and conflicting ... everything.  ha ha.  I wonder how they are going to play all this out next season because we were left with some serious anger.  wow",
      "date": "Sep 6, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Excellent series.  I hope they continue it for a second and third season.  \n\nOne or two episodes were a bit off track in my honest opinion and may not have been needed but overall was very entertaining.  The ending was good but seemed a bit rushed.",
      "date": "Sep 6, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is not what I expected. I'm tired of watching angry black women over act and being put in a position of superiority. The writing leads these actors into bad acting with the one liners and the boring relationship problems of a working couple. By the way Nicole Kidman looks like Donald Duck. She needs a facelift to fix her facelift.",
      "date": "Sep 6, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "An absolute must watch! Would highly recommend. Bring on season two!",
      "date": "Sep 5, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "An absolute must watch, superb story telling and phenomenal acting. A truly gripping season which I could not stop watching. The perfect story about love, duty and sacrifice. Bring on season 2?",
      "date": "Sep 5, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I really wanted to like this show, and maybe there were some moments I actually did. I suppose it just boils down to the fact that Special Ops: Lioness didn't at all live up to the hype of its commercials and reviews. It's like I kept waiting for the story to develop… all the way until the very last episode. It never really developed in my opinion. It was a different take on the typical military plot but it could have taken so many other twists and turns whether in relation to the levels of political oversight, or simply within the military hierarchy. For example: Was it truly necessary for an entire episode to be dedicated to the lionesses superior kidnapping and repeatedly assaulting her? There were some things I absolutely found refreshing. But all in all I say skip this and watch Jack Ryan.",
      "date": "Sep 5, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "A little slow at the beginning but really picks up steam quickly. A must see if you like shows about spies, CIA or the middle east. It's definitely got similar vibes to Jack Ryan. I'm so glad I ignored to 'professional' reviews- per usual. The viewers' ratings are usually much more accurate. I hope there is a season 2!",
      "date": "Sep 5, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Hard 3 stars, almost 2.5. It literally jumped from Lioness training/joining the Marines to her suddenly becoming an international spy with zero training on espionage, which would take half a decade at least. But they make it seem like she did it within months? And if she really was the best Lioness available while passing all the tests with flying colors, then how could she do the most cliché storyline in spy movies lol. Has its GI Jane moments, but it's difficult to care for any character other than Zoe Saldana and her husband. Nicole Kidman is just big name filler, her character could have been played by any actor... Just like how the rest of the team was cast.",
      "date": "Sep 5, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "Just finiahed the season and although it was some great acting I have ended up with tok many questions. \nIt portrays a decent summary of what the ideal is for the show but is so inaccurate. Most reviews have been focusing on the lack of accuracy with the military operations and characters, I don't disagree with this summation at all, but further to those inaccuracies i want to focus on the female muslim lead who drinks alcohol, has sex with women, hopes that \"god\" is good to her, wears barely there clothing and simply defies all her supposed religious beliefs, an influential muslim man would not marry her from my understanding of the culture, so it defies logic, especially when he is aware of the lesbian relationship she had.\nThen lets talk about the ending that isn't an ending at all, there is lack of closure on the main character's of the series and it is lacking in an actual ending, wrapped up in less than 30 minutes but had 7 episodes to lead into it. \nAll around I enjoyed the series as a drama, which it was, but the inconsistencies throughout and the lack of closure on characters had me wondering if they should have maybe done a couple of extra episodes to close the characters out.",
      "date": "Sep 5, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "Terrific series. Great cast. One of the best endings to a season in a long time. Hoping that there is a second season with the same cast, but maybe just a different main character. She was terrific, but the series can continue the \"Special ops Lioness\", and bring in a new Lioness every time. Just set it in a different locale with a different theme. It was awesome.",
      "date": "Sep 5, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Soooo good, I couldn't stop watching it! Totally had to binge watch over Labor Day weekend! Haven't seen an action packed drama like this since Homeland!",
      "date": "Sep 5, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Melhor série de ação  que já assistir o elenco feminino e muito  boa eu amor esse  estilo  de série  e  eu adorou  a zoe sandana ela  é uma atriz muito boa",
      "date": "Sep 5, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This was a good show. It was gritty, suspenseful, and gave you a sense of the stakes, but also made you wonder if the target is REALLY the person who should be taken out, is what the team's being told the truth? What agenda determines decisions made? What is the toll on the individuals executing the mission? What are the consequences?\n\nThey make you feel invested and create a real sense of tension around whether the team will make it out. It's worth a watch!",
      "date": "Sep 5, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show is simply amazing, from the A list Actors, to the cinematography to the realness!! I really enjoyed it. Did not see that coming.",
      "date": "Sep 5, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Well, I disagree with most audience reviews and agree I suppose with the critics.  I felt that this was a borderline chick flick.  The 4 main actors were all women, and except for a good first episode it evolved into two women shopping, two women bonding, two women going to the beach, two women partying, two women making love.  Then finally we got what we wanted in the last 5 minutes. 2 1/2 stars might be a stretch.",
      "date": "Sep 4, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "Good chemistry between Laysla and Stephenie with sensual undertones that kept me hooked.",
      "date": "Sep 4, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Really enjoyed this series it was action packed and kept you on the edge of your seat right until the end. Really hope there is another series as their is potential for lots more highly recommend.",
      "date": "Sep 4, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show is amazing. Has me hooked from start to finish.",
      "date": "Sep 4, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "E cam incoerent politic si tactic",
      "date": "Sep 4, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "The critics are right: This is military propaganda - just like The Terminal List, Last Ship, The Unit and so many other shows that paint a totally unrealistic \"good guys vs. bad guys\" picture drowning in patriotism. That being said, it is also hugely entertaining. There is lots of good acting, excitement as well as decent chartacter development. Definetely nothing for deep thinkers, but nice if you like shows like 24, Homeland, Fauda, Sleeper Cell or Strike Back. I'm looking forward to Season 2.",
      "date": "Sep 4, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "I'd say this series demonstrates how even talented writers like Taylor Sheridan are capable of poor writing. \n\nI get that Zoe Saldana is the star of the show, but the ending would've hit a bit better if we had seen how Cruz Manuelos was handling the transition back to America after what she did in Greece.",
      "date": "Sep 4, 2023",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "Another great show by Taylor Sheridan. 1883 is still my favourite, but loved Lioness. Leaves you really thinking about who the good guys are, who the bad guys are, the role of the military,  politics/politicians, and the people/families caught in the middle. Also great to see strong female characters kicking @ss.",
      "date": "Sep 4, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Action packed for sure. Excellent! Hope there will be more to come.",
      "date": "Sep 4, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It's an incredible TV show! The episodes move quickly but also have something unique to say every week. The cast's outstanding storytelling, talented cast, and memorable performance kept me on the edge during every episode. So far, this is the best show of 2023 for me, and I wouldn't be surprised if multiple stars, directors, cinematography, music, screenplay, etc., get nominated for major awards.\nI am looking forward to the second season!",
      "date": "Sep 4, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I very much enjoyed this series. Believe to actresses were amazing. And it had the badass secretive task force stuff to boot.\nThere needs to be a Season 2!",
      "date": "Sep 4, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "A must watch. The characters were strong. The story line was intense and the cause was righteous. The cast did a very good job. I want season two. \n\nTaylor, you did it again!",
      "date": "Sep 4, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "I Like so much, come on season two please!",
      "date": "Sep 4, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Reminded me of CoD Modern warfare baby and always power to the women damn great season!!!!",
      "date": "Sep 4, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This series is tension filled and well acted. The story moves along well and we care about the characters. Well done spy-thriller-CIA genre with some excellent performances by the actors.",
      "date": "Sep 4, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Great season, full of tension between Cruz, the hijabi target, politicians, the strike team……….Saldana is fantastic as honestly all involved, Another winner from Sheridan.",
      "date": "Sep 4, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Up until the final episode i probably would have given it 4 - 4.5 but the last episode was a big disappointment. The whole series ha led to the point of getting a target that had eluded them for 22 years. SPOILER ALERT - but come on, she by chance meets the target in the kitchen in the side of the house that is supposed to be women only. Then the fiancee that had discovered she was a marine came to confront her without any of his million and one armed guards AND happened to find her in the kitchen in the womens only sector. That was some pretty poor writing. Instead of all the unnecessary political stuff they should have focussed on the wedding entirely. The episode should have had twists and turns and more angst - it was set-up perfectly for it -- but it was like they ran out of time AND there was not even the inevitable scene of the daughter and crux looking into each others eyes when the deed was done. This was no homeland thats for sure. Disappointing as the cast was great, the premise was spot on its a shame it all came crashing down at the end.",
      "date": "Sep 3, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "I loved every episode. I want more!",
      "date": "Sep 3, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show is awesome! So intense, I was on the edge of my seat. And the final episode? F#*+=ing phenomenal! Zoe Saldaña killed it, and everyone else did a very stand up performance. Season 2 canNOT come soon enough.",
      "date": "Sep 3, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I loved it. OK there were times when critical disbelief was suspended but overall the eight episodes were really engaging. Great watch. Recommend",
      "date": "Sep 3, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "An emotionally intelligent show which explores the reality of counter terrorism and its impact on the women who navigate the murky depths of poltical machinations. I would guess the bad reviews are from guys who just 'don't get' the charged emotional wranglings of guilt where saving the world means you can't be there for your family. Or the guilt that becoming a butcher is only worth a few dollars on a barrel of oil. A different take on the effects of dark ops with a stellar cast. Superb.",
      "date": "Sep 3, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Such a good show and the season finale was amazing, I want season 2 asap.",
      "date": "Sep 3, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Love love love this show I really hope they make a season 2 asap cuz holy this was so intense need more of it!!!",
      "date": "Sep 3, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Would have been 4 Stars if not for the Finale let down.",
      "date": "Sep 3, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show is amazing! So good",
      "date": "Sep 3, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I love the show. I need season 2 in the works ASAP!",
      "date": "Sep 3, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Excellent show!!! I love love this show!!! Highly recommend!!!! Great story line and felt like you were there!! This show will NOT disappoint you!!! Definitely watch!!!!",
      "date": "Sep 3, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "One of my favorite shows on TV. Great acting, awesome story. Another Taylor Sheridan gem!!!",
      "date": "Sep 3, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Surprisingly nuanced. Its obviously not a perfect show but I would happily watch a second season. But then again I am a sucker for shows that refuse to name the good guys or the bad guys. Almost everyone in Special Ops: Lioness messes up and makes decisions they cannot come back from. While the portrayal itself cannot be called realistic (its american tv after all) everyone going after their own interests definitly feels all too real.",
      "date": "Sep 3, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "One of the best new shows out! From the first to last episode!!! Highly recommend the Lioness !",
      "date": "Sep 3, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show is so insanely good! 🤯 Everything gets crazy intense-- definitely one of the best shows I've seen (I don't get the 53% RT score --critics are stupid!) the last episode left me wanting for more, they do wrap it up, but still I wanna know more about what happens afterwards. They better green light season 2 😣🤞🤞",
      "date": "Sep 3, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Just finished watching the finale, though a bit of a disappointing ending(without any spoilers it could have showed a bit more of the aftermath) overall it was an amazing show. I'm not a big fan of the US government as a whole but they have big decisions to make on a worldwide scale when it comes to terrorism. A lot of people are complaining about the oil situation in the show but we have to remember a lot of Middle Eastern wars i.e. Iraq, Afghanistan where about controlling oil supplies even though the world Gov's say its about protecting us from terrorists. It's not a coincidence that these terrorists are funded by big oil in the middle East, its there main export and without it society would fall apart. The show isn't just about action, its about the consequences of that action and we're learning that ourselves with the Russian war on Ukraine. The world economy is struggling due to increased oil prices which trickles down to every aspect of modern life. Hopefully if/when theres a season 2 it will go into more detail on how the actions in the finale affect the rest of the world. Thanks Taylor for shedding light on this side of the war on terror.",
      "date": "Sep 3, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Good intense hope there is more.",
      "date": "Sep 3, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Love this show! Kept me on the edge of my seat. Great cast, really good performances. I also like the female leads. There's a different energy from action shows with male leads. The drama is intense, and it breaks your heart for the characters, but to be honest that's what makes the show so good. I hope to see a season 2.",
      "date": "Sep 3, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Taylor Sheridan's best work for me.  The cast of Lioness has great chemistry and the show is grippingly complex and believable.",
      "date": "Sep 3, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Another winner from Taylor Sheridan. Like his other shows, Lioness has characters that immediately draw you into the story.   Zoe Saldaña's performance is outstanding.",
      "date": "Sep 2, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "I wasn't sure what to expect, but imagined it would be a shoot it all and blow em up kind of series. Instead there is exceptionally strong character development and before you know it you find yourself investing in the characters. I especially enjoyed the fact that there are light hearted laugh out loud moments. Watched the whole first series in one sitting.",
      "date": "Sep 2, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "the show is good i thought the 1st ep was good and taylor never disappoints",
      "date": "Sep 2, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Excellent show! Gripped me from the beginning episode. Great ensemble cast and Taylor Sheridan has a winning formula for writing shows that keep you hooked with anticipation. I loved his other show Yellowstone and this new Lioness show leaves me hungry for more! The only issue I had was having to wait a whole week for a new episode LOL....but that's Taylor for you...he wants you coming back for more as each episode unfolds. Definite binge-worthy show. I hope there will be a season 2!",
      "date": "Sep 1, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Adorei o enredo, as relações dos personagens são intensas e profundas",
      "date": "Sep 1, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Taylor Sheridan never seems to disappoint.",
      "date": "Aug 31, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "The series artfully weaves many current controversial issues into the story line without taking sides. The acting is extraordinary especially lead, Zoe Saldana, aided by the writing of Taylor Sheridan. We unfortunately live in a time when self expression must take a political side and many critics never give the series a chance and worse completely misunderstand what they are watching. One critic opined that the tough love Jo gives her daughter after the accident was hard to watch. Neither of the bedside scenes were tough love they were multi-layered, loving and contrite. The genre simply put some critics in the position of looking for something to dislike and miss what was really being expressed. This is one of Sheridan's best and it will keep me and a lot of the audience thinking. Thinking is not a bad thing and neither is an open mind to expression.",
      "date": "Aug 31, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "This show has all the action, thrilling twists and storylines of human connections that you can handle. \n\nAbsolutely bingeworthy!",
      "date": "Aug 31, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great show. Lots of tension.",
      "date": "Aug 30, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "A few set pieces are unnecessary distractions that add little to the overall story. But it's still pretty good value I think.",
      "date": "Aug 30, 2023",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "Ugh. Boring. Sorry. DNF.\nI'm a real fan of Taylor Sheridan's movies and shows, so I really don't know what went wrong here. It starts off with a bang, full on action and excitement, promising more to come, but quickly gets bogged down into a slow dull spy thriller that seems like a second rate 'Tehran'. There is no suspense, and almost no action. In fact there is so little action that the writers started to include completely gratuitous action scenes with no relevance to the main plot. A drug rape rescue scene. A terrorist take down. Some random home invaders. Anything to try and have the action guys do some action stuff instead of just sitting around looking as bored as the audience. But with no kind of suspense or tension, even that doesn't help. Maybe this gets better in later episodes, but I won't get to see them because I can't wade through the dross that the show has turned into. And James Jordan as a special forces operator? Seriously? He's a great actor and obviously a friend of Sheridan's because he turns up in all the shows, but he is seriously miscast here. Needed the work I guess, and his buddy said 'ok'. \nI think I'll go watch Wind River again, or Sicario, or The Mayor of Kingstown, or early seasons of Yellowstone, just to remind myself how great Taylor Sheridan really is. He's like the little girl with the curl right in the middle of her forehead. When he is good, he is very good indeed, but when he is bad he is horrid.",
      "date": "Aug 30, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "The script isn't the worst I've seen, surely compared to all other shows currently running.\nIt seems that Nicole Kidman forgot to snap out of her role in \"Nine perfect strangers\" and the Michael Kelly figures to jump between sets of Jadk Ryan and this show but he seems to be the only one who keeps this show interesting",
      "date": "Aug 30, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "So interesting how the story & plot rely on the relationships & bonds the characters have",
      "date": "Aug 30, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great storytelling! Definitely has me glued to the TV every week!",
      "date": "Aug 29, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Suspenseful, convincing, realistic, erotic, exciting, globe-trotting, fast paced, action packed, thoughtful, intense and did I mention erotic!",
      "date": "Aug 29, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "The scariest 8 episodes ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "date": "Aug 29, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is brilliant. In full disclosure I was hesitant to watch it because I'm not into silly, unrealistic female action hero shows where the star continuously kicks the living crap out of 220 lb bad guy buffoons as she proves herself in every situation to be the toughest person on the planet. Plus people complained about the family drama storyline that gets thrown in most every series. Sounded like it would be some woke, girl power nonsense. It's not. Everything is handled well and in a believable, raw kind of way. Probably the best show I have seen where the gals in charge have merit and it's not at the expense of making all the men act like stooges. Fantastic writing. Taylor S does it again",
      "date": "Aug 29, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "So fun! Zoe Saldana is great in this.",
      "date": "Aug 28, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "It‘s way better than critics tell you. It‘s not an actionpacked Gung-Ho show, but very satisfying on an emotional level. Simply good writing. Only Nicole „uncanny valley\" Kidman freaks me out because of her botoxloaden visage.",
      "date": "Aug 28, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Loved this show! Such a compelling story and great cast.",
      "date": "Aug 28, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I really liked this show! I've never been in the military so idk if this is realistic or not but I can say this is an entertaining and engaging show with good acting. I like both the personal and The OPs side of the show.",
      "date": "Aug 28, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Just a great show. The acting is great and once you start watching it you get into it.",
      "date": "Aug 28, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "It started out good but the last 2 episodes are on sex and her family and I believe episode 8will be the end. Not even close to navy seals",
      "date": "Aug 27, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "OMG this is such a great show. Well written plot, strong and interesting characters, diverse, and will keep you glued to the screen. I binged watched all the newest episodes in just one sitting. Highly recommended. Definitely a must watch.",
      "date": "Aug 27, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Exciting, entertaining, don't trust the negative reviews...this is a Taylor Sheridan production and downright excellent TV",
      "date": "Aug 25, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Formulaic special ops series. It has all of the Taylor Sheridan tropes and repeated Taylor Sheridan themes. Ho hum.",
      "date": "Aug 24, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Refreshingly authentic dialogue. Keeps me engaged.",
      "date": "Aug 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Perfect scene, suspense, intrigue , action. \nI score it 100%",
      "date": "Aug 23, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "More gritty and realistic action style than most modern \"spy action\" movies and shows, along with an interesting plot and good acting. Added bonuses were the multiple positive messages for teens (distracted driving, casual sex, date rape) and adults (work/life balance, relationships). Very much enjoyed this, for multiple reasons.",
      "date": "Aug 22, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "More realistic than most shows of this type... but also a bit too oorah devil dawgs in its contrived notion of American exceptionalism. But this is how Sheridan sells low-thinkers on \"patriotism\" and they eat it up in droves. If you're not predisposed to selling your soul for Trumpism, check it out for the performances. They're solid.",
      "date": "Aug 22, 2023",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "One of the best series 2022-23. The technical scenes were very well prepared as well as the actors. It's not some stupid action movie with a star to sell. The poster is misleading. I highly recommend.\nSpoil:\n\nMy only reservation would be about poor Nicole Kidman hiding her botched surgery like Michael Jackson...",
      "date": "Aug 21, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Loved it, keeps building. Plenty of Action.",
      "date": "Aug 21, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is in my, I like category. Not in my, I love category. It is about Special ops team or  something, premise. There is love, bosses, lots of Shooting,fashion, children, and soilders. It is just kind all over the place with the story telling.  I am watching it and will continue, to see if gets better.  The acting is a little stiff for all of these seasoned and excellent actors.  So maybe it is the script, directing or writing or all of it.",
      "date": "Aug 20, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "Enjoyed the show. I am looking forward to season 2.",
      "date": "Aug 19, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Incredible writing incredible acting amazing cast. Jack Ryan has dropped right off and this has taken the top spot for espionage series right now.",
      "date": "Aug 19, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great show! Real threats have to be removed by real people!",
      "date": "Aug 18, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It's OK. First episode was interesting. I wasn't buying the buildup of the training of the  Cruz character in the next few episodes. But I've seen enough to want to see how this ends.",
      "date": "Aug 18, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "It's entertaining. There's action, drama, and good acting.",
      "date": "Aug 17, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Awful. Beyond how poorly it's written it's not even remotely accurate in depicting the backdrop for SpecOps. It's no wonder they still refer to themselves in the show as part of the Special Activities Division whose acronym was (when it was still called that) SAD. Those three letters are a good summation of this show.",
      "date": "Aug 16, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Like GI Jane, except all women are apparently super human.",
      "date": "Aug 16, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "This show has potential, but it makes my ears hurt with an F-bomb every sentence.",
      "date": "Aug 16, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "It started out great! The acting and cast were exceptional. The writing ,after the 1st episode, dive bombed.  The problem is instead of it being an action movie about a Special Operations Team and their Secret Missions, it became a family drama once her daughter came in the picture.Now it became about their relationship with her and the problems that comes with raising a teen . I could only watch the first episode. If you like Zoe Zaldana in action movies then you probably won't like this.",
      "date": "Aug 16, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "When you see the title \"spec ops\" and get \"soap ops\"",
      "date": "Aug 15, 2023",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "This is a great show and the writing is amazing, Zoe is top notch",
      "date": "Aug 15, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "From Zoe Saldana to Nicole Kidman to Dave Annable and the list goes on and on. FANTASTIC performances up and down the board. The story has tons of elements for the audiences to connect with rather its work life balance or standing up for yourself. Be ready to be on the edge of your seat because each and every episode elevates from its previous. While many times this genre lacks unpredictability, this one not only keeps you guessing but wanting more!",
      "date": "Aug 15, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Started binge watching this show. The series has a great beginning hooking you in from the first 2 minutes of watching. The storyline and plot are awesome.",
      "date": "Aug 15, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "A show that actually writes women well.",
      "date": "Aug 15, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Sucked me in from the get go..action, intrigue, suspense, drama..",
      "date": "Aug 14, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Zoe Saldana is phenomenal!! The show is great, but her performance delivers the goods.",
      "date": "Aug 14, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Wokism strong in this one; decent watch though.",
      "date": "Aug 14, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "Lioness is a complex layered story with stunning actors holding the many ropes tightly in the knot of the tale. There's not one single weak actor and they came together for a purpose greater than the project we think there are addressing. I'm here for the misogyny, the racism, and seeing how these systems of leaders account for the obvious betrayals of a persons identity. Great and immersive experience that keeps shocking us every episode! Love them!!!",
      "date": "Aug 14, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Taylor Sheridan needs to stay away from this genre. Horrible writing with weak storyline. Except for Saldana, acting is atrocious! Kidman trying to act like a hardass is just ridiculous! Wanted to like this show. But it's really bad!",
      "date": "Aug 14, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Better than average and enough twists and turns to keep you engaged",
      "date": "Aug 13, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Very entertaining, tho a bit far-fetched at times. I'm enjoying this series for the most part. The biggest issue I have is Nicole Kidman has had so much botox it is incredibly distracting any time she is on screen.",
      "date": "Aug 13, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show is excellent. IT Sucks you in from the very beginning.",
      "date": "Aug 13, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Intense drama that keeps you wanting to binge throughout each scene. A true Leona \"Linoness\" show I've been craving to be since 1997.",
      "date": "Aug 13, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Special Ops: Lioness focuses more on personal and political views than delivering the action-packed experience expected from a counterterrorism thriller. \nWhile the strong acting performances, particularly Zoe Saldana's, add value to the show, the lack of action and unfulfilled potential leave much to be desired. The series may appeal to those who enjoy character-driven dramas with political undertones, but it may disappoint viewers seeking a more action-packed experience.",
      "date": "Aug 13, 2023",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "Have watched first 4 episodes and have enjoyed the action, mystery and general gist of story. Great actors and is much better than 55% RT assigned it",
      "date": "Aug 13, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Literally the best show that has come out in years. Right up there with Zero Zero Zero, and Gangs of London Season 1. It's Fast Paced, well written, great acting, seems like it was shot all around the world, and Zoe Saldana is Amazing like always.",
      "date": "Aug 11, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "With really nothing to watch on TV right now this is watchable. The hardest part for me is when they show Nicole Kidman.  Her face looks terrible. I guess she had some plastic surgery but it's awful. Makes her look like the joker from batman.  He American accent is awful as well.  Not Taylor Sheridans best TV show but again watchable. Mayor of Kingstown, 1883, Tulsa King, 1924 are all alot better. You should watch those if you haven't seen them.  I know yellow stone is a big hit but it's massively overrated as far as I'm concerned. Watch the mentioned above Taylor Sheridan shows, you will Thank me.",
      "date": "Aug 10, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "The character development, storyline, and the stellar acting makes this a must see TV series.",
      "date": "Aug 10, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Really well done. Camera angles and shots are great. Can't wait to see the rest of the season. So far first four episodes are addicting.",
      "date": "Aug 10, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This series is fabulous. Great cast, lots of action, intense and riveting storylines and great character development.  Can't wait for each new episode!",
      "date": "Aug 9, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "If you liked Homeland, lime CIA and spy themed shows- this is pretty good.",
      "date": "Aug 9, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Diabolical show. Even watching it knowing it is absolute made up crap, based on nothing real life, this show is insulting on so many levels. Acting is atrocious and as far as bashing of the middle east and america is greater than thou....that's a whole other show. Watching paint dry is a better use of time.",
      "date": "Aug 8, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Enjoy all of Sheridan's shows this is another good example.",
      "date": "Aug 8, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I am very much enjoying the layered nuances of the characters in special ops: Lioness. It was my spouse's idea to watch the show. I was drawn in by the first episode. This show builds the tension very well. Some scenarios seem to suspend belief. \n\nOverall, I am very much enjoying the show as it unfolds. Sometimes I want to smack the teen daughter.",
      "date": "Aug 8, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "4 episodes in and so far it's a good balance of grit, action and drama.",
      "date": "Aug 7, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Love love love. Been waiting a while to get something a little \"homeland\" again - well acted, keeps you on the edge while a background narrative is touching and fills the gaps nicely - recommend!",
      "date": "Aug 7, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Incredibly uninteresting. I gave up after the first (painful) episode. I blame the writers who probably have zero combat experience.",
      "date": "Aug 7, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Clearly a Sheridan production, Lioness is a well written, produced and acted spy thriller.  Like all shows of this genre it contains some over the top story lines, but this escapism at its best, captivating and interesting.    Don't take it too seriously.  Enjoy!",
      "date": "Aug 7, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I have enjoyed the show mostly so far. My main dislike, and I truly hate to say this as Nicole is a fellow Aussie, is Nicole's wooden face. I actually find her hard to look at or take seriously in this role, which is such a shame because when she isn't so botoxed up she is wonderful.",
      "date": "Aug 7, 2023",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "The first 5 minutes are great, from there a tedious, descent into emotional mediocrity, unrelatable to most viewers preferring the action genre.",
      "date": "Aug 7, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Soooooo good. Has me crying, gripping my seat, and rooting for the good guys—great series, can't wait for more.",
      "date": "Aug 7, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Understated and riveting.",
      "date": "Aug 7, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Very uninteresting and unbelievable characters. I hope I haven't figured out the plot. Otherwise I will hate myself for watching another episode. Then they try and present the female lead as beautiful and sexy. Anybody want to bet there is a second season?",
      "date": "Aug 7, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Initially decent. Boring after the 3rd one. Flimsy story, sub par writing and excessive language cheapens the show, really needs to invest in a Military advisor / E-7 for these type of shows....OGA operating in Maryland...ludicrous.",
      "date": "Aug 6, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "An electrifying thriller that masterfully weaves espionage and suspense, leaving you captivated and perched on the edge of your seat.",
      "date": "Aug 6, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Sheridan falls short. It's not fiction it's mythical. Shame.",
      "date": "Aug 6, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "I watched the first episode. It's very violent. A lot of upsetting scenes too. During her training is crazy too. I don't like it and don't recommend it.",
      "date": "Aug 4, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Absolutely insane for users to give that low of a score but I can understand critics. This show has great actors and the story line has me hooked from start to finish! If your a taylor Sheridan fan you know you can't go wrong for giving this one a shot! A must see!",
      "date": "Aug 3, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Awesome show. Good mix of story & action. Zoe is amazing.",
      "date": "Aug 3, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I'm a BIG fan of Taylor Sheridan and with the exception of \"King of Tulsa\" and \"Mayor of Kingstown\" I have loved everything he's done. \"Special Ops\" is up there with his other great shows and films (like Sicario) and except for the unfortunate casting Zoe Saldana as the lead, this would be another Taylor Sheridan classic.\n\nThe problem with Saldana is that like a lot of other not-very-smart-actresses (Keri Russell I'm talking to you) she equates bitchiness with strength. Sheridan has a history of writing strong and interesting female characters (Beth on Yellowstone and all the women on 1923) Yes, Kelly Reilly's Beth on Yellowstone is a bitch, but the difference between her and Saldana is that she ENJOYS every minute of it. In other words, she plays to win and, she's multi-dimensional. On top being a ball buster, she's also genuinely funny and loving towards her family and ENJOYS life -- unlike Saldana whose two modes are annoyed harpie or put-upon mom. The look on Saldana's face in every scene is like she's smelling  a nasty fart - and that's BORING. I can see the logic of Sheridan casting her in this role. She's big name and brings eyeballs to the screen but her limited smarts and acting ability seriously undermine and sell short the terrific role Sheridan has written for her.",
      "date": "Aug 2, 2023",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "This show is impressive. If you like Mayor of Kingstown then this is for you. Great lines, great action, believable actors. Can't wait to see the rest.",
      "date": "Aug 2, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This was just terrible. Do they even know what people want to see!?",
      "date": "Aug 2, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I want to like this show so much. I just can't. An Unrealistic and boring show.",
      "date": "Aug 2, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Based on the first episode, this was one of the better shows I've seen on a while. Not a Paramount+ subscriber,  so I probably won't see how it plays out until it makes it way on to Paramount. Curious to see if Taylor Sheridan's ego will be able to resist some screen time for himself. This guy's his number one fan, but he does create some decent shows. They'd probably be even better if he concentrated on one or two rather than multiple projects at once.",
      "date": "Aug 1, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Anything the critics pan but audiences like I want to know more about.\nThis is good. I've watched thru the second episode, and it's decent, using the typical tropes so far.\nWorth watching, and the \"critics\" can go F themselves with their collective 56%.",
      "date": "Aug 1, 2023",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "I really liked the first two episodes, but I got quickly bored watching episode 3. Big disappointment. Have to see what else to watch.",
      "date": "Aug 1, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Doesn't gloss over or candy coat the spec ops world.",
      "date": "Jul 31, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Tried and tried to like it but then watched episode 3 and omg what a complete nosedive!! Horrible acting horrible action/tactics and Nicole Kidman is just hard to look at!! This is what greed and doing way to many different shows does, it gets watered down and lazy…and the F bombs while I guess necessary are way to used in this it just gets stupid…",
      "date": "Jul 31, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I'm a blue collar man who planned cruise missile strikes on Subs for my career. My Brothers are operators and I love Taylor's work-the way it's being done here is ART. I'm always a bit harsh on military or SF screenplays and I've got to say that Tay has nailed this one. Nice to see female leads get the power and strength that they have in this story. Bravo Zulu TS. Well f*cking done. Wish I was a part of something this powerful.",
      "date": "Jul 31, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "amazing action and story line, would recomend this if your bored at home kudos to Taylor Sheridan another great one like YellowStone!",
      "date": "Jul 31, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "No need for  . F**K .. to be mentioned every 3rd word ..\nIts poor writing the writers are lazy.... makes the show trashy...    THEY SO TOUGH THEY\nDRINK ... BUD LIGHT ....",
      "date": "Jul 31, 2023",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "Gender barrier breaking! Breath of fresh air to see the females playing more evened out roles. Hollywood needs to take notes and follow this writers lead....",
      "date": "Jul 30, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Special Ops: Lioness catches your attention from the very beginning! I love the action, combat and the reality of this TV series. It keeps you wanting more!",
      "date": "Jul 30, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I agree with others...the language,specifically the F bomb, detracts from the intellect and cheapens the show. Additionally the teen daughter is detracting from the story, not a necessary role for the show.\n\nAnd so much anger ...balance.\n\nPick the audience, craft intriguing story.. thats all thats needed.\n\nGood story and cast. I'm still interested in taking this journey.",
      "date": "Jul 30, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Good action sequences and storyline. The excessive use of the F-bomb detracts from this program.",
      "date": "Jul 30, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "Geez, ignore the idiot critics review bombing this. Finally, a well-produced series along the lines of Yellowstone and Mayor of Kingstown. Violence, drama and decent story telling. It's probably not very realistic, but I didn't care. Good escapism television.",
      "date": "Jul 30, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Just not interesting enough to follow these characters",
      "date": "Jul 30, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "This series was absolutely terrific; one of the best series of 2023. Zoe Saldana is excellent and she doesn't look like a marshmallow. The rest of the cast were great as well; let's get another season, please.",
      "date": "Jul 30, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Zoe Saldana is in this, and she's not green or blue. Five stars.",
      "date": "Jul 30, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Something sad happens when you 'meet your heroes' so to speak. You learn their pacing, their language. And Taylor Sheridan has a certain way of going about things in all his television. After seeing so much of his movies and television, I now know his style, type, and setup. Lioness is all of his tricks done poorly. This show is clearly not his best by any stretch, only a jot better than Tulsa King, and not able to hold a candle to Yellowstone. \n\nEasy examples would be Zoe Saldana's balance of worklife and homelife to the Barracks / Bunkhouse / Security Guard quarters banter that he injects into his movies and television writing get hackneyed and old. It is hard not to compare his characters to one another; from Wind River to Yellowstone to Mayor Of Kingstown, there are convenient placements of back and forth that you can hear certain dialogue over and over. \n\nPerhaps that's not fair to Lioness, whose one job is to keep us enthralled and compelled to continue watching but I can't see past the cut and paste writing gears any longer. Not to mention that his Production Company uses the same actors repeatedly as background, makes me wish I was a pal of Sheridan as I know I'd have Acting jobs for life.\n\nBut the essential disquality of the show itself is storyline. What is it about Old Man that was so compelling to make me watch a near elderly Jeff Bridges' sex scenes while Laysla De Oliveira just makes me want to watch something else? While she is acting her heart out it is not transferring to my 'must watch' button. And as for the rest of the cast, they are forgettable. I found myself skipping through certain scenes simply because I want action and tension. I know that if Zoe is with her husband I will be bored to tears, it can be literally cut out and I can move to the next scene and nothing will be harmed in my viewing experience. It is fluff. Same with Nicole Kidman, her CIA handler. If I eye roll at the trite Langley old guard stuff haphazardly discussed over a luncheon at an open restaurant and not in a hardened soundproof skiff, I know the writing staff missed their mark by a country mile and placed the same conversation in a setting that was less stiff, even if unbelievable. Kidman is a complete waste in this show. It is not fair of me (let alone lookist territory) to state but...she's hard to look at. I can't get a read on her emotional state with all that cat lady 'work' she's done and her character has little to add or say of importance. Perhaps in upcoming episodes but I doubt it.  \n\nI had the same experience watching Citadel. While Citadel has a bigger budget (I think) and the shooting style is frenetic, in that show you bounce from flashbacks to love scenes to torture scenes back and forth in pretty much the same way Sheridan does. Citadel has a believable problem as well but theirs is hokey, while Lioness is just plain bad writing. \n\nIf you want to go down the this or that road, tou can easily compare Lincoln Lawyer to Tulsa King or even Jack Ryan. By comparison for something good have a look at Netflix' The Recruit or The Diplomat. Both are solid, fun, easy to watch, and entertaining. And perhaps most importantly, believable. I suffered through Tulsa King, didn't believe a moment of it, and Jack Ryan is good to go to sleep to if you're into having your tv on at 12am. I could barely get through season one on that horrible mishmash of boring.\n\nUltimately, Lioness has to have some lighter moments and more importantly something compelling about the characters. I get how bad ass they are. I get how their lives are filled with turmoil, regret, and post trauma woe. But in order for me to love a character the way I loved Renner in Wind River, Pine in Hell Or High Water, or Del Toro and Blunt in Sicario, I need to love someone in Lioness. And so far, I pretty much detest both sides equally with shades of disdain and boredom. That's saying a lot for characters when you can't 'feel' for anyone in a show. Not one person is realized in Lioness. Not enough to keep me watching after two episodes.\n\nD Sondor Granar.",
      "date": "Jul 30, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Bad drama and lame writing",
      "date": "Jul 30, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Intriguing !\nLove Taylor Sheridan writing skills & actors are all great!",
      "date": "Jul 30, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Well cast, keeps you interested, great story line",
      "date": "Jul 30, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The show is set up well. The acting is great so far. I know some people might think the family portrayal might be cliche but thats just how some family situations are, if you wanted something strange then it wouldn't be a believable aspect of the show's story.  Hopefully the show gives some depth for the other characters in the later episodes, otherwise it doesn't augment the show regardless of how well they act. I would continue watching this for now with what is presented so far.",
      "date": "Jul 29, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "It was mid at best. Though it had some highs, it also had many lows. The story is weak and many factual errors were also made. The story seemed like it was heading somewhere with the beginning, but then it dug and dug and kept on digging a hole that they couldn't get out of. The show is a 5/10.",
      "date": "Jul 29, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "Story telling is different and story so far is pretty interesting. Plot has a lot of real world themes that actually happens especially the girl in the beginning who is trapped with guy and looking for way out",
      "date": "Jul 29, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Zoe Saldana is fucking beautiful and a consummate actor. This show is as good as any of it's ilk full of tension, action and some drama. Watch it.",
      "date": "Jul 28, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "I really enjoyed the 1st 2 episodes.  I was entertained and intrigued by the story lines.",
      "date": "Jul 28, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Not believable, too violent, I hope all our special ops troops are not like this. Zoe Soldana was the initial draw to watch.",
      "date": "Jul 28, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Find it funny how just a few weeks ago I was googling operations an programs In the government just like this out of curiosity after watching mile 22 and never once found anything about lionesses or even similar to this which makes me wonder if there's actually any truth to any it as it's claiming to be an if there is then the us government has got a major problem on it's hands if people can get hold of information about top secret programs Willy nilly an just make a show about it bit far fetched",
      "date": "Jul 28, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "I expect better from Taylor Sheridan. When you set the bar high, you need to keep that standard of work. This show has all the pieces to be compelling. However, it is only a watchable series. It has nothing to grab your attention or set it apart from other spec ops shows.",
      "date": "Jul 28, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Badly written & poorly plotted, by what seems to be the people who write copy for recruitment posters. I lasted maybe 20 minutes of the first episode. I thought it might make a worthy 'so bad it's good in funny way' thing to watch but sadly, that was not to be.",
      "date": "Jul 27, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Good action and tension, everything Sheridan does well and critics find offensive.",
      "date": "Jul 27, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "If you into CIA action drama's, I would rate It somewhere between Jack Ryan and Homeland so far.  Hopefully now that they've got the family back story established, the mission part of the story will progress.  I really hope it doesn't end up taking the Seal Team Six route and 90% of the show is about family issues...",
      "date": "Jul 27, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Too much violent abuse.   Not what I consider entertainment.",
      "date": "Jul 27, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "Like what Ive seen so far…",
      "date": "Jul 26, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It has me hooked, lots of action. I watch for entertainment only, not if it is true, accurate etc. this one entertains.",
      "date": "Jul 26, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "I think audience has it right at about 75% score. It's got really good pacing, both episodes ended with me having no idea we were close to the end. Acting is good, and the female lead opposite of Saldana is someone you don't wanna mess with! Great watch. I think this is a step up for Sheridan from Tulsa king",
      "date": "Jul 26, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Hooked. Thanks for making a kinda chic show cool, gritty and engaging. Thru 2 episodes any how doesn't feel like eating a poop pie. Taylor please write and direct a Star Wars or Marvel movie.",
      "date": "Jul 26, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Grabs you right from the start!!. Great cast , Entertaining and looking forward to more!!..Ignore the critics  and just enjoy it.",
      "date": "Jul 26, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great show, must watch!!!",
      "date": "Jul 25, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "So much potential, but then it goes woke…why!!! What a waste…",
      "date": "Jul 25, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I don't understand the bad reviews whatsoever. This series is fantastic. The lead actress is such a bad arse! Compelling story. Superb cast. Saldana is on fire, as per usual. Thoroughly enjoyable series!",
      "date": "Jul 25, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Saw Kidman, freeman. thought looked good. First episode. Pretty bad I'll give it 2 more than bye bye",
      "date": "Jul 25, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Absolute fire again from Taylor Sheridan… keep it up!!",
      "date": "Jul 25, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This was fantastic - how can it get so many poor reviews? We need more shows like this....",
      "date": "Jul 25, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "If you look at the show as a comedy, it's a masterpiece! But I don't think that's what they were shooting for.",
      "date": "Jul 25, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "The first 2 episodes had me hooked, getting to see the effects on family life and the ultimate cost of serving was definitely a true reflection",
      "date": "Jul 25, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "This show would have been better suited on network/broadcast networking. It's something I would tune into weekly to watch. Unfortunately it's stuck behind a pay wall on Paramount. \nIt's full of great actors, storyline  action and a budget. I'll be tuning in all season",
      "date": "Jul 25, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Possibly the dumbest thing I've ever seen. For a guy who prides himself on being very much in his wheelhouse when it comes to cowboying, this dude doesn't understand a thing about anything about the military",
      "date": "Jul 25, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Absolutely brilliant entertainment. Tylor Sheridan does it again.",
      "date": "Jul 25, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The show had a real feel to it. The main character's story is compelling. I found myself rooting for her and being scared for her at the same time. Well acted, I can't wait to see what happens, although I fear that it's going to get even darker... good show.",
      "date": "Jul 25, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Fast moving with multiple story lines using many friendly faces from his other highly rated shows - Taylor Sheridan seems to have another \"must watch\" show for us to enjoy.  Ignore the mainstream critics - they only give rave reviews to entertainment that fits in their own personal agendas.  This show seems to be a winner.",
      "date": "Jul 25, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Just awful.  Delusional.",
      "date": "Jul 24, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Boring and completely pointless",
      "date": "Jul 24, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "it seems ok, although somewhat unbelievable.  what's good is the dedication of the actors and crew to create a convincing drama.  Considering the subject, that's an accomplishment.  Focusing on the women avoids yet another macho spray of testosterone with feeble themes.  what's not so good is the feeling that this show may bog down in emotional character-building and ultimately lead the story nowhere.  It's too early to say.  I'd have more confidence if the show was a limited series.",
      "date": "Jul 24, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "Such a good show, the haters are the same people that want to complain about everything, be a survivor not a victim.",
      "date": "Jul 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Please do not give Taylor Sheridan any more money for him to pipe another formulaic series ! We have had enough ! What's next on Lioness.. Bunker house sex, POTUS takes a fatherly liking to the young operator, an armed attack on Langley, crooked politicians??? 🤮 Sorry for the great cast and the author of a good book, we love powerful women stories but we have had it with the Sheridan okeyness ! Shame on Paramount, we know you can do better !! The platform war must be brutal on the bottom line.. Here's a novel approach…drop all the last episodes in one bundle and let's see how the rating fare.",
      "date": "Jul 24, 2023",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "Anything with original content showing women as STRONG ORIGINAL characters is, more often then not, fantastic!  No need to remove STRONG MEN and replace with STRONG WOMEN.  JUST KEEP MAKING CONTENT ORIGINAL FOR STRONG WOMEN!",
      "date": "Jul 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Who signed off on this cringefest?",
      "date": "Jul 24, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "The Yellowstone bunkhouse relocated to Fort Bragg. Just waiting for Beth to show up and have a drunken fight with one of the other \"Special Ops\" who apparently drink all day in between missions.",
      "date": "Jul 24, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "This show is a must watch and I wish I could binge! The performance of Cruz keeps me on the edge of my seat. 5 stars!",
      "date": "Jul 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "If you like the terminal list or Faudo this show is for you",
      "date": "Jul 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I think this is an excellent addition to the Taylor Sheridan universe. I am surprised to see negative reviews on this one!",
      "date": "Jul 23, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "A great Cast and a great show!",
      "date": "Jul 23, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This has become one of favorites so far. Can't wait for episode three.",
      "date": "Jul 23, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Taylor Sheridan finally makes a bad show. This show is so bad it's comical. And I love all his other shows. The first 30 is so cringe I felt bad for actress who is so great at everything that even the marine officers bow down in her  presence.  She's a genius, a better athlete than anyone in the nba and she's tougher than all of seal team six. All that even though she runs like a toddler",
      "date": "Jul 23, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Great cast, but just couldn't get into it.",
      "date": "Jul 23, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is one long insult to real special ops teams.",
      "date": "Jul 23, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Feels like a very generic anti terrorist show. Not very unique like Sheridan's other work.",
      "date": "Jul 23, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "Very mediocre show with a title from  a straight to streaming Megan Fox movie",
      "date": "Jul 23, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Was hoping for so much more…the team tries waaay to hard to be \"bad ass operators\" and forget how to act…another dud unfortunately",
      "date": "Jul 23, 2023",
      "rating": 1.5,
      "episode info": "Season 1"
    }
  ]
}