{
  "frasier_2023": [
    {
      "review": "I was a massive fan of the old Frasier, rewatched it many times over the years and still laughed every time, this reboot is appalling, I was looking forward to watching it but boy that didnt last long, after the second painful episode I fast forwarded through the rest of the episodes, absolute shocking television in how bad these people act how bad the charactors are and how unfunny they all are, I thought the Last episode with Roz as a guest appearance would save the day but sadly no, it was awful from start to finish. If you've never watched the original ditch this farce and go watch the original, you won't be disappointed. If they make a season 2 of this tripe I won't watch a second of it.",
      "date": "May 4, 2024",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "A great homage to Frasier of days gone by.  I’m not sure you’d get it if you hadn’t watched the original series, but for those of us that did we get it. And It has been brought up to date, and I don’t  mean the kids will necessarily like it, but his relationship with his kids and work colleagues is def for our generation. Love it! Nicholas Lyndhurst is fantastic.  The script is clever and well written and the comedic timing is perfect.",
      "date": "Apr 17, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Grows on you. Warm. Inviting. Comforting. Not as good as the 90's one, but still the best new thing on Paramount (sadly). Jessica's addition is good and eye-catching. She rocks.",
      "date": "Feb 21, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The series would be better if it didn't have all that excessive canned laughter! It is exasperating to hear the same guffaws all the time. I used to laugh a lot when waching the original Frasier. I'm on episode 5 of the reboot and haven't laughed once! It's good that Frasier has almost the same personality although they have destroyed his decorating touch since his apartment looks terrible. That is not his taste. Niles son might, might have some of his father's touch. Freddie needs something. I don't know what. It feels like a slapstick show, so depressing.  I was a fan of Frasier when it aired originally in 1993 and just binged on the whole 11 years, maybe in less than three weeks, enjoying it to the hilt. In this reboot, if it werent for Kelsey Grammer, I wouldn't watch it at all.",
      "date": "Feb 6, 2024",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "Feels a lot like the old Frasier only bad thing is the first season was just too short!",
      "date": "Feb 5, 2024",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "I was a big fan of the original series so thought I'd give the new series a go. The first episode was ok, but I kept watching. By the end of the series I'd grown to love it, and the writing was as witty as the original..lots of laughs. Great characters as well. Hoping we get a season 2.",
      "date": "Jan 23, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I absolutely loved the original. Frasier and I am in love with this reincarnation or reboot. It has everything that I want. I still laugh out loud. The actors are fantastic. I think the casting was amazing the fact that his brilliant son kind of takes softer his father, John Mahoney And Nelson is exactly who I would expect Nelson to be the show has heart and it takes me to a wonderful place when I watch it Kelsey Grammer's amazing he can't help himself but again the supporting cast is fantastic. That's how I feel. I don't need it to be the original Frazier time moves on But the sentiment of the original is still there, so I think of it as a continuation more so than a reboot, because the story continues answering those questions. Who would Frazier son who would Niles son be? And I love the examination of growing up crane. What does that do to you? I guess we can tell I'm gushing I love it.",
      "date": "Jan 20, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Not a single laugh in 3 episodes and we really wanted to like it.",
      "date": "Jan 10, 2024",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "As someone who - like many here - loved the original series and has watched the box set 4 or 5 times over, I had concerns about the reboot.\nThe first episode's freshness was reassuring though, with Kelsey once more shining through with an effortless performance.  The supporting cast took a little getting used to but, after the first three episodes, we were hooked.\nNow season one has concluded, and what a conclusion with the surprise and delight at seeing Roz again!  Nicholas Lyndhurst is no stranger to us in the UK for his comic roles, and he's a great addition to the cast.  The only one I find it difficult to warm towards is the character of David.  I feel sorry for the actor, as the part written for him is ridiculous and silly.  I'm hoping they can manage to give him a deeper 'character' in the future - so far he is just a barely credible buffoon seemingly tasked with trying to imitate some of the physical comedy that Niles carried off so perfectly in the original series.  That's my only groan with this new series: David's character doesn't work for me.\nWe took out a subscription to Paramount + just to see this reboot, and I desperately hope that there will be a second series.  It's rare these days for us to look forward so much to a TV show that is amusing, clever and free of gutter humour.  A class act indeed!",
      "date": "Jan 6, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Certainly good comfort watching! Familiar, classic and new. The characters develop over the season and become more relatable as the season progresses. The writing evolves to be more humorous and the people more endearing over time. After watching episode ten, I am hoping for a season two!",
      "date": "Jan 6, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I absolutely love this show! The only reason I subscribed to Paramount Plus! The cast is AMAZING the continuity is heartwarming- it's just a fun show to watch! Having been a fan of Cheers from long ago(was even married to Norm who was an accountant) to following Frasier to Seattle with his dad now back home again with his son I've watched Frasier grow in so many life circumstances. Having lost my dad this year too I truly enjoyed the final episode. I'm so excited to see more seasons of this show!",
      "date": "Jan 3, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I loved it. My favorite of this season. I signed up for an account at Rotten Tomatoes just so I could give it Five Stars. (That is not a joke.) There had better be a second season.",
      "date": "Jan 3, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Then the series ended the 1st time it should have stayed that way. The story line is clunky and forced laughter. The characters are under developed and lacks depth.",
      "date": "Dec 31, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Sometimes you just need to let sleeping dogs lie. Lawd, what a bore!",
      "date": "Dec 29, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "It is a good show funny, loved to see Lilith still getting on Fraiser.  Please make a season 2",
      "date": "Dec 27, 2023",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "I love Kelsey and trust his vision. He is so good at this. Every day I check for news that we get a 2nd season. I adore David and Eve. Freddy has endeared himself to me since he's being kind and loving towards his Dad. There is so much cancel culture out there that the first episode, I felt, needed a trigger warning. Towards the last episodes Freddy has softened towards Frasier and I adore him as his son. I would watch Kelsey in any role but love that he loves Frasier as much as his fans. What a blast to have them in our living room again! Many thanks Kelsey and much love!",
      "date": "Dec 27, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The show found a way to capture the dynamics of the characters from the original that made it so good, but in a different way with different characters: very clever!  I was streaming each episode the day it came out.  I keep reading hot takes on the internet about how awful the reboot is but I love it!  I'm writing my first ever review on this site to defend my beloved show.   Please keep making more and don't listen to the haters!",
      "date": "Dec 22, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "just superb without the old stars but just as entertaining hope theres a series 2",
      "date": "Dec 17, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Absolutely horrible. I'm a huge fan of original Frasier, have watched and rewatched it very regularly since it came out around in my early teens. The humour, warmth and intelligence set it apart from cheap, pandering sitcoms for my entire adult life. It set a bar that so many comedies just couldn't reach. It still makes me roar laughing now, a thousand watches later, and has such a comforting effect to this day. The reboot … oh my goodness it's so so far from the original. Unrecognisable. Inately flawed. Unfunny, slow, cheap. No quick wit, no intelligence, no natural flow. Painfully obvious punchlines, stilted acting, unlikable cast, unrelatable stories, no layering or cleverness. Honestly, in my opinion, it is so bad that I feel deeply sad and betrayed as a Frasier fan.",
      "date": "Dec 15, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "I like it!   There is a familiar sense to it.  Kelsey Grammer is still whitty and adapts well to this role.  I am 50 now and find him attractive and interesting.  The cast is more diverse which I appreciate a lot.  So glad it's not just the same characters later in life.  That would be a lot harder to sell me on.  The cameos have been nice. I struggle to find just good simple humor on tv shows these days.  I sometimes need a break from dramas and don't like reality tv at all. Looking forward to seeing how these characters grow in season 2.",
      "date": "Dec 15, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "I'm having a total blast watching this with my dad! My mom passed away recently, and Frasier was her favorite show. So my dad and I almost feel like watching this brings back some of those memories of watching Frasier with her; she would've enjoyed this season quite a lot.",
      "date": "Dec 14, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It's a refreshing and cosy show that gets funnier with each episode, as it finds its footing. Looking forward to Season 2 being greenlit. Paramount+, don't let this die.",
      "date": "Dec 14, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This might not be the original and I went in not expecting it to be. You definitely miss Niles and the banter they had together. (As well as the rest of the original cast) That being said, the show still has great new characters played by a solid cast, and I laughed every episode.  It's not what we had, but if you go into it as something new, you can enjoy it.",
      "date": "Dec 13, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Far better than I expected. They did a good job tying it to the original while also making it fresh.",
      "date": "Dec 12, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Love this show!  Every week I love it more!  Frasier is one of the best TV characters ever.  The cast is great and Frasier's nephew is hilarious!  I really get a Niles vibe with a youthful twist!",
      "date": "Dec 12, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Absolutely love this new stage of Frasier. It deserves to continue for many seasons to come. Love how they pull just enough of the old series in at just the right time.",
      "date": "Dec 12, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Really enjoyable, and a return to form! It took some getting used to the lack of the original cast, but they are mentioned enough to not feel no longer relevant. A surprise cameo was a treat, and I hope future seasons continue to bring more regular cameos! New cast are engaging & enjoyable!",
      "date": "Dec 11, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Wonderful ! Great characters and extremely funny",
      "date": "Dec 10, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Frasier is back!  Kelsey Grammer picked up right where he left off.  Excellent show. The new characters are refreshing and it was great to see guest appearances by Lilith and Roz.  Hope Roz becomes a regular again  Highly recommended.",
      "date": "Dec 10, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Enjoyed the series and as it developed the story lines became stronger",
      "date": "Dec 10, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I just finished downloading all 10 episodes illegally off the internet and watching them, and I think the show is great!  It's different, but a great show in it's own right.  And Kelly Lawler (writing for USA Today) can kiss my ass!",
      "date": "Dec 10, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I liked the show.   Looking forward to another season",
      "date": "Dec 10, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Kelsey G. is a fascist Magat.   His publicists have to drag him out of interviews because he can't stop professing his love for trump.",
      "date": "Dec 9, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "UNWATCHABLE. Another lame attempt 🤮",
      "date": "Dec 9, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Clearly comedy writers are not what they were. But perhaps worse than that, the show is just plain boring. If you want comedy and fun storylines, go rewatch the original series.",
      "date": "Dec 9, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Do yourself a favor and watch the entire season before judging. It just gets better and better! Love that Roz and Lilith made an appearance. Fraser hasn't lost his touch! The new cast is great. Give them a chance!",
      "date": "Dec 9, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The show is fantastic. If feeling the need to compare with the original series, consider that a main character is dead and another refuses to cameo.  The new characters are well presented and the writing is hilarious. I'm hoping for a second season.",
      "date": "Dec 8, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The original was more entertaining and kept me interested. This one is a little dull and honestly, I feel asleep watching it... which I never do. Unfortunately, I'm not a fan.",
      "date": "Dec 8, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Honestly, it's so refreshing to see a situational comedy these days that doesn't pander to the audience. Mixed reviews I believe are partially due to certain misconceptions brought on by the \"norm\" of other sitcoms in recent years. Such as \"canned laughter.\" It should be known that the laughter is genuine, and this was filmed in front of a live studio audience with high praise. Others find it a privilege to see what our beloved characters are up to nowadays. I feel the writing is above average and considering the series is just getting its footing, I'd love to see where this goes. It has plenty to offer, and it's obvious the cast enjoys working with one another. I would love to unpack another 3-4 Seasons at least given the minimal 10 Episode packaging. Kelsey Grammer has been phenomenal thus far. This role fits him like a glove. It is possible that with time, and if left organically to fate that David Hyde Pierce may reconsider playing an on again, off again role. It's understandable to want to see that role reprised. However, that is yet to be seen and I have faith this will age like a fine wine. Trust the process and you will be grateful you did. A special thanks to Kelsey, and the rest of the cast and crew. It truly surpasses the \"Reboot stereotype\" by leaps and bounds.",
      "date": "Dec 8, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Took a while for the cast to get back into the Frasier rhythm, but its certainly there by the end of the first series.  Will get sharper in season 2 I'm sure",
      "date": "Dec 8, 2023",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "I tried to like it, I really did, because I loved the original.  But it's horrible with a  H thru E.  Did not laugh once in two episodes, but cringed with embarrassment continually.  I hope they're paying Grammer a boatload.  One season and then a merciful death.",
      "date": "Dec 7, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "I absolutely adore this reboot! You can tell they took the time to make it right, and acknowledge every little detail.  I am a 20 something adult who fell in love with the original and Cheers about 8 years ago, and it is like it just picked up again after all of this time. I cannot stress how nuanced the reboot is, it really warms my heart.  Like the original, there are different reactions to the episodes, but there are far more phenomenal episodes than \"just fine\" but make no mistake, there are no bad episodes. I would love to see this show continue for another 5-10 seasons just like the original.  Well done CBS. Well done Kelsey Grammer, and well done to the writers.  Martin Crane would be happy.",
      "date": "Dec 7, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Fantastic to see Frasier surrounded by new characters and in a new location. As good as it ever was. My \"fravorite\" show!!!!",
      "date": "Dec 7, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I love it! It's been so long without Frasier, it's great to follow up on his life, which is a wonderful story.  I am really enjoying the new characters, I think they're great and bring new chemistry to the show.  I am looking forward to many more seasons!",
      "date": "Dec 7, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "No Niles, no Daphne. The actor who played Frasiers dad is dead. This show shouldn't have even been made. But they did, and I feel most people would be better off watching old reruns.",
      "date": "Dec 7, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I waited to review this until I’d nearly finished it and I’m glad I did as it’s got much better as it went on. Unfortunately I made the mistake of watching this and revisiting the original at the same time and it’s nothing even close to t the original, but was it ever going to be ? It’s fun and it has a good story to tell,  that’s why i think it has a lot of potential as it shows glimmers of what it could be. the supporting cast aren’t gripping me and im constantly missing the jokes between old cast members . Alan in small doses is very fun to watch and I like the scenes with Freddy and Frasier. I think there’s plenty more tossed salads and scrambled eggs to be had here and I hope it works out the kinks because Kelsey is as good as ever.",
      "date": "Dec 5, 2023",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "Love that Kelsey brought this show back!! It's a great, nostalgic trip!!",
      "date": "Dec 5, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "My family are great fans of the original series and often quote lines to each other which fit certain situations in life. We therefore wanted so much to like the new series,  but after three episodes we gave up on it as we all agreed we just didn't find it funny at all. Despite the love that had clearly been poured into creating this new series it just din't work for us, and we've returned to rewatching Martin, Niles, Daphne, Lilith, & Frasier in Seattle. Such a pity, oh one last thing - the canned laughter which followed unfunny lines was just downright irritating.",
      "date": "Dec 4, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "The old frasier was a 10/10. 2023 frasier is a 7/10. The new frasier has its moments but lacks the funny moments of the old frasier due too not having frasiers brother and dad. All in all its worth watching!",
      "date": "Dec 4, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Absolutely loving the new series. As always witty and delightful. Not too many series get rebooted and as fun as the original.",
      "date": "Dec 4, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Beginning a new chapter of Frasier, without original cast members whose brilliance continues to shine through tv replays and dvd sets, is a tough order. However, all's well that ends well, and this show improves with time. There's just enough of the feel-good eccentricity, cut-and-thrust banter and hare-brained scheming that made the original Frasier a delight.",
      "date": "Dec 3, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Same energy, same flavour, same Fraiser! Spin-offs aren't usually the best and are usually disappointing. But the dramatics, the dialogue, the cast we all fell in love with from the beginning of the series, are all being beautiful displayed in this new series. The ones who have watched the first series will have a great appreciation for this new season. With the easter eggs hidden in the show, seeing old cast members and the new. I can understand how hearing about new cast members can be a bit intimidating. Knowing the possibility of the new not complementing the old. But I can guarantee you that the you will the love new just as much as you love the old❤️ and as for the ones who haven't seen the series at all, you'll learn to love it just the same, give it a go!",
      "date": "Dec 2, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Very enjoyable. I was not a fan of the original Fraser show, meaning I did not go out of my way to watch it. But for some reason, I find myself enjoying this series far more than I expected. The humor is a bit \"old-fashioned\" and occasionally predictable, but these is something FUN when the segments are pulled off with such skill and perfect timing. The main characters (except for maybe the son), are all so engaging. And even the side characters grab your attention. In particular, Fraser's nephew steals each scene he has. He is a hilarious goofball. \n\nFinal verdict: Far more fun than I expected.",
      "date": "Dec 2, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Put Freddy and Frasier in a room and I could just watch them talk for hours. Love the casting choice here, perfection. Every episode is better than the last. I hope it gets 11 seasons.",
      "date": "Dec 2, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It only took until episode two for my to warm up the new characters, and Kelsey Grammar slid perfectly back into the role. I enjoy every episode and hope it's given the time it needs to develop the characters more. It could use with another legacy cast member though.",
      "date": "Dec 2, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "It's lighthearted comedy in the style of 90 sitcoms. It's entertaining and relaxing to watch a show like this without having the stupidity of modern politics and ideologies thrown into it like everything else these days",
      "date": "Dec 2, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I loved the original, was hoping for something new and exciting but having watched all episodes released to date It's just not good. Poor timing with jokes. Lame jokes, not great characters, I don't even like kelsey Cramer portraying his original character that I loved.",
      "date": "Nov 30, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show is so funny. 😂 I LOVE THIS REBOOT!!!",
      "date": "Nov 30, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Surprisingly funny and engaging, with the throwback to a cheesy 1990's sitcom a dose of nostalgia. Storylines are generally predictable but with fresh jokes that make this an enjoyable watch.",
      "date": "Nov 25, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The laugh track was too much for me. It was awful. It reminded me of the cheesy 80's sitcoms where if there was not a laugh track, you would not know it was supposed to be funny. And I'm not talking about the good sitcoms. I'm thinking along the lines of Small Wonder. Everything that happnes is so predictable. Oh no! Is his son gay? Better make a pretend girlfriend! I loved the original Frasier, this is just sad.",
      "date": "Nov 24, 2023",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "The Frasier reboot is terribly lacking in wit, affectionate characters, and solid storylines. It is so cringy to watch that I have to eat ice cream while watching it in order to sooth my suffering. I was and still am an avid fan of the old Frasier. It is disgraceful to see how far away they made the son and nephew characters from the reality of who the characters' parents were. The younger Freddie was charming and had individuality beyond his years, which is what we would expect from a child of Frasier and Lilith. The nephew likewise, should be uniquely who we would expect from Niles and Daphne, who were amazing characters on the old show.  WTH are the writers? Are they deeply unaware of the norms and mores of the original Frasier? Are they younger folks who want to bring the show into the recent eras of sloppy, rude, dumb characters so commonly seen today? Where's the wit? The charm? Why is this so slapstick, and poorly done, as opposed to the distinctive storylines and sharp quips that garnered the original show a plethora of awards and fame? The Frasier reboot is corny, with unappealing characters further made inferior by poor acting. This is not a great show. This not fun. This is shameful to the fans of the original Frasier.  The reboot is a sorry mess.",
      "date": "Nov 23, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "A great revival that keeps the spirit and comedy of the original. So happy this was made!",
      "date": "Nov 20, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "SOS! Frasier has been trashed! (00.15 star rating) Cannot believe how absolutely effed this show has been treated. Cutmore-Scott is G-level acting, at best, while Salgueiro is wringing out all she can get from a dry, hollowly written character, and Grammer is shamelessly, lazily, under-working a complex character in his (acting and) production. The whole thing is on par with 90's Nickelodeon writing for very young children's shows. No joke -- the writers NEED to be switched out, and the characters need to be respected as the hilarious, richly complex characters with non-tinny plots. The whole thing is vapid, lacks real charm, actual belly laughs, and real issues. Replace Cutmore-Scott immediately (he ought to be on stage with 5th grade performances  - fire whoever cast him too -- no, really -- this is a glaring, super obvious mis-cast), improve the David character from a 2-dimensional buffoon to something significantly better which really represents the culmination of two of the best characters ever, Niles and Daphne, and their dynamic merge. So pissed. So disappointed. Clinical Psychologists, professors, attorneys, writers, actors, teachers, etc... watching for HIGH-END HUMOR and rich writing here! Your audience is not only smart, but very smart. Genuinely doing a disservice to Hyde Pierce, Gilpin, and our beloved Mahoney, who were TOP TIER ACTORS, and effin' HILLARIOUS. Don't need to bring back former characters, but do need to respect and honor the show, Frasier realm, and Frasier-specific audience. Hung in there the whole awful first season, hoping producers, Grammer, Russo, and McMahon, would get it together before the end, but it actually never improves. At all. Not in writing, production, acting, comedy, timing, or casting. Without a massive overhaul, these fools will tarnish the whole show. Super rude, disrespectful treatment of the best show of all time. Initially thought the show was on life-support out the gate (at least it's alive?), but nerrrrp, Frasier revival is dead on arrival. Current team: you are not deserving, at this point, of audience returning for another round of witnessing your abuse. For real - Grammer, you really effed this up under your Production purview. Unforgivable. Make better choices or hire someone to do so and step aside. Turn this dumpster fire into the glorious show it is worthy of and still could become, and stop expecting loyalists (lazy brains with rock-bottom expectations) to do so while milking it for money and crutching on desperate watchers pleased for crumbs of an old corpse. Super grossed out by this.",
      "date": "Nov 19, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "This show is exactly the tonic we need after years of terrible 'modern' television.",
      "date": "Nov 18, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I really like the show. I wouldn't want it to be just like the last. I like the mix of generations and bringing in a new crowd of viewers. I think it will only get better as well.",
      "date": "Nov 16, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Forget the critics. This is an absolute gem of a revival for all die-hard Frasier fans. Frasier was always a show that built up over time. It's slow-paced, deliberate, and clever. Which is a novelty in 2023. I love it. Frasier is still 100% himself as he tries to forge new relationships. Give it time, give it thought, and you'll definitely enjoy it.",
      "date": "Nov 16, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The Reboot Frazier is a monumental disappointment! It's not funny, the characters are weak and trying too hard with over the top acting. The audience clapping and laughing is beyond annoying.  The show sucks so incredibly bad that I can't watch it even though I have watched the original Frazier like a million times and even know the lines.  I miss all the original characters.  Please just cancel it and don't spoil it any further.",
      "date": "Nov 16, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "While it has started slow, by mid-season this series has echoes of the former Frasier. The character who plays Niles & Daphne's son is the low point of the show, and it was a poor decision to try and recreate Niles' neuroses.  The show is best when it moves away from the constraints of the first edition, with the exception of recreating the father/son dynamic.",
      "date": "Nov 16, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Whilst not yet warmed up to the original, the new season of Fraiser is fun, witty and has the same kind-heart charm of the original. I have no doubt that by the end of Season One we will be ready for Season Two. Great to have it back in our lives.",
      "date": "Nov 11, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Kelsey Grammar and Nicholas Lindhurst are both brilliant. However, the supporting cast are unable to portray nuance. In particular, Frasier's nephew is not just bad, he is an outright irritant making this show near unwatchable. The show has some promise, but the cast needs a little restructuring / recasting and Frasier needs to be given some aspirations to invariably frustrate him, as this would likely unlock the comic potential that is otherwise yet to come through.",
      "date": "Nov 11, 2023",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "The return of Frasier is definitely missing allot. The elements that made the character Frasier into the beloved figure from the original series is now diluted with very little serious emotion or dramatic investment from both main & supporting characters to develop the purpose for the show. The beautiful grand opera that was once performed, written & directed by the original cast & crew has turned into Paramount +'s attempt at a Disney Channel version of The Suite Life of Frasier and Freddy, full of bland jokes & meaningless nostalgic situations that go nowhere to develop the ongoing purpose of these new characters. Sad to see the potential that they missed out on if they only stopped to learn from their past success.",
      "date": "Nov 10, 2023",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "So disappointed. It is a thin version of an original masterpiece of a comedy! This is performative am dram and vacuous at times with very faint glimpses of past genius😔",
      "date": "Nov 10, 2023",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "As am in my 70's loved the original. The reboot just does not seem as comfortable a fit.",
      "date": "Nov 10, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "I'm definitely biased as an original Frasier fan, and this reboot/sequel had me laughing & crying. I love the original liner cards introducing each section, I love that Scrambled Eggs is still used. There is heartbreak in Ep 1 but the new lives of each character so far is blithely introduced. Absolutely magnificent & I hope it lasts 10 years. NOTE: LOSE THE CANNED LAUGHTER. ANNOYING AND UNNECESSARY.",
      "date": "Nov 10, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Kelsey makes this work ! He has enduring quality that will last through the ages no mater the supporting cast. He has proven this time and time again . Alot of actors wish they had his abilities to connect to the audience and have them relate to his emotions...master of his craft",
      "date": "Nov 9, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Painful.  It's clearly a laugh track because none of the jokes are funny.  I loved the old show and still watch it.  This writing staff is not up to the level of skill as the original.",
      "date": "Nov 9, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "A good start plus a good comeback for Kelsey Grammer.",
      "date": "Nov 9, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "No one wanted to see this sitcom shine more than I. I went to the taping of an episode and Kelsey is THE most humble accomplished actor around. Still love you Kelsey, but here is my feedback.\n\nWatched 5 episodes and my summary is \"some sizzle with no steak.\" I am also deep into S6 of \"Frasier\" simultaneously and the all-star, supporting cast helped make Frasier beyond special. Real acting chops to compete with and match Kelsey's abilities.\n\nIt pains me to say that there is not much redeeming or magical in this facsimile production. Every young actor lacks credible chops, and combined with the less-than-stellar modern, assembly line sitcom writing, it's often hard to watch them deliver without cringe. The firehouse cast is especially hard to watch. (I'm reminded of my church group actors.) \n\nAnd sadly, as is the case with all modern sitcoms, they have ensured that all of the PC boxes were checked, which doesn't \"add,\" it subtracts with the cringey, \"safe\" dialogue that takes no risks and leaves viewers with no rewards. When you make things catering to the few, the masses suffer. \n\nIts utterly forgettable, and I personally wanted so much more for all involved.",
      "date": "Nov 8, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "Don't waste your time. It's awful with the over acting by the supporting actors and silly story lines. He should have brought some of the actors from the original Fraiser to the new show. He desperately needs their support or this show will not return next year...Hopefully",
      "date": "Nov 8, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "I am a huge fan of the original Frasier. I did go into this knowing that the entire cast would  be new(beside Frasier). Unfortunately, the actors don't have an organic flow like the original. It has Disney Channel lighting, humor, and acting. I'll continue to watch with the hopes of everything falling into place.",
      "date": "Nov 8, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Every modern sitcom I've watched has struggled to write an effective script, cast effective talent, and deliver effective emotional responses. This sitcom has an effective script, effective talent cast at each role, and effective and exceptional emotional responses. The parallels to the original Frasier are brilliant. Frasier essentially puts his son in the position that Frasier was in in the original show, and Frasier essentially puts himself in the same position his father was in in the original show. It's funny watching Frasier realize his hypocritical ways by looking back how things were with Martin. Kelsey Grammer has not missed a beat, even nearly 20 years after the original aired. I'm excited to see how far this show goes and I pray to see it renewed beyond a season 2! This is by far one of the best modern sitcoms to grace the screen today, in my opinion and I'm ecstatic to see how far it goes!",
      "date": "Nov 6, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Fraiser and Allen are amazing. This show is a much needed comfort in 2023.",
      "date": "Nov 6, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I was so looking forward to this Frasier reboot until I learned David Hyde Pierce wasn't coming back. Without Niles, Daphne, Martin (John Mahoney, RIP), and Roz, the show shouldn't have been rebooted. Kelsey Grammer is as good as ever, but without the strong supporting cast from the original series, it's not the same. The razor-sharp dialog is no more. Did they bring back anyone from the original writing team?\nThe actor playing Frederick is miscast. He lacks the range and comedy timing to play against Grammer. The other characters are just weak. I can't bear Nicholas Lyndhurst in his role as the whiskey-soaked professor. What is it with US comedies adding 1 single British actor for comedic relief? It rarely makes sense that a circle of friends would have 1 random Brit in their group. In this case, he's an old Oxford friend, but did the show really need him? Other cast members, like Frederick's workmates at the fire station, are shockingly bad. I was genuinely thrown by how hammy they were. I gave this 2 stars just for Grammer's performance. I've watched to episode 5 now. I think I'm given more time than this show deserves. :(",
      "date": "Nov 5, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Absolutely 5 stars.\n\nThis show is believable and absolutely relatable. In life, there really are first class dorks, loyal friends, everyday hunks, empaths, single-and-successful people, and everything in between. \n\nThe Frasier Reboot showcases the talent of its writers and its cast with thoughtful and meticulously chosen punch lines and plots. \n\nThe plot actually makes sense; there is logic and a nice flow in it; characters' dialogues are delivered well. \n\nIt differentiates itself from many other shows  as it is neither rooted in  nor plagued with pointless bitterness or bashing or violence or nudity. Rather, it  makes all characters shine equally while still successfully paying homage to both Cheers and Frasier (original).\n\n\nThis show def has its  own identity, one that is established in and centers around family, professional prowess, and intricate sometimes messy relationships in life. \n\nThis show triumphantly departs from other shows whose story plot are premised on: \n-zombie\n-supernatural\n-superheroes \n-spy\n-crime- oriented. \n\nNothing wrong those shows, its just this show the Frasier reboot is  masterfully dissimilar and distinct. Viewers should recognize as much right out of the gate. Even more so when ‘reviewing or criticizing'  this show and any others. \n\n\nThe Frasier Reboot maintains its originally wholesome and enjoyable profile with quick-wits (such as the pun about the periodic table!) while  still skillfully making its audience laugh. \n\n\n\nAll that to say-  when rating this show and ‘comparing' it to other shows  just be clear that Frasier (old and reboot) is very  nearly  almost its own unique genre (how many shows focus on the interplay of  staggering  levels of geekiness,  sarcasm, respectable doses of  intellect featuring a psychiatrist, Harvard professor, who is in his 3rd career in life  BUT still trying to reconnect get reconciled with his kid?)\n\n\n\nNot for nothing, Frasier reboot actors can actually act.",
      "date": "Nov 5, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I love watching this new chapter of Frasier's life. I hope it continues for many seasons.",
      "date": "Nov 5, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I am approaching the Fraser reboot as I do the first season of the original Fraser series.  It wasn't Cheers, it was different, as is this reboot.  Timing, character development, and writing will take time to be ironed out.  Looking forward to where this series goes as there have been many glimmers of greatness.",
      "date": "Nov 5, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Really bad. I love Cheers and Frasier, but this felt like a generic disneychannel tv show. Cringey dialogue, over the top acting, artificial sets, forgettable new characters. It doesn't feel at all like the original series. Couldn't make it past half of the first episode.",
      "date": "Nov 5, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Loved the original and the reboot is just as good. The new characters are so good especially Nicholas Lyndhurst, I thought he wouldn't fit in the show but he's been great. Nearly died laughing when he said \"there is no door\" in episode 5. Really hope it gets renewed.",
      "date": "Nov 4, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I like it it's Frasier if you like Frasier you'll like it",
      "date": "Nov 4, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Greatest show on TV right now! Give it at least three episodes it just keeps getting better and better I promise.",
      "date": "Nov 3, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Loved the original series and love this one. There is enough of the old humor; yet, with the current vibe. I hope it lasts as long as the first one",
      "date": "Nov 3, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "So far it's pretty good.  Maybe it's not perfect but it's so much better than any other reboot I've seen in years.  The characters and writing seem on par with the original.  But try to get Niles to come back…please!",
      "date": "Nov 2, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Wilted tossed salad and rotten eggs.... Why is Kelsey Grammar so desperate to be back on television, that he decided to make this ill-advised reboot of an absolute classic ??... The characters that Kelsey interacts with have the depth of a puddle of water.\n This is going to be just as bad as the moronic reboot of Magnum P.I., or the reboot of Dallas... Both which finally crashed and burned.\n I really feel sorry for Kelsey whom is attempting to revive a character that should have just stayed buried.....",
      "date": "Nov 2, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Pra quem viu a aparição do personagem em cheers e passou a gostar e depois teve a feliz noticia que teria uma serie própria mostrando sua familia tornando um grande sucesso que agora tem as respostas do que aconteceu com Fraiser e o seu diaa dia mostrando a dificuldade do relacionamento com o filho, sobrinho e novos amigos.\nFrasier é um personagem marcante é uma felicidade o retorno deste personagem.",
      "date": "Nov 1, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "A fun and heartwarming reboot. I love the new characters, especially the dynamic between Frasier and Freddy. Air hockey anyone? \n\nThe cast already feels like a family, warts and all.",
      "date": "Nov 1, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "A little slow to start like the original, but the comedic timing and physical gags are back. It's been a long time since I've actually wanted to watch a sitcom. It's not ground breaking, but since this formula hasn't been used in a decade, it certainly feels that way.",
      "date": "Nov 1, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "It may not be the most cutting-edge comedy, but this new Frasier is entertaining and definitely has many elements that are both comforting and emotional. I hope there are some cameos from the previous cast (and maybe even Cheers folks as well?), but I'm interested and invested in learning about the new set of Fraiser friends and family members and where their stories go.",
      "date": "Oct 31, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "I think the new Frasier is very good. I do miss the old cast, but Kelsey Grammer is excellent as was expected. I do hope this show doesn't get cancelled.",
      "date": "Oct 31, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I loved it!!! Keep them coming!!!!",
      "date": "Oct 31, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Kelsey Grammar shines in this reboot!  The new supporting cast of his old friend and new Harvard director are very funny.  I like his nephew, son and Eve as well, and feel their characters have lots of  room to grow.  I like that they have kept the wit, gentle relationship driven humor, and slower paced comedy of the original show, and not fallen into the all too tempting  trap of the 30 second sound bite. This is humor with substance and class, excellent acting, good humored fun, and well worth watching!",
      "date": "Oct 29, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Quirky and new version with the Frasier sitcom formula. I miss the old version but enjoy the new spin.",
      "date": "Oct 28, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The first episodes establish the relationships and Kelsey Grammer is awesome no matter who you pair him up with.  \nThe show is just waiting to get it's rhythm and it won't be long.",
      "date": "Oct 27, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Grammer is as sharp and wonderful as ever.  Don't care much for the nephew David or the Eve character but the others are quite good.",
      "date": "Oct 27, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Gutted... Sadly, nothing rings true or links to the old series. It launches off a Frasier Life that we dont know. The years between Seattle and now. The characters are thin, really thin and Freddy keeps insulting and unfriendly to a character the audience loves so you start to really dislike him. Freddy is completely unrelated to the Spelling Bee Champion and nerd in the older series. Everyone congratulates Kelsey Grammer on a return to character, but its not enough to carry the laggers. Nicholas Lyndhurst has the potential to be funny but the script just isnt what it needs to be to shine. And Niles and Daphne s son is straight out of Saved By The Bell. This is not for grown ups with any kind of intellect. Gutted!",
      "date": "Oct 27, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Best reboot in the history of reboots. The end of the first episode was incredibly emotional and a fantastic start. Frazier is still Frazier. It always takes time to begin to like anew supporting cast and it seems that this new one will do just fine.",
      "date": "Oct 27, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The show is funny and not encumbered with politically correct BS. I hope they make 10 more seasons just like this one has been.",
      "date": "Oct 27, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I think it is funny and a good show. I have enjoyed Frasier from his day at CHeers and through his own show. I do not judge a show based on the old, I look at the new supporting cast and see how they can compliment the stars. I have seen 3 shows so far and I like it and hope it sticks around.",
      "date": "Oct 26, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It's reminiscent of the original but still fresh.  Frasier himself still has that awesome wit, which carries the day for me.  Can't stand the studio audience, if that's what it is, or canned laughter.  Not crazy about the nephew and the Eve characters.",
      "date": "Oct 26, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "The critics are useless, with overinflated egos as per the usual (someone ought to break the news to them that no one has ever cared about their review of anything) \n The new Frasier reboot is a perfect mix of emotional moments, series moment, and comic relief. While it will never be the first Frasier series or cheers, It is a great sequel series to our beloved character. It is worth watching if you liked the first Frasier series. The new characters will take time getting to know, but the makings of a fantastic story line and good dynamic are in the making.",
      "date": "Oct 26, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It's unrealistic and unfair to compare the show to its predecessor as all the much loved characters with the exception Kelsey Grammar which made it so special are no longer present. We instead have a new setting and characters which will need time to establish themselves which hopefully will happen as the show evolves much like the original. The writing is still snappy and Kelsey Grammar is at his best as Frasier, I'm listening.",
      "date": "Oct 26, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "As a Generarion X viewer of the original Frasier, and a fan who watches the reruns weekly, I know this series and its cast well. That being said, I always give a reboot a chance, as a new and separate entity. Unlike other purists, I am looking specifically at the relationship with Freddy and Frasier and this is why my review is unequivocally rotten. Freddy is so unlikable and unrelatable as a character, it is almost as if the writers decided to make him the most one-dimensional jerk that they could, almost a background character. His not attending his grandfather's funeral was the worst decimation possible of his connection to his blue-collar values he shared with him and shows that Freddy is neither working nor upper class. He is instead, a classless shallow, self-centered, garbage human being. If his entire development is predicated upon his love and connection to his grandfather, he would have attended his funeral without hesitation. Whoever wrote that he didn't attend this pivotal ceremony, literally obliterated Freddy as an absolute lost soul and horrible transactional person. His grandfather flew to him for support when he needed him and he doesn't attend his funeral after? I am not familiar with the actor who plays Feddy, but find his performance as interesting and relatable in his role as a robot. His facial expressions are that of an alien who zipped up in a human suit and is attempting to wear it, like the Edgar suit in Men in Black. Yeah, he is that awkward. His unrealistic action of kicking his dad out when he flew in to see him was gross and disturbing on such a level I wanted to literally see someone come and punch him in the face. So he disrespects his grandfather's memory and his father, both who have financially and physically supported him all his life? Who wrote this character? I would recast Freddy immediately with a new actor who is capable of being animated like Niles, Martin and Frasier were. It is both the actor and the character as written who ruin what could be a decent plot. His British colleague and friend is funny and adds dimension and development to the plot. His new Harvard boss has potential, especially the actress playing her, but it is as if someone forcing her to occupy a 90's canned laugh space that is beyond awkward in 2023. Give her more depth for the sake of all women, please!  She has such potential beyond simping to outdo her sister! Did a man write her?  Allow her to have discussion with Frasier that gives the weight and humor we enjoyed between Niles and Frasier please! Also, Niles son is overly written as neurotic to the point you want to ask the writer of his character, really? The roommate with the baby is not a good choice either. The actress is fine, not someone you feel can really have the depth and charisma to carry it past corny jokes though. Replace that actress please. The setting is good, the acceptance of the job by Frasier flimsy, and the attitude that Harvard is so beholden to students liking the professor they turn Frasier's classroom into a version of his Chicago TV show is beyond suspension of belief. Recast Freddy and rewrite him. If you are a writer working on developing his character, you wrote him so poorly it's like watching a choir when that one singer is so off-key, that you cannot give any of your attention to anyone else who is actually doing their job. As per the local hangout bar, the characters feel like a mixup from the 80's, 90's and 2000's and come across as idiots who cannot use any of their grey matter to figure out Fraiser is Freddy's dad. Really? Do the writers hate the audience this much? This feels sullen, grey, sad, angry and absolutely flat to watch. DEVELOP THE CHARACTERS PLEASE and allow them to be human. Stop forcing a 2023 gloss onto this new storyline to the point there feels like there is no hope. Freddy hates pretentious Harvard. Check. He loved his grandfather and wanted a blue-collar job like him, check. Now recast the actor (his face alone makes me want to nope out of this reboot as he has about as much ability to show expressions and emotions as the top layer of left-out-too-long, old school pudding. Also, enough with the terrible trope of \"every parent did me wrong so I am full of hate adult characters\" as all it does is anger parents and make non parents never want to even try. Freddy had the best of everything and every advantage. The best of both classes with his grandfather and father. He could have shown respect to someone for his life most Americans would kill to have experienced. It's not like he grew up poor and without love. His character is so mean and cruel he needs to be on Scared Straight. Anyway, I could have made this as pretentious as the 10 dollar words Frasier uses to his acclaim, but I kept it as sparse and as working-class as a discussion would have been in Cheers, among the locals who inhabited it back then, for you, the writers. Do better and I am going to give this show a chance. You will NEVER change my mind on the horrible casting of Freddy though. Quick, recast before the show has really started and when you do the casting, find a human, who is not an alien zipped up in a Freddy suit.  God, this show has potential. Hey writers, fix what I mentioned and the mediocre could become the  powerful. But hey, I'm just a huge Frasier fan since 1993, and a working stiff, so what do I know? Haha",
      "date": "Oct 26, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Definitely worth watching, has a lot potential. Kelsey is as amazing as ever.",
      "date": "Oct 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Stop moaning and comparing it the old show which was excellent . It's marvellous to have him back and give the rest of the cast a chance to make their mark, Let's hope after series 10 we can then judge if it's just a good 8/10 or a super 9/10. 😊\nWell only one left to watch and it's certainly worth another series  and more episodes this time please, Kelsey brings out the best in all the cast . Now come on David Hyde Pierce come back at least for two episodes.",
      "date": "Oct 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I really want to like this and so I am persevering. It feels like someone either lost a bet or is doing a favour for a friend. I think I am watching a high school production or an 80's pilot with added laughter. \nFrasier's character had developed so much and then he returns and regresses back to his character when first introduced on Cheers, no depth, just there to annoy and be laughed at. It's almost like they are using an old formula but pretending it's new. The old formula worked because of wonderful writing, acting and chemistry between actors. The viewer believed they were family. There doesn't seem to be any familiarity with the new cast. They just don't connect with each other. I really am hoping it gets better.",
      "date": "Oct 24, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "New Frasier is like day without night with the absence of Niles. Writing is poor, subtle humour is missing, timing sucks. Characters just do not work.  It's a real shame that younger generations will think of this show when they hear Frasier, rather than the original genius show.",
      "date": "Oct 23, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Poor casting, with only Frasier from the superb original cast makes this new series poor, they are just not funny and the excessive canned laughter makes it annoying. I am British but hate the Nicholas Lyndhurst character, despite being a fan of his in previous TV shows. They should have kept the original series  and not tried to recreate the genius it was.",
      "date": "Oct 23, 2023",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "I am totally on board with the new show! It's not as good as the original, but it's getting better with each episode! Like the original, it has a lot of heart coupled with a strong dose of eccentricity, which is, in my humble estimation, an entertaining combination. Not all the jokes work, but the show is new and I believe the writing will come together. Even in its current state, it is better than 95 percent of everything I've seen on any platform since the original show left the air in 2004.",
      "date": "Oct 22, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I love the show. Of course, I'm not jaded by having watched the previous version. Great news! You don't have to know a lot about the old show to enjoy it ( I did watch Cheers). I've started watching it now. I guess without this one, I would have never would have watched the old one.",
      "date": "Oct 21, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The concept is fairly solid, with Frasier trying to reconnect with his son Freddy and becoming a professor at Harvard.  The cast doesn't quite gel at first, but things warm up somewhat by the end of the second episode.  So far, it doesn't hold a candle to the classic 90s sitcom, but it is enjoyable enough.",
      "date": "Oct 20, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "I very much enjoyed the show for several seasons. This time around, I couldn't even make it through episode 2. Poor writing and and weak cast. I don't understand why Kelsey Grammer agreed to do this.",
      "date": "Oct 20, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "I liked all three episodes so far.  I found myself laughing out loud during all of them.  I think the actor playing Frasier's son could use a few more acting lessons, but all-in-all it works well and is a VERY nice change of pace from all of the doom and gloom every where else.",
      "date": "Oct 20, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Sadly, this lacks the timing and the chemistry of the original series.",
      "date": "Oct 20, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "Very funny. The format works. The humour mirrors the structure of the original - if it's not baroque, don't fix it! Fun to watch, highly recommended for anyone who enjoyed the original.",
      "date": "Oct 20, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "The Frasier reboot is like putting on a familiar, warm, cozy sweater that you've loved over the years and that has great memories baked in for you. It also does a great job of recognizing that and sprinkling in wonderful little winks to its predecessor. These moments will make it worth it for fans of the original. With a new cast, it is different of course but after waiting nearly 20 years for this, the reboot also doesn't have to be perfect. In our tumultuous world, the Frasier reboot is a welcomed respite for long-time fans, like me. It's not flawless but I'm so very grateful it's here.",
      "date": "Oct 20, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Has same kind of intellectual humor that the first version of the show was known for. I will always watch this as long as they keep putting out new episodes, I really love the nostalgia and the new cast is pretty good so far. But it would be great if they could bring Niles and Daphne back, too.",
      "date": "Oct 20, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The rebooted Frasier is tired and terrible. Nonsense setup with his son married with a son Frasier is unaware of. New characters are caricatures, everybody has an unfunny quip and the young nephew is the worst. Barely made it through the episode and would watch old Frasier reruns if I get the urge for Niles and Lilith.",
      "date": "Oct 20, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "I absolutely love it!! Looking forward to more episodes, a die hard Fraiser fan here. What a great treat to have more of this pompas psychiatrist in my life. I'm also truly excited about the addition of Nicholas Lyndhurst. I'm a big fan of Only Fools and Horses as well,  This is a win... \ntruly digging this. I hope it makes it!",
      "date": "Oct 20, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Was thinking it would suck from the trailer but it does not. Kelsey Grammar is great as always. Supporting cast needs a little work due for a high bar set by the previous cast. But overall I'm enjoying having this show back.",
      "date": "Oct 20, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Love having Frasier back, it's good to see the character anbain and trying to fix mistakes he did with his dad, making the old show and the new show a little be closer to each other. \nThe actor makes frasier like old times, it's still there. Love it!",
      "date": "Oct 20, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Frasier is back and I couldn't be happier.  The reboot has delightful new characters and the ever lovable Frasier Crane. Kelsey Grammer was born to play this role and I love it!!!",
      "date": "Oct 20, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I'm a fanatical Fraser fan, and I so want the 2023 version to work. After watching episode 3. I am starting to warm to it, but David and Olivia get on my nerves. David's character in particular is way over the top. It's very distracting. Like the young girl. She's good. Character of Fraser's son is ok. Kelsey's portrayal is spot on enjoyable. So is his British friend's. The two of them plus young girl carry the show. Take it down a notch. Characters not caricatures. However, I must say I appreciate  the Dr. Phil parody. the Oprah parody, and the satirical look at the dumbing down of higher education in episode 3. Kudos.",
      "date": "Oct 20, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "I am HUGE Frasier fan. I could barely get through episode 1 and simply could not get through episode. People who like this are people who liked Rings of Power. I will continue watching the original series.",
      "date": "Oct 19, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "First two episodes are terrible. Laugh track is annoying. Dialogue too wordy and punchlines too predictable. Really dislike the that really young guy. A shame really.",
      "date": "Oct 19, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Very weak supporting cast ruins it.",
      "date": "Oct 19, 2023",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "It was always going to be a tough start but the potential is all there. I enjoyed it and had a few laugh out loud moments. So good to see it back on our screens.",
      "date": "Oct 19, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "I thought the show is pretty cute.  It needs to expand on some of the new characters, but I think it will be good given some time.  The guy that plays David has Niles characteristics down pat. The only thing I didn't like about it was the fireman using God's name in vain in the second episode.  There was no reason for that, and it was not a part of the former show.  Kelsey Grammer said much about his faith after The Jesus Revolution movie and it seemed out of place that such language was added to this tv show.  I'm sure Kelsey has some say so about that as he is the main character.",
      "date": "Oct 19, 2023",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "I want to like this show so much... Aside from Kelsey and the bloke from 'men behaving badly' everyone is over-acting to the extreme. Any scenes with the son and his girlfriend are unwatchable, Freddy in particular looks like he's 2 seconds away from yelling \"zoinks!\" and doing some slapstick falling on his ass kind of stuff. Just some god awful casting.\n\nWhoever directed this mess has essentially killed the one shot of a Fraiser comeback, so that's a crime in and of itself. If you think I'm being harsh, just watch the first episode and enjoy the cringe. \n\nThere's maybe one or two classic Fraiser moments in the episodes, which is the only reason why I'm not giving it half a star.",
      "date": "Oct 19, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "More than just a walk down memory lane, the show is really good.  The first episode was too farcical, but the second was in the lane altogether.  I consider farce is best enjoyed with those with whom the audience is familiar, and I may have had familiarity lag",
      "date": "Oct 19, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Love it!! Amazing job honoring Mr Mahoney!",
      "date": "Oct 19, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Really loved the first episode and can't wait to watch more! It's",
      "date": "Oct 19, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Bad! Really, really bad! I attempted to watch an entire episode but, unfortunately, I had just eaten so my original plan was impossible.",
      "date": "Oct 19, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Watched the 1st 2 episodes and that is enough for me. The standout, witty dialogue of the original is totally missing and the 'canned' laugh track is annoying.  Maybe Kelsey Grammer has too much input; we all know his ego rivals that of Frasier Crane's.",
      "date": "Oct 18, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Enjoyed the remake. Like it picked up where it left off. Naturally the cast can't be the same or their original age, they're older now. But Kelsey Grahamar is the same with his sophistication and caliber. The Freddy fits in where Martin left off. Three cheers for the writers and keeping it family watching enjoyment. Amen to this prime time show and can't wait for many more episodes.",
      "date": "Oct 18, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I'm loving this continued version of Frasier's adventures! Nicholas Lyndhurst, a master sitcom legend in the UK, is hilarious as usual and his banter with Frasier is brilliant. Funny and charming, a worthy successor to the original.  Keep this new series coming !",
      "date": "Oct 18, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Was going to write it off…reboots are almost always bad. Decided to take a chance and I loved it! They shot and wrote it almost exactly like the original, but new characters. A new fave.",
      "date": "Oct 18, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "If you love Frasier, you'll hate this! It's all easy, unsophisticated jokes with obnoxious laugh tracks over each one. The original series was so well done, my wife and I have gone through the series a dozen times. This was a total letdown.",
      "date": "Oct 18, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Love it! So funny. Great throwback show to more funny sitcom days.",
      "date": "Oct 17, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Dreadful and dissappointing, what more can one say?",
      "date": "Oct 17, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I am not sure why this show was rebooted better to leave it in the past. It is not funny and the characters are one dimensional. No wonder the original cast did not want to be part of the reboot.",
      "date": "Oct 17, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "I have watched all 11 season of the original Frasier probably 50 times. Love the original show. I and my friend who both love the original really like the first two episodes and are looking forward to many more. Only thing remotely disappointing is David Hyde Pierce (Niles) did not return. That would have put the show over the top. Hopefully he comes back in future seasons if even for an episode. Also, the video clip where they honor Martin is weird, like why is he sitting in that little black chair and not his classic green recliner and where is Eddy?!",
      "date": "Oct 17, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I truly enjoyed the first two episodes, the second episode more so, Frasier is still witty, and a fussbudget, I think the tribute they gave to Mike Mahoney, AKA Martin, was exceptional, and emotional, Freddy is a great opposite to Frasier, and David, Nile's son, I liked very much, he is so his father's son! I look forward to the rest of the season.",
      "date": "Oct 17, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Fraiser returns not only with great nostalgia, the charisma he has in the first shot, we know he is fraiser, it is very interesting how they will manage to bring his life to a mere reunion with his son, as happened with his father, the well explored dynamics of the son not understood, now it's freiser's turn to be in martin's shoes, bull dog would be a great cameo along with ross, but this new adventure can have the best of 4 generations, nostalgia of the bar and his beginnings in boston, and how he buys the building where he will live, that in his beginnings was impossible, see how he develops this interesting as a Harvard professor and being a celebrity, touches of nostalgia put the names of the iconic people, like david (real name of niles in real life, or a nod to eddy (musse) with the name of a fireman, genius definitely great.",
      "date": "Oct 17, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Kelsey Grammar is great as always as Frasier, and as a long time fan of Only fools and horses, I was thrilled when I heard Nicholas Lyndhurst had been cast. Both of these reasons were the driving force for me to check out the new show.\n\nBut the fun kinda stops there. The other new cast members are ok, but they're nothing special.  The character of Nile's son is awful through, he's just NOT funny. His jokes aren't funny and his entire character brings absolutely nothing to the show. \n\nI kinda wish they had done better casting for these other characters as they just don't come close to the quality I've expected from Frasier. I watched the Frist 2 epsidoes and I'm not feelin in a hurry to watch the rest personally.\n\nA lot of the jokes are very meh. They feel a bit too PC or something. There's zero edge to any of the jokes and they all seem designed to make sure nobody could possibly find offense to, so you get what you get. Luke warm, safe comedy where nobody gets triggered. \n\nAlthough the show is filmed in front of an audience, it's definitely padded with a laugh track because some of the jokes get a far bigger laugh than they ever deserve, or maybe Americans will just laugh at anything? Who knows. I think I'll stick with British/Irish sitcom's because American sitcom's are dead as disco because Hollywood production now is too terrified of bad PR and or Twitter rants to make genuinely funny or edgy comedy. I think most of the positive review are based on Nostalgia for the original run.",
      "date": "Oct 17, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "I got teared up at the end of the first episode. Niles is sorely missed but it's still quite good. Looking forward to Season 2.",
      "date": "Oct 17, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "If you loved Fraiser, you're going to like this based on viewing the first two episodes. I can't wait for the eventual guest appearances of all of our favourite former cast.\n\nThe jingle at the start, the same style of writing/humour, the whole thing is like watching the 12th season of Frasier!",
      "date": "Oct 17, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "COMPLETELY LOVE IT!!!!!!' Omg I really do love it. Wish DHP would feel the love and join the show which would bring Daphne's character back too but it is fantastic to see the rest of the cast and crew. So happy that the show is back!!!!",
      "date": "Oct 17, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Incredible return to TV!  Have been a long-time fan of Frasier & Cheers, and I've been really happy to see a return to this storyline.  Starting off strong, and looking forward to seeing the return of some favorite characters.",
      "date": "Oct 17, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Hello, I was really looking fwd to the Frasier reboot but was so disappointed!!!\nI didn't find one thing funny. It was difficult to sit through the episode.  The writers are AWFUL! Why didn't you use a couple of the writers of Frasier??? They were incredible! And Kelsey Grammer could do it again, make people laugh. But with the current writers, he has nothing to work with!!\nThe supporting actors are awful too! Freddy is horrible! He doesn't even seem related to Frasier! He should of been in a career that fit his character more from the Frasier series! He was a lot like Frasier and Lithe. The writers could still have him not get along with Frasier but to be a fireman is so out of his character!!\nI hope this tv series can somehow change things to make sense! Also, why didn't they use the actor who played Freddy as a kid, he was great!\nI think they should use the first two episodes as a bad dream, then when we see Freddy, he actually is employed at a job that fits him better (a educational, professional job) and he can still have issues with his dad.\nAll I know is, if it continues the way its going, I will not watch it. It was terrible!! And so disappointing. Soooo disappointing!!☹️",
      "date": "Oct 17, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Fantastic reboot. Frasier has grown and it's shown in the reboot. Great cast strong and funny. Don't miss it!",
      "date": "Oct 16, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Shockingly decent. Obviously it's not as good as the original, but the setup feels fresh and I hope it develops and PRIORITISES THE WRITING!",
      "date": "Oct 16, 2023",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "A wonderful start. The absence of some of the old characters is immediate and painful but Frasier must go on with his life, just like this show.",
      "date": "Oct 16, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Horrible writing and character development. \n\n1) Niles and Daphne's son couldn't be more of a cartoon-like overdramatized Niles with his anxiety in the first 3 seasons in the 90's pushed into his introduction...  Speaking of introduction, 5 min, in, he grabs a suitcase and \"comically\" (as in 1930s black and white comedy) falls down while Fraiser says he \"doesn't have the heart to tell him it's not his suitcase... The suitcase was on his rolling cart in the next scene.\n2) Freddy's \"girlfriend\" was wearing an engagement ring/wedding ring when introduced to Frasier. I'm sorry - is he now just obtuse to detail? you know, that aspect that is his specialty? \n\nI'm only through the first 10 minutes and don't want to chastise it too much after 2 episodes, however Fonzi just jumped the shark before the eggs were scrambled, IMO!",
      "date": "Oct 16, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "I went in with optimism and although it isn't as good as the original I still really enjoyed it. I was surprised how quickly I was laughing along honestly. Far better than the critics are saying my only unsure moment is Davids character needs a bit more Moon about him, he's coming across as Sheldon Coopers kid",
      "date": "Oct 16, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Obviously not the same as the original Frasier show. Martin and Niles were as important as the leading man but I love to see Frasier back. And it is better than I expected… not sure about the mini Niles though…",
      "date": "Oct 16, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Way better than the critics are saying and was honestly surprised how much I enjoyed it after reading some of the critic reviews. Hardly anything will compare to the original Frasier, but the cast work well together and Kelsey Grammer as Frasier is magic.",
      "date": "Oct 16, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Ignore the critics, it's so much better than I'd been led to believe. How can the critics write a show off after two episodes? It still has the same rhythm of the old show and a new cast of characters you will almost certainly grow to love.",
      "date": "Oct 16, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "I'm pleasantly surprised how funny and tasteful the revival is. Kelsey Grammer slips back into the \"Fasier\" character with such an ease and naturalness, it's like he never left. The jokes are great too. If you're a huge fan of the original, this is totally worth checking out.",
      "date": "Oct 15, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Loved the show actually.",
      "date": "Oct 15, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I am sorry that the pretentious critics have panned this show\nThe writing is a great nod to the original and this is a terrifically funny reflection on the original character.\nThe show has warmth and wit. And is spot on right from the first episode.\nI do not actually care if millennials or Gen X don't get who the characters are…there are plenty of Boomers who are actually still alive and we remember Frazier and are thrilled he is back!\nWe are listening, Frazier!",
      "date": "Oct 15, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great start. New characters are fun and Frazier, well, he is Frazier. Enjoyed!",
      "date": "Oct 15, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Frasier is back. I lived first two episodes.",
      "date": "Oct 15, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "It's not the original Frasier, but after a weekend of fast forwarding through movies that were just 'meh', I've found myself rewinding, rewatching and savoring every minute of the 2 episodes of the new reboot available to me right now. Again, no, it's not the original, but I missed Frasier and the people in his life even though those people are new. Frasier's back and I'll take it! Please everyone stop crapping all over this show. I'm enjoying plugging back into and catching up on Frasier's life. Please let the show grow!",
      "date": "Oct 15, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "I'm a big fan of Frasier and have anticipated this reboot. I'm loving it, hoping it last for several seasons. Funny, witty & very entertaining.",
      "date": "Oct 15, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It was risky bringing in a whole new cast but for a lifelong Frasier fan, the homage to Martin and his real life actor John in the first episode was wonderful, and the spark of the original shines through.",
      "date": "Oct 15, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I love the first 2 episodes of the new FRASIER so far. It takes a while to warm up to the new supporting characters but once it gets going, everyone fires on all cylinders. \n\nDon't get me wrong, the original Frasier will never be topped. \nAnd that's okay. This new incarnation is its own thing. But that distinct Frasier touch & humor is still there. It really feels like what if the show continued on & didn't end in season 11. \n\nKelsey Grammer is still magnificent as Dr. Crane. He clearly carries the show while still letting the other supporting characters shine as well. \n\nSo far, my two new favorite characters are Frasier's old college pal, the extremely dry professor Alan Cornwall (played by the great British sitcom legend Nicholas Lyndhurst) & Frasier's bumbling but earnest nephew David Crane (Niles & Daphne's son). \n\nIt's great to be able to watch Frasier on a weekly basis again, even if it's only 10 episodes.",
      "date": "Oct 15, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "The magic is gone. The show runners are working really hard to capture the spirit of the old show but have far less to work with. Grammer is still a machine, slipping into the character he made his own since 1984, but the supporting cast is poorly written and flatly performed. Two shows in, no romantic interest. The draw of the old show was that it took a familiar character and wrote a new direction. This show just rehashes the same plot devices, down to the 'odd couple' pairing of father and son. A snarky, snooty supporting character. An apartment full of stylish things that Frasier obsesses about. Seen it.",
      "date": "Oct 15, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "Whilst the new Frasier isn't the same as the old Frasier, it still, for me anyhow, has the same wit, charm and feel-good factor.   I remember the old Frasier, I was around when it first aired and I still enjoy watching it time and time again and it's somewhat naïve of anyone to think it would be the same as it used to be.   \n\nWe don't have the same characters in the first two episodes of the 2023 season (only one's I've seen so far) as we used to have, but Frasier is still good ole Frasier and Nicholas Lyndhurst brings a new charm to the new season, one which I sincerely hope and expect to see in the remaining episodes.\n\nAnyone watching the new Frasier, not having seen the old Frasier, may consider it a tad tame for todays view, however I cannot get away with just how well Kelsey Grammer and the writers have done to resurrect the same witty, sarcastic and pedantic Frasier that we loved from yesteryear.\n\nStill funny, still charming, still a very worthwhile watch, but a slightly different feel given most of the old characters aren't present.   Watch it bearing that in mind, and hopefully you'll also agree that Frasier is, well, very much still Frasier!.\n\nIf I can encourage anyone to watch it, I'd say it's not so much a \"must see\" but rather a \"should see\".",
      "date": "Oct 15, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "The laugh track.... 🤢🤢 And the jokes I like from a sitcom 20 years ago daytime sitcom... One season that's all it's going to get might be lucky to get a second",
      "date": "Oct 15, 2023",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "The second episode is much better than the first but The Frasier revival isn't going to win over new fans",
      "date": "Oct 15, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "What a breathe of fresh air on a reboot, ha. I'm a huge fan of Frasier and this new series was so very reminiscent of the original which, I absolutely loved. I don't see this kind of silly, slap stick humor anymore and I miss it.  Glad Kelsey Grammar has come back and I love the son is the continuance of the late, great John Mahoney's character, great casting!",
      "date": "Oct 15, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Captured the magic of the old show. Liked the new characters as well.",
      "date": "Oct 15, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "This was amazing! A great introduction to a sequel of a classic.",
      "date": "Oct 15, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Fair enough start as expected - giving some back story to characters. Expect the usual first two episodes to be affected by this but expect a smoother run from episode 3 onwards.",
      "date": "Oct 15, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "** SPOILER ALERT **\n\nOkay, now that I said that, I'd like to give my opinion (for what it's worth) of the new Frasier show. I'm not sure how many spoilers I'm about to give, but I'm sure I'll give a few, so be warned….\n\nFirst, I should say I had sort of low expectations. Based on the trailer and some reviews I already read, as a diehard fan of the original show, I really thought I was in for a disappointment. I was hopeful, but without the original cast, I sort of felt like I was going to see a Paul McCartney concert but expecting to see the \"New Beatles.\" You know…Paul is great, but he's not the same without John, George, and Ringo. Similarly, Kelsey Grammer is great, but he's not the same without David Hyde Pierce, Jane Leeves, Peri Gilpin, and of course, John Mahoney.\n\nThat being said, I was surprisingly very entertained by the new show. I love the dynamic between Frasier and Freddy and it so perfectly mirrors the relationship Frasier had with his father. Also, the \"twist\" of Eve not really being Freddy's girlfriend, and then her having an infant son named JOHN (after John Mahoney, of course, just like how David is named after David Angell) was actually pretty clever. While David was unfortunately a weaker link, I think that's more a result of writing than of Anders Keith's acting. I want to give him a chance, since the role he plays has SUCH tremendous potential. \n\nThe Harvard boss, Olivia, could be interesting, though it's still too early to see what her importance is in this story. And finally, the old friend, Alan, has that dry wit and sense of humor which could turn out to be a great asset. I'm an American, so I didn't really know who Nicholas Lyndhurst was, but he's obviously a very talented comedic actor.\n\nFinally, I LOVED the so-called \"Easter eggs\" and fun references to the original and even to Cheers. David reminding Frasier of both Niles and Daphne; Frasier describing his dad's funeral, and specifically Bulldog singing Ave Maria(?!?!); And even Frasier saying he probably spent too many of his years in Boston in \"a certain bar.\"  But the heart in this show, the father-son relationship, was the heart of the original. As long as they can maintain the style and witty comedic writing, I think it has a lot of potential. I would put those first two episodes on par with an AVERAGE episode from the original series. It was not nearly as good as some of the greats (Dinner Party, Hooping Cranes, The Innkeepers, etc.), but it was certainly better than many of the stinkers. So, if you haven't seen it, you should definitely give it a chance. And if you have, you should still give it a chance to grow into itself. It wasn't perfect, but it has a lot of potential and first episodes are rarely perfect.",
      "date": "Oct 14, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Like all new shows, Frasier took time to rev up, but by the end of the first episode I remembered why I loved the original series. The diverse case was likable, funny and inviting. The set up was smart and easy to accept. The humor was full on by the second episode when the show caught its full stride.  The hockey table scene was pure Frasier antics. Poor critics, they just don't get it. The people have spoken with high marks ( 86%), while they, in their withering assessment, could barely rise to a 55%.  I suspect the critics can't relax and enjoy the show for two reasons. 1) Frasier, a man fully comfortable with his tastes and educational pedigree, may be too \"elitist\" for these critics who are so unbelievably out of touch with the people time and time again (and who, no doubt, are proud of  their own discerning tastes and intellectual pedigree). What irony!  2) I suspect, in this time of hyper-socio-political divisiveness and political correctness gone awry, Grammer's politics may stifle their freedom to savor the  warmth, cheekiness and nostalgic sweetness reminiscent of a  less constricting time.  We could once enjoy a show/performer no matter what their personal beliefs; now it's litmus this and litmus that, litmus cancels the yellow cat. But this is where we are now... excuse me: this is where they are now.",
      "date": "Oct 14, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "The second episode is much better than the first and I think (or hope) it will get even better as the season goes on. The most important part is that Frasier is still Frasier. He hasn't changed a bit, for better or worse. He's just in a (sort of) new setting and he's elderly. It's a soft reboot in that it's about a father and son. Only this time Frasier is the father.",
      "date": "Oct 14, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Frasier is just as witty as ever. I miss the original cast members, but I'm so happy to have Frasier back in my living room. I laughed several times, and will watch worry single episode that comes out. I hope there are many seasons to come. My family adores this series already!",
      "date": "Oct 14, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I was pleasantly surprised.",
      "date": "Oct 14, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I was worried that the show would be horrible, but I was pleasantly surprised.  I really liked it and it made me laugh.  Kelsey Grammer  effortlessly falls back into his role of Dr Frazier Crane.  I do miss Niles, Daphne, Lilith, Roz and Bebe, but some of them may make an appearance.  The show also paid tribute to John Mahoney who played Martin Crane.  I did love the character Martin Crane and he will be missed. It may be because I'm older and loved the original, but this seems well written and I'm hopeful the rest will be good.  Hey, give the first few episodes a try, you may like it, and if not you haven't lost but an hour or two.",
      "date": "Oct 14, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "There's a Niles sized hole and without the culture clash with Martin, it falls a little flat, with forgettable supporting characters but then it's still early days assuming it' gets more than one season",
      "date": "Oct 14, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Don't pay attention to the cynical critics, the show isn't amazing, but it's solid.  Kelsey Grammer falls perfectly back into the role, and the spirit of Frasier is alive again. The first episode of the reboot is just like the first episode in the original series, but Frasier is the father that is disconnected from his son. The show is like the original, the dynamics between fathers and son.",
      "date": "Oct 14, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Look, there's Kelsey Grammer. And he's effortlessly Frasier Craning like no time has passed. That's impressive.\n\n...but who are these other people? And what on earth are they doing? The people credited as \"writers\" here are anything but? What a bunch of amateurs and nobodies, devoid of talent or skill.\n\nThe actors aren't any better. These are the absolute cheapest, bottom-rung F-list actors you can possibly get, if indeed \"actors\" is what they call themselves. They get to deliver their lines in monotone indifference standing next to Kelsey Grammer, and then trip over their own feet while slapping themselves in the face with a pie.\nThe highpoint and ultimate embarrassment of their brief and improvised careers.\n\nIt's worse than a parody. Worse than satire.\nThere is quite a lot of awful tripe in Kelsey \"The Rumble\" Grammer's work the last decades.\n\nA triumphant return to the glory days- this isn't.\nReturn Frasier to the dead. And let him eternally lie, for god's sake.",
      "date": "Oct 14, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Funny, witty, charming and great actors!\nAs good as the original series. Please, more seasons!!! Save the sitcoms!!",
      "date": "Oct 14, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I'm not surprised to see that online critics panned it, but the audience loved it. I'm sure \"top critics\" will be people under 40 who found the laugh track tacky, thought the younger actors \"couldn't keep up,\" or older people who thought new characters were \"annoying\" because they're young. If you're an old fan who watched it and didn't like it, it's because you've changed, not because Frasier has. It's the same premise as the old Frasier, and Grammar hasn't changed a bit. \n\nI'm guessing many people watched 10 minutes of it, groaned, and judged it just on those first 10 minutes. It was awkward in the first 10 minutes. Once it hit its stride, though, it was wonderful. I'll be tuning in to all 10 episodes.\n\nI remember when the original Frasier was out, I was a teen. I hated it. I hadn't gone through a divorce yet in life or experienced adult drama, so I didn't get the humor. I watched it later as a 40-year-old and binged the whole series in a few months. I finally got it. Frasier is something you either get or don't get. It looks like the audience got it but critics didn't. I see that a whole lot these days. Unless it's a silly melodramatic AAA show with music cranked up to 1000 during every episode, they don't get it. It's like reviewers have lost the ability to understand anything that isn't politically charged, dramatic to the point of being silly, or complex to the point of making you feel terrible about yourself and spiraling you into an existential crisis. Have we forgotten simple comedy? Simple anything?\n\nThis is a simple family comedy, and it's a good one. Re-watch it. The humor hasn't changed. You have. Your brain has been tuned to watch comedies in silence. Just the laugh track alone makes some reviewers and even audience reviewers cringe, and that's deeply unfair to shows with good writing like this. I grew up with laugh tracks in my childhood and teens, but when I was 28, they switched to comedies with no laugh tracks. I can remember the silence of some of those early laugh-track-free comedies making me so uncomfortable I couldn't watch them. Modern Family is the first show I watched that didn't have a laugh track, and it made me feel awkward the first year I watched it. Then my brain adapted. Now it's the opposite. I'm used to watching comedies with no live audience laugh track. If you learn to re-tune your brain to accept the laugh track and judge the show on its own merits, it's pretty much Frasier the way it always was.\n\nFrasier is Frasier. His Harvard colleague plays the part of an older Niles. His son takes on the personality of Frasier's father. And the department chair who suckers him into a position at Harvard is Ross. It's the exact same show, and whether reviewers remember or not, Frasier was always about putting quirky, goofy side characters around Kelsey Grammar so that he could make hilarious one-liners. This show succeeds at that.",
      "date": "Oct 14, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Its just awful. The most pbvious sitcome clichés and jokes. This wont get a season 2.",
      "date": "Oct 14, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Is it the old Frasier? No, but no one should expect it to be. It's the next chapter of his life and I'm here for it! I loved the first couple episodes. Although some of the acting from the newbies was a little cheesy, I liked the humor and seeing more of the lovable pompous lead.",
      "date": "Oct 14, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It's amazing that after 20 years, Kelsey Grammer picks up exactly where he left off. Great cast. Great show.",
      "date": "Oct 14, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Dumb dumb dumb and boring boring boring.  I liked the original Fraser.  This one is a money grab.",
      "date": "Oct 14, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Exceptional, finally a 2023 tv show with good acting, smart writing and absolutely no politically correct cliche characters !!!",
      "date": "Oct 14, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Incredibly well done. Frasier starts up again without missing a beat! The new members to the cast are deliciously fun and the chemistry is already palpable!! Loads of talent here and the story is beautiful unfolding already!",
      "date": "Oct 14, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Its not easy to bring a beloved franchise with an almost completely new cast, but watching the first two episodes shows it hold great potential, even if it starts off a little slow. \nIn the first two episodes there are a few twists and the chemistry between most of the characters is sparkling - even if the dialogue is not quite there yet.\nLooking forward to seeing this grow. \nWell worth a watch.",
      "date": "Oct 14, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Feel in love with this show all over again. Excited to see where this show takes off.",
      "date": "Oct 13, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Dont listen to the critics. The show is fresh, creative, yet nostalgic. The new characters work into their roles perfectly. The plot is on point . I cant wait to see where they go going forward.\n\nTake into effect most of the \"expert opinions\" are sour because Kelsey Grammer's politics and religious beliefs \n\nThey are giving him the Chris Pratt treatment.",
      "date": "Oct 13, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Absolutely amazing! It's just great to have Frasier back! The show has reinvented itself!",
      "date": "Oct 13, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I loved it! I didn't have high expectations because of the character changes.  I loved the original Frasier series and this new series had me laughing out loud plenty of times. I hope it keeps going!",
      "date": "Oct 13, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I'm so happy with the first two episodes. They were of high quality and had a quick pace, and they made me laugh. Frasier is back in the building!\n\nThe character of Freddie needs more development, or maybe the actor's not quite right for the role. I have high praise for every other character. The guys in the fire department are funny with their mild peculiarities. \n\nThis is a series that will be a delight to follow.",
      "date": "Oct 13, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I LOVED the new Frasier.  Not sure what all the critics were watching.  Was it the same as the old Frasier? No!  Were there some things that were the same? Yes! It was the perfect mix of new and old!  Hope so see many more episodes!",
      "date": "Oct 13, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "I really don't get what the professional critics are missing. This show has plenty of potential and by the end of the second episode has already established a unique identity. This is the triumphant return of comfort television, something we really need now.",
      "date": "Oct 13, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Screw the critics and their short-sighted views, the new Frasier is a welcome return for one of TV's most iconic characters - and Kelsey Grammar, et al., do not disappoint.",
      "date": "Oct 13, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "This was a welcome third act. With TV shows today so trashy they are not worth watching. It was refreshing to watch something with a little class. No one gave the original much of a shot and then look what happened. I think with time the cast will gel more and  grow their chemistry.",
      "date": "Oct 13, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It has enough of the old feel coupled with new ideas to make for a fresh viewing. I laughed a fair bit and enjoyed the homage to the character of Martin Crane. I was sad that there were only two episodes at the premiere, but I'm just eager to see more. Glad it got another shot.",
      "date": "Oct 13, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "An excellent successor to the classic show. I was very worried seeing critic reviews but as per usual the critics reviews and opinions are clearly worthless.\nI found the jokes charming and the pacing decent, and I am looking forward to watching more.",
      "date": "Oct 13, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "If you enjoyed the original Frasier series then you will enjoy the reboot. The new characters are an amalgamation of the old characters. There's even a hint of Cheers thrown in!",
      "date": "Oct 13, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "From reading some of the critics, Many of them have been out of touch for awhile. \nWhile only 2 episodes have dropped at the time of writing, The dynamics between father and son start off a lil awkward (Just like in the original). But not as cringey as I found the nephew to be. Yet, It does have that Frashier charm. If written properly moving forward, This show has the potential of being really good. Maybe not like the original bc let's face it, You can do more in a 22-24 episode season vs a 10 episode season. Ijs",
      "date": "Oct 13, 2023",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "I loved it, the first two episodes were heart warming and funny. I really like the new cast and Kelsey Grammer is just as wonderful as ever. The show feels like inviting an old friend for a long overdue catch up. I'm really looking forward to seeing where they go with the show.",
      "date": "Oct 13, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I went into this show with low expectations, give. The quality of recent revivals of classic shows. The original Frasier is my favorite sitcom of all time, so I didn't want to see that memory tarnished. That being said I was delighted to be wrong. Kelsey Grammer is amazing as ever as Frasier. The supporting cast is strong with the possible exception of Frasier's nephew, who hopefully will have his character developed more in future episodes. The chemistry between Frasier and Freddy is instant and not forced. I certainly did not expect to cry during the first episode and yeah I found myself blubbering during their heart to heart towards the end of the episode. I can't wait for the rest of the season!!",
      "date": "Oct 13, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I enjoyed it completely. It was visiting an old friend 😀",
      "date": "Oct 13, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Unwatchable. Dry, stale, unfunny, and frankly mostly sad.\nIt was depressing to see a very elderly Grammer struggling to find his mojo.",
      "date": "Oct 13, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "I love this show.  It doesn't feel like a reboot, it is just like the next season of the original.  The best thing about it though is this show delivers laughs and heart and I never have to wonder about what will be onscreen when my kids walk into the room.  Here's hoping Martin left a certain \"eclectic\" recliner to his grandson.",
      "date": "Oct 13, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "If your not going to do it justice, then don't do it at all.  Its no wonder 'Niles & Daphne's' didn't return, this show is just embarrassing & pointless.  From episode 1 of the original Fraiser  (I've been watching sine I was 16, in 1993 but re-watched to make sure) the show has Energy & Comedy in excess, this remake lacks EVERYTHING that would make a good show, and without swift intervention will end production swiftly and be forgotten even sooner.\n\nEach & every character from Original Fraiser could quite easily have commanded their own show, they were strong & believable, even the Guest stars, they were perfectly cast & the actors delivered quality lines flawlessly, it made the show a hit that has lasted time.  The supporting characters of new Fraiser lack screen presence, energy & quite frankly talent, and although Fraiser revives his mannerisms well, again his character's energy has completely diapered too, leaving poorly written, unfunny lines being delivered flat on the floor, along with the show it's self. No one will ever look back on the series, and that sadden's me. \n\nIMO This show should have moved forward, not looked backwards, the whole premise was flawed from the beginning by creating a direction that constricted the writing in a certain direction, trying to recreate characters that emulated past. The idea of Fraiser become a successful TV personality was perfect, why did they not run with that, hosting his own talk show with a whole new direction to take, and new comedy to explore. oh well... at least I'm not being forced to watch it, I will simply pretend new Fraiser does not exist",
      "date": "Oct 13, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "So good to see Kelsey back as Frasier, as a long term fan of his character going back to his 1st appearance in Cheers in 1984 I couldn't wait to see where he was in his life. It's a new era, new characters but the same strong writing. Loved it, really looking forward to more.",
      "date": "Oct 13, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Don't listen to the critics, if you're a fan of the original series, you'll enjoy the reboot. I didn't have high expectations for this and my wife and I really enjoyed the first 2 episodes. Even with a new cast the show has the same feel as the original series.\nCheck it out!!",
      "date": "Oct 13, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Really enjoyed the first episode. I wasn't sure beforehand after seeing the trailers but exceeded my expectations",
      "date": "Oct 13, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "I loved the original and I was open to this new chapter. The first two episodes were very good. I decided to go into this with no expectations and It really surprised me. Same Frasier, different cast but very like-able. I enjoyed it and was surprised by how much I liked it.",
      "date": "Oct 13, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Light and fun, lots of good comedy. Not stale, just not new.",
      "date": "Oct 13, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Loving it so far! It really does capture the feel of the original. Very funny and entertaining! Here's another example of how critics don't know anything.",
      "date": "Oct 13, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Loved it! Stays true to the humor of the original series. Frasier is still the lovable snob that is oblivious to anything sports or pop culture. His heart of gold to help and love is still the same.",
      "date": "Oct 13, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I've only watched the first episode so far but I'm a super fan of Frasier so I'm totally biased. There were some corky parts, but some really good funny parts too. I loved the way the writers pretty much addressed all of our questions right away! Nothing will ever be as good as the original but so far I'm liking this spin off 👍🏾",
      "date": "Oct 13, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "7.9/10 Stars \n\nOn Frasier's 3rd go around the show still holds the wit, ironic situations, and great character development. Some dry moments but overall good.",
      "date": "Oct 13, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "After watching the reboot, I now understand why the cast from the old series passed on this reboot. No Niles, Roz, Daphne or Eddie = watch something else.",
      "date": "Oct 13, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "The thing is, John Mahoney is irreplaceable. David Hyde Pierce is irreplaceable. It would be foolish to even try! But this reboot DOES try, and it just doesn't work. Kelsey Grammer is as good as ever, and he's doing his damnedest to make the show worth watching, but the problem is he's surrounded by an ensemble of cardboard cutouts. That's not to say that they're bad actors (although they're not great), but they're stuck playing characters that are just cheap knock-offs of the original series. Freddie's development from precocious goth teenager into \"Martin 2.0\" feels particularly forced and contrived. IF the series gets renewed (and I wouldn't be surprised if it didn't), I hope they make some major changes to right the ship, although I'm not sure any amount of \"retooling\" is enough to save a series with bones as bad as these: after all, how do you tell a new story when you've set yourself up to just tell the old one again? It's not horrible, there are some moments that are genuinely quite funny, but that's not enough to save this reboot from feeling derivative and uninspired.",
      "date": "Oct 13, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "First show was a classic, you can see right away the reboot has no shot but nice to meet up with an old familiar face and who doesn't love scrambled eggs 🙂\n\nThe old English guy does NOT grow on you I have to ffw Everytime he's on screen 😢.\n\nFake Freddie is no prize either 😢.",
      "date": "Oct 13, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Frazier was and still is one of my top three favorite TV shows ever. I literally put it on every night and that's how I go to sleep. Yes I have seen the entire series at least seven times, or at least the first 15 minutes until I fall asleep. Haha.\nSo you can imagine how excited I was for the reboot. Before the first commercial hit on Paramount Plus, I knew it was doomed. I struggled to get through the first episode and was walking away when the only good part of the show was the farewell to John Mahoney AKA Martin Crane. I'm not even going to bother with the second episode.\nClearly Niles and Daphne saw the pending doom and that's probably why they wanted nothing to do with it. So sad because I was so excited.  Definitely the top three stupidest shows I've ever seen. 😔",
      "date": "Oct 13, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I was so pleasantly surprised by the first two episodes of the new series of Frasier. Kelsey Grammer flawlessly stepped back into character and the surprising cast around him is amazing as well. I was so skeptical about how Freddie possibly grew into this macho like fire fighter character, but after realizing how much he idolized his grandfather and the close bond the characters shared in the original series, it completely made sense. Nicholas Lyndhurst is going to become the best part of this show. Only time will tell when.",
      "date": "Oct 13, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I feel like if you're really a Frasier fan, you'll like it. It's not the original Frasier and it never will be, but I still thought it was pretty great. I think Alan, his colleague is pretty funny. Freddy is great too. There are some moments that are kinda cheesey but overall, it was funny. I think everyone needs to calm down.",
      "date": "Oct 13, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "I loved how Kelsey Grammer smoothly transitioned into a little older, but still the same, Frasier! I was worried the reboot would be dull without other supporting characters or lack the usual Frasier charm. But no, the whole cast did amazing! I felt like no time had passed, and I just continued watching the original series. I hope we will see Roz, Niles, Daphne, Lilith, and Bulldog, of course. But so far, the show is wonderful! And what a heartwarming tribute to John Mahoney!",
      "date": "Oct 13, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It was an excellent, two series introduction. Kelsey Grammer stepped directly into this new version of Frasier. I have high hopes for all of the new characters. I especially liked the facility, college characters and his son.",
      "date": "Oct 13, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "First off let me start by saying that I am a die hard Frasier fan. I rewatch the original 11 seasons every single day, and I'm not exaggerating. I watch them during my free time, and to help put me to sleep because Frasier relaxes me. I was so excited, and also scared of this new reboot, but overall thankful that we all finally got new episodes! They did not disappoint!! Is it exactly the same as the original? Of course not. The entire cast is different aside from frasier, and he's now living in Boston. Do not go into this thinking you are getting the exact same show. It is however, still hilarious, witty, and pays homage to the original and its characters. I laughed, I cried (well blubbered) and I felt at home again. I am so unbelievably happy with this re boot and it better stay on the air. If you love frasier just as much as I do then you will be ecstatic about this new season.",
      "date": "Oct 13, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The reboot of Frasier is a is a blend of old charm and new humor. Kelsey Grammer shines as ever, effortlessly reprising his iconic role, showcasing impeccable comedic timing that feels both refreshing and nostalgically comforting. The show navigates new comedic terrains while paying a heartfelt tribute to the original narrative. It's an enjoyable ride through sophisticated humor and tender moments, making the Frasier reboot a delightful watch in these turbulent times. Through witty dialogues and fresh scenarios, this reboot serves as a perfect homage to a beloved classic, proving that good comedy is indeed timeless.",
      "date": "Oct 13, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I loved it. The new characters fit nicely and it has the same charm as the original. AND....It's funny!!!",
      "date": "Oct 13, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I really enjoyed the first two shows and am excited to watch the entire season.  I loved the old Frasier and it's fun to see what is happening now in his life!",
      "date": "Oct 13, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "If you can't do better or even at the same level as the first why do it? This show is boring and depressing. The original had a warmth from the 90s and a perfect cast. Why do we need to remake everything. Other than Frasier himself this is not the same show. In the original you could enjoy the antics of Frasier with his father, brother, and Daphne. I understand that this show is trying to be fresh, but it constantly reminds you of its predecessor. The laugh track is also so insufferable. The new characters are so flat, They are just boring. There is so much more things I could say about this show including the location. Seattle was where Frasier belonged.",
      "date": "Oct 13, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "What a delight! It's not \"perfect\" television, but it sure feels like a natural extension of the original series, even with limited returning characters. Alan Cornwall comes off almost as a character that could have been on the original sitcom and you just somehow forgot about him. It is very satisfying to see Frasier back!",
      "date": "Oct 13, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I agree with another reviewer, \"Ignore the cranky professionals\".  I found the writing, direction, comedic timing, editing and, in most cases, the acting to be excellent.  I pity the actor positioned to portray Niles' son.  Few could compare favorably with David Hyde Pierce.  Should there be more seasons (never assume), I hope Pierce re-considers.\n\nI worry about older comedic actors returning to find they had lost their comedic timing, but Kelsey Grammer still very much has his.  I think it's a great show.  The network will probably cancel it ;-)",
      "date": "Oct 13, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Long time Frasier fan from the very beginning. I went into this reboot with A LOT of scrutiny. As one of Frasier's biggest fans (obviously self-proclaimed) I have big expectations and I have no desire to support a reboot of my favorite show ever unless it's actually well done and true to form. I was not disappointed! It started off slow and took some time to hook me but it felt just as fun, silly, and dry in a good way as the original with enough variation to feel new. No it's not exactly the same but the point of a reboot is to refresh and revitalize an old standard and I think they've done that here. I can't wait for more episodes and I hope they continue to deliver what the fans want.",
      "date": "Oct 12, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I've been a fan of Frasier most of my life since it first premiered. I was worried with most of the cast not returning that it may not to live up to the original. While I reminded myself that the original frasier didn't have any of the previous cast members of cheers on as the main cast either (outside of Frasier) I was both excited and apprehensive about this remake. Long story short, the 2 episodes thus far have bested my expectations and have been a joy to watch. If you're looking for the Frasier nostalgia, this hits home.",
      "date": "Oct 12, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "the supporting cast is the problem with this reboot.",
      "date": "Oct 12, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "They lost me as soon as I leard the laugh track.",
      "date": "Oct 12, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "It almost feels like Frasier is still listening and never left.  This was a charming start to what I bet will be a great season.  It had the smart quick whit of old and lots of feels.  If you don't shed a tear while watching the first episode then you're a heartless troll. I can't wait to see more.",
      "date": "Oct 12, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "I thought the reboot was funny, and had a few good calls backs.  Was it great, no but I seem to remember the original needed a few episodes to find it's footing so I'm in for the rest of the season.  With all the crap on TV these days, if it just stays the same as the first episode it will be good enough for me.",
      "date": "Oct 12, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Glad to see Frazier back and it's good to see new faces! I also enjoy the callbacks to Cheers and the original show. Can't wait to see more episodes.",
      "date": "Oct 12, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Hilarious!!!! Frasier himself is just as funny as ever. The original series is one of the 10 best sitcom of all time, hands down, period! It's almost impossible to beat. \nThis new series, if it was called anything else (alway being compared to the original series) would be an instant hit!!! \nHowever, this new cast is hilarious and Frasier hasn't lost a step. I hope we have a nice long run ahead of us!",
      "date": "Oct 12, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Don't listen to the critics. If you are a fan of the original, I think you will enjoy this quite a bit.",
      "date": "Oct 12, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Ignore the cranky professional critics. It's charming, funny, well-written and well-cast. I think had those critics who are loftily panning it seen this version before they saw the old \"Frasier,\" they would have been wetting their pants to praise it.",
      "date": "Oct 12, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "What can  I say?  Sorry, nothing\nWe didn't laugh once",
      "date": "Oct 12, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I am very optimistic about seeing Frasier in his golden years. The cast is great- Kelsey is amazing as usual. And I especially like Olivia and David.",
      "date": "Oct 12, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "While it can never rise to the perfection that is the original, you can't help but adore Grammar's performance as Fraiser - it feels fresh and new but with all the nostalgia. Sitcoms are back!",
      "date": "Oct 12, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "I don't agree with the critics - I love this character and am glad to have him back. I think as the show progresses the characters will grow in their roles and the show will find its own place - instead of being compared to the original.",
      "date": "Oct 12, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I had the privilege of seeing all 10 episodes as member of the studio audience and I must say that Kelsey and many of the people who were involved in the original run (like casting director Jeff Greenberg) did a marvelous job making this new revival seem like we discover Frasier Crane 20 years later. The cast, writing and quality honor the reputation of television's most honored comedy. Bravo!",
      "date": "Oct 12, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "9/10 Based on first two episodes. Loved it!! Frasier is back and it brought all the feels.  I was prepared for the worst based on the trailer and taken by surprise how good it was. Just a few minutes in and I was already slapping my knees.  Excited for more!",
      "date": "Oct 12, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is brilliant! Despite not having original cast, this has the feels to it! It's funny! It's emotional. It does a fantastic send off to Martin! I think it's amazing and Nicholas Lyndhurst has smashed it once again!",
      "date": "Oct 12, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Huge life-long Frasier fan here...The first 3 episodes of the new reboot felt a little shaky, even cringey at times. The character development had to get the basics out of the way at first I suppose. But with each episode it has gotten better and better.  Episode 4 was just hilarious with David (Niles & Daphne's son) being mistaken for an orphan at the fire dept   Episode 5 feels just like \"old\" Frasier in the best possible ways and we belly laughed throughout the episode. It's pretty remarkable that he (Kelsey) can still channel the character and still be as funny as he ever was. Some ask if this needed to be made... And I think you can say that about hundreds of shows these days, but this one is a gem and deserved a shot at a revival.  So happy they did.  I think they are hitting the stride.  Lovin' it!",
      "date": "Oct 12, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I am so glad the show is back! It's a perfect combination of smart comedy that's witty and fun with heart and the  importance of barging into each other's lives every once in a while, because we actually need that. \nWe needed this.",
      "date": "Oct 12, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I really enjoyed this. Maybe I'm old school, but it was just nice to watch, like an old episode of Cheers. The writing was solid, performances great, chemistry great. Just well done. My only complaint is that the season is only 10 episodes. 26 would be much nicer.",
      "date": "Oct 12, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Much better than what was in the teaser/trailer. It's funny and full of heart. Love Frasier!",
      "date": "Oct 12, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "First episode was a little rough but the second was much better. Great to have you back Dr. Crane!",
      "date": "Oct 12, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Kelsey Grammer effortlessly returns life to a beloved character. For fans of the original show it is a welcome return of a beloved friend in new surroundings.",
      "date": "Oct 12, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    }
  ]
}