{
  "avatar_the_last_airbender": [
    {
      "review": "Another great season, very action packed and just overall very good. Final battle scene is peak",
      "date": "May 14, 2024",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "This season in special is the bets, more for the fights, but also th serie for it own its better",
      "date": "May 9, 2024",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "For a kids show in 2005 this show is a absolute banger in 2024",
      "date": "Apr 30, 2024",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Una verdadera obra maestra, la empezé a ver en 2024 y sin lugar a duda es una de las mejores series de la historia. La evolución de los personajes la historia y la acción es un 10. La evolucion de zuko la dualidad del bien y del mal la madurez de aang para afrontar la batalla final. La compasión de Katara la lucha de thof y el liderazgo de zokka hacen de esta serie la mejor",
      "date": "Apr 29, 2024",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "For me this is the best season of the show, even though I absolutely loved book 1 and 2, book 3 changed my perspective of a lot of things, also Zuko’s character development is so powerful and wonderful and the ending was just perfect for this amazing journey of transformation, not only for the characters but also for me.",
      "date": "Apr 27, 2024",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "What else is there to say? One of the greatest shows of all time. Period.",
      "date": "Apr 24, 2024",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "season 3 is the most intense and unpredictable season of the show. truly a perfect way to end a masterpiece of a show. that continues to prove that it can not be done again.",
      "date": "Apr 19, 2024",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Perfect in every aspect of each episode, overall perfection",
      "date": "Apr 17, 2024",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "A epic and emotional ending to the greatest tv show ever made book three fire just wonderfully made",
      "date": "Apr 14, 2024",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "This season is mind blowing. Absolutely masterful production of an appropriately climactic finale. The overarching story lines are completed and in the most beautiful way. No other show I have ever seen does such a fantastic job at using subtle details and backstories to later tie them in and add depth and intensity to the main story. The character of Zuko might well be the most brilliantly conceived and executed cartoon character of all time. He had so much depth and development. His story will have you crying and going from laughing at and hating him to rooting for him as if he was a real person; a close friend. The ending will leave you with a euphoric feeling that soon fades to tragic emptiness,  just craving more. Avatar: The Last Airbender is truly one of the most beautiful stories I have ever seen put to film and without a doubt the best I have seen adapted for television. I don’t use this word lightly but this show is a masterpiece. The only bad thing about this show is that you can only watch it for the first time once.",
      "date": "Apr 10, 2024",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "The greatest finale to ever be put on the small screen",
      "date": "Mar 21, 2024",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Really good Show. Good rythm, good story, good characters and personalities.",
      "date": "Mar 3, 2024",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "This is in my opinion the greatest finale any show ever had to this day. The animation, the writing, everything is just perfect.",
      "date": "Feb 28, 2024",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "A master class of television. This stands with the greatest shows ever made. The character arcs alone set this show above so many others.",
      "date": "Feb 23, 2024",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "This is peak animation , peak storytelling we'll probably see in an animated series for a really long time. All 3 seasons are a masterpiece",
      "date": "Feb 23, 2024",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "It manages to retain the descriptor of \"perfect\" despite a lackluster deus ex machina that undercuts the central moral quandary of the series finale.",
      "date": "Feb 23, 2024",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Very satisfying end to the story. However I would have liked to see what happend to some of the characters after the story ended, as we are left with quite a few questions. Still a great season in one of the best series I have watched.",
      "date": "Feb 20, 2024",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "The best ending to a show like this. Speechless",
      "date": "Feb 19, 2024",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "GALACTIC SLAY. \n\nmy favorite ever.",
      "date": "Jan 3, 2024",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Season 3 keeps the high level and after the massive build up over 3 seasons actually delivers one of the best series finales ever.",
      "date": "Dec 28, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Best TV show in history",
      "date": "Dec 26, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Wow! What an incredible TV show! This is actually the most successful TV show Nickelodeon has ever created. It has now become my favorite TV show ever! I really appreciate how this TV show focuses on bringing people together rather than resorting to conflict. There are many powerful messages in the show, but the primary one is the importance of the four elements—Water, Earth, Fire, and Air—for our planet's survival. \n\nI was particularly captivated by Jack De Sena's portrayal of Sokka. Sokka, a 15-year-old, is my favorite character. He is remarkably witty, often coming up with brilliant ideas that turn out to be quite humorous. Additionally, he is a skilled warrior and encourages his friends to strive for what is right.\n\nI also found Zach Tyler Eisen's performance as Aang to be highly engaging. Aang, a 12-year-old, is enthusiastic about exploring the world and displays compassion towards his friends during their adventures. He also has a lighthearted side and prefers to unite rather than fight, always prioritizing others over himself.\n\nMae Whitman's portrayal of Katara also intrigued and captivated me. Katara, aged 14, is very caring towards her friends but can be assertive when they don't listen to her. She is nurturing and resolute in the face of danger, standing up against injustice and cruelty.\n\nMichaela Jill Murphy's performance as Toph Beifong was equally intriguing and energetic. Toph, also 12, is sarcastic and direct, occasionally displaying bossiness. However, she is compassionate and resolute when it comes to standing up against injustice.\n\nDante Basco's portrayal of Zuko was also quite intriguing, fascinating, and compassionate. Zuko, aged 16, is intelligent and wise, aiding his friends in resolving conflicts and protecting them.\n\nWhat I particularly admire about this outstanding TV show is its focus on the significance of the four elements in the world. Water symbolizes flow, creativity, and the act of bringing things into existence. Earth represents the maintenance of land, mindset, and space. Fire embodies strength, energy, and decisive action. Air signifies life-force, trust, beliefs, and determination.\n\nAnother aspect I love about this TV show is its portrayal of how a group of exceptional kids can make a difference in the world by believing in themselves. This truly encourages both me and the audience, emphasizing the power of kids to effect positive change by believing in themselves.\n\nI extend my heartfelt gratitude to Michael Dante DiMartino, Bryan Konietzko, and the entire Nickelodeon Studios for creating this remarkable TV show. It is filled with themes of trust, forgiveness, empowerment, fate, destiny, and desire. I sincerely hope that more movies and TV shows with profound societal messages that bring people together and shed light on overlooked stories will continue to be produced.",
      "date": "Dec 26, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "A continuation of the excellence found in the first two seasons and ups the game even more. Character arcs conclude and mesh so wonderfully. To this day the the best finale in all of TV, animation or not.  I gave it five stars on a technicality, I was unable to give it 100.",
      "date": "Dec 9, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Kocham i polecam mega to anime",
      "date": "Nov 22, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Gosh more stuff to do",
      "date": "Oct 9, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "This is so fantastic",
      "date": "Sep 19, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "This is a masterpiece",
      "date": "Sep 6, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "This is a masterpiece",
      "date": "Sep 6, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Brilliant animated series. 10/10",
      "date": "Sep 2, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "The conclusion to this tv trilogy is epic and SO MUCH FUN TO WATCH!",
      "date": "Aug 15, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "A great continuation that completes the story and the arcs on a perfect note. \nPerfect finale for a lengedary series.",
      "date": "Aug 8, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "My favourite season that overall ties everything together. One of my favourite shows<3",
      "date": "Jul 29, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "If you liked this you should watch 'the dragon prince', it's great!",
      "date": "Jul 27, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "AtLA is basically as close to a perfect show as I can think of. Everything it sets out to do, it does with love. The humor is actually pretty good and can provide a nice cushion to the whole evil-tyrant-is-trying-to-take-over-the-world thing. The characters develop in heartfelt, believable, creative ways. The series ends with one of the best wrap-ups of any finale, bringing a logical, emotional and satisfying arc to a close for all major characters. I only passively watched this show on Nick as a kid here and there. Sitting down with it as an adult, I was blown away by the music, themes, colors, characters, worldbuilding, and Avatar's commitment to tell its story and then not stick around for extra cash.",
      "date": "Jul 20, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "I gave it six stars for being such a fantastic show, but took a star away because the show ended. Five stars, that's my final rating.",
      "date": "Jul 11, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "A final season so perfect that I don't even need a continuation.",
      "date": "Jul 8, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "The last season of Avatar brings to a thrilling end the adventures of the kids, who really aren't kids anymore. Their stories are complete. What a ride these three seasons are.",
      "date": "Jul 2, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Increible serie, atemporal. gran desarrollo de personajes, creación de universo y en general mi favorita",
      "date": "Jun 5, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "It's amazing, I doubt the Live Action will live up to the OG animation, let's see.",
      "date": "May 28, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Although season 2 is technically better, season 3 is amazing. It suffers from less Iroh.",
      "date": "May 24, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "This show is beautifully written from beginning to end. High watch and rewatch value especially in season 3!",
      "date": "Apr 28, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Season 3 of Avatar is the best one yet. Ana amazing build up to one of the best series finale's ever and the character arcs and plot is concluded in a very profound way.",
      "date": "Apr 20, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Greatest tv series I have ever watched and rewatched. I watched it as a kid growing up and enjoyed it a lot. Then during my teenage years, I rewatched it with my sister and my parents. Lately, I rewatched it at university with my Uni friends. Each time I appreciated a completely different aspect of the show. It is utter perfection in world-building, character development and the telling of a good story. All can appreciate the show regardless of age or gender or race. It is the epitome of storytelling.",
      "date": "Apr 10, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "I love the way it portrays the characters and humanizes even those who are in the wrong. I cannot name a single poorly-developed character. I could go on and on about how I admire it's philosophical and spiritual foundation. It encourages the pursuit of learning and living by truth, and it teaches that all life is sacred. I love how it takes the highlights of cultures and histories around the world and brings them together in a unified story of understanding. At the plot's climax, it teaches the importance of justice through non-violence. Throughout the story it shows the blessings of working hard enough to become a master while still maintaining a child-like spirit.",
      "date": "Mar 11, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "One of the greatest animated series ever made; it's perfectly acted, immaculately animated, the world-building is amazing, the characters are timeless and the story and themes are very mature while also being funny and exciting. The action is also extremely well done and intense.",
      "date": "Feb 9, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Still my favorite animated show ever",
      "date": "Feb 1, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "A must watch for absolutely anyone! Characters, story, worldbuilding.. everything is 10/10!",
      "date": "Jan 19, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "a masterpiece of media, truly",
      "date": "Jan 17, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "greatest show of all time",
      "date": "Jan 12, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Uncle Iroh is my daddy",
      "date": "Dec 19, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Incredibly creative, excellent character arcs, meaningful conflict in story and characters themselves, likable characters, some good fight scenes. General Iro is very well written. Surprisingly sophisticated for a kids show.",
      "date": "Dec 15, 2022",
      "rating": 4.5,
      "episode info": "Season 3"
    },
    {
      "review": "Again nothing more to say a 10/10 show ^^",
      "date": "Dec 4, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "It is a amazing series and i really recommend it, they story and characters are amazing",
      "date": "Nov 19, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Its alright, can't say I enjoyed it, due to some poor animation quality and annoying dialogue. And was't to fond of the main characters, especially Aang, who found to be the least interesting character out of them all. And I hated Sokka, a really annoying character.",
      "date": "Nov 19, 2022",
      "rating": 2.5,
      "episode info": "Season 3"
    },
    {
      "review": "This is the GOAT period!",
      "date": "Oct 23, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Favorite show of all time!!!!!!! Not only the nostalgia I have for it but the development of so many characters and storylines for a 2005 show was so under rated. This show is a huge influence on my life to this day and eventually I will enjoy it with my kids.",
      "date": "Oct 4, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "La temporada que le da el cierre a esta maravillosa joya de la animación, todo es perfecto en esta ultima temporada y nada sobra.",
      "date": "Oct 1, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "when an animated show ticks all the boxes,  i would call it perfection, everything about this show feels right, the characters, the story, the music, the way it has been animated, the voice acting ( especially azula, you can hear azulas mean and vile character through the voice of grey delisle-griffin), the world building, i cried when i saw 1. leave from the vine. and 2. the battle between azula and zuko... i have never seen a battle that evokes so much emotion...",
      "date": "Sep 30, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "What an amazing show, I dont even think I can say something about it its just Incredible.",
      "date": "Sep 13, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Amazing show!!!! A must watch I watched it 3 times and im now watching it for the fourth and im still not bored when you watch it again you can see stuff you didnt see before",
      "date": "Aug 31, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Simply an incredible piece of television for people of any age.",
      "date": "Aug 25, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "An absolute masterpiece of a television show. Everything that makes a great television show, Avatar: The Last Airbender has. Story, writing, characters, character relationships, character development, character arcs, music, graphics, and a perfect balance between maturity and humor.",
      "date": "Aug 21, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Season Score: 89% |Ratings by Episode | {EP1: 9/10, EP2: 10/10, EP3: 8.5/10, EP4: 8.5/10, EP5: 8/10, EP6: 10/10, EP7: 8/10, EP8: 8.5/10, EP9: 7/10, EP10: 9/10, EP11: 8/10, EP12: 10/10, EP13: 10/10, EP14: 10/10, EP15: 8/10, EP16: 10/10}/ 16 Episodes = 89%",
      "date": "Aug 18, 2022",
      "rating": 4.5,
      "episode info": "Season 3"
    },
    {
      "review": "Flawless show. Zuko has the best character arc of all time.",
      "date": "Aug 17, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "You know a series was good when the credits of the final episode make you feel heartbroken.",
      "date": "Aug 13, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Best conclusion to one of the best written stories in history",
      "date": "Aug 7, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "How a \"kids show\" can implement war, character development, treason, political systems and love into one epic finale? See for yourself!",
      "date": "Jul 17, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "This is a show for children, yet it is far more mature than many shows for adults.\nAlso, even though this show plays in a fictional world with fictional physics, it feels really realistic.",
      "date": "Jul 5, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "This is overall a pretty amazing show. I did feel the ending was a bit of a letdown though",
      "date": "Jul 1, 2022",
      "rating": 4.5,
      "episode info": "Season 3"
    },
    {
      "review": "We never got the Zuko and Toph journey. The time spend with Zuko felt really short but that also proved how little time until the comment.",
      "date": "Jun 6, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "I mean, it's the best at what it does ;D",
      "date": "Jun 2, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "This is my opinion for the best show ever.",
      "date": "Jun 1, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "A wonderful season that is as close to perfection as can be ... and Zukowoo",
      "date": "May 19, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "99% audience score seems low tbh",
      "date": "May 17, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Absolute masterpiece. Probably the greatest show I have ever seen. Perfect balance of wisdom, humor, action, adventure, character development, plot, drama, and romance. Have watched the entire series multiple times. Still holds up.",
      "date": "May 10, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "A very patiently buildup and insanely well executed season, as well as climax. The episodic formula with an overall sense progression is basically perfected here, with some nice unpredictable elements as well. The season is both funny and dark, the action is great, and it has a super entertaining and emotionally resonant finale – truly a modern legend. Rating: 99",
      "date": "May 8, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Can a show be perfect? This masterpiece is one of the closest things to it! Team Avatar was fun, meaningful, and engaging the entire time. Such a bittersweet thing to finish this series. Can't wait to re-watch!",
      "date": "May 6, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Avatar the last blender",
      "date": "May 5, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "This is not a kids' show. Well, yes it is, but its underlying themes, philosophies, and arcs push for adults to be just as invested in it as a child would be.",
      "date": "Apr 22, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Best of the best! Number 1!",
      "date": "Apr 19, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "As a whole it is the best TV show I have ever seen, great for the kids because of it's quirky jokes and important themes, but still entertaining for the adults because of the great story. The format of the show is flawless; individual episodes dealing with small conflicts and developing characters that will tie into the whole plot itself all to be perfectly summed up in a 4-part finale. Book: 3 features the best \"bad guy turned good\" anyone has ever seen and has a killer finale where the main characters get to face their conflicts. Incredible TV show for any viewer and don't let the fact that it is an anime deter you.",
      "date": "Apr 19, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Perfect ending to the perfect series! The character arcs all have such satisfying endings. On rewatching this show I can see so much more that I missed before and now watching it with my brother adds so much more excitement to the experience. I definitely recommend buddy-watching! ATLA isn't just some overhyped kids anime show like I'd been led to believe for so long, it has more emotional depth and character than any \"adult\" show I've ever seen! This series is a must watch for all ages!",
      "date": "Feb 27, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "One of the best series I've ever watched and, being in my twenties, I'm not even the target audience. This series certainly lived up to its reputation! I can't believe I missed out on watching this as a kid. I have just finished watching the final episode and am genuinely sad the ride is over. Would definitely recommend.",
      "date": "Feb 9, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "An amazing end to one of the best shows made in the past 20 years. Avatar holds a special place in my heart, and I can always come back to it knowing it won't disappoint.",
      "date": "Jan 11, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "The finale season of an epic children's cartoon series that proved that \"family friendly\" did not have to mean derivative or trite. If there's anything to criticize, it's a few specific episodes that take questionable steps, but nothing too dramatic.",
      "date": "Jan 2, 2022",
      "rating": 4.5,
      "episode info": "Season 3"
    },
    {
      "review": "Definition of perfect.",
      "date": "Jan 1, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Words cannot describe how great Book 3 is. The story of Zuko is absolutely flawless. Sozin's Comet is the perfect 4-part ending of this perfect series. Avatar: The Last Airbender is a perfect show for children (because it has funny moments and cool fight scenes) and adults (because of the story). This show is a must watch for fans of fantasy.",
      "date": "Dec 17, 2021",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Book 3: Fire is an AMAZING last season of one of the greatest cartoons, nay, one of the greatest TV shows ever made! Every season got better and this is is the apex, by far!\nThe characters are better and more developed than they've ever been, in terms of size, scale, and stakes the story has never been bigger, the animation, music, comedy, everything is at its peak in this last season, and it all results in one of, if not, the most satisfying series ending ever made!\nAvatar is one of the best shows ever made, and in my opinion, most of that praise is because of how unbelievable this final season is!",
      "date": "Nov 14, 2021",
      "rating": 4.0,
      "episode info": "Season 3"
    },
    {
      "review": "I would not watch again, but for anime, it works. The jokes are very childish which is understandable but frankly I wish I hadn't watched.",
      "date": "Nov 4, 2021",
      "rating": 2.5,
      "episode info": "Season 3"
    },
    {
      "review": "I appreciate how they show the lives of ordinary Fire Nation citizens, it fleshes out the world in a nice way.  The action scenes continue to be fantastic.  The story is a tad weaker than Season 2, but it's a fantastic ending to the franchise.",
      "date": "Oct 21, 2021",
      "rating": 4.5,
      "episode info": "Season 3"
    },
    {
      "review": "Me encantó la historia, los personajes y los chistes tanto que la volví a ver en compañía de mi padre, un par de adultos disfrutando de una serie infantil. Lo único que no me gustó y por lo que no le pongo las 5 estrellas son sus desarrollos románticos, a excepción de Sokka/Suki, están mal construidos, claramente basados en fantasías masculinas infantiles o en ocasiones simplemente parecen sacados de la nada, haciendo uso del poder del guión.\nAún así es totalmente recomendable y una de las mejores series que he visto.",
      "date": "Oct 8, 2021",
      "rating": 4.5,
      "episode info": "Season 3"
    },
    {
      "review": "This show shows an incredible and well thought world building, with unimaginable creatures, nations, spirits, and the most notable thing throughout the series: their fight form, also known as Bending. Bending is a form of art where you are allowed to manipulate certain elements (water, air, fire and earth), not everyone is a bender, those who don't have that ability are known as non- benders.\nWorld building is not the only thing worth gushing about. The character development and complexity of said characters are amazingly done. Where we feel sympathy even for the villain, where we see the different traumas of the characters and them working to overcome the effects that war did to them. They overcome fears, make friends, partner, emotional bonds, etc…\nThis show is… wow amazing *chefs kiss* I highly recommend it. 10/10. The finale was incredible love it",
      "date": "Sep 22, 2021",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Greatest TV series of all time!  Incredible character development and wow! - What an ending!",
      "date": "Sep 8, 2021",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Loved the ending to the show.",
      "date": "Jul 19, 2021",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "One of the greatest finales of all time, and like everyone says, Zuko has probably one of or THE best character arc ever.",
      "date": "May 23, 2021",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "This season had a lot riding on it with all the build-up the previous two seasons provided, there are each character's personal stories that need to be wrapped up as well as the overall story. With that said this season is my favorite of the three, to be able to pay off something that had that much build-up is nothing short of impressive! This season was is epic that it basically has two finales, this was the perfect conclusion to this vast, epic, and addictive show. There is one tiny gripe I have to say about this season and that is that they failed to deliver on the build-up to Zuko's mother, but aside from that, this season is so good that they even were able to make a recap episode creative and entertaining. I remember when this season was released and watching each new episode with my father, then anxiously awaiting next week's episode. I love this show so much that I had to go out and buy the DVD box set when it came out, I really miss the world of Avatar and hope we get to revisit its fascinating world again soon. What an incredible series!",
      "date": "May 19, 2021",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "What's not to love about The Last Airbender?",
      "date": "May 9, 2021",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "amazing show, characters, everything!",
      "date": "Apr 13, 2021",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "(Series) An absolute gem and one of the greatest T.V. shows ever made.  Great writing, character moments, and engaging from beginning to end.  Masterpiece.",
      "date": "Apr 1, 2021",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "this is how to end a seris.",
      "date": "Mar 17, 2021",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "What a great finale this is my favourite season, from the entire show. It even has my favourite season finale, of all time.",
      "date": "Mar 12, 2021",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "My favorite season of a fantastic beautifully done children's show. This show manages to balance a story, character development, and childish humor perfectly. This season manages to fulfill some of the best character arcs of any show while building up to a satisfying ending.",
      "date": "Mar 7, 2021",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "This was an AWESOME show! I love the storyboard the animation the comedy the drama I can't believe this was on nickelodeon! It's really amazing definitely recommend it!",
      "date": "Feb 26, 2021",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "This show is possibly one of the greatest ever. I can't even explain how AMAZING this show was. It's perfection. Azula was my gay awakening, and oh my god this show. Watch it.",
      "date": "Feb 21, 2021",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Um história muito bem feita, respeitam o desenvolvimento dos personagens, como também o caminhar da história. Deveriam existir mais series como essa.",
      "date": "Feb 20, 2021",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "There aren't many shows with a good ending. This ending will definitely not disappoint. Just watch it all already!",
      "date": "Feb 6, 2021",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "my favorite american cartoon bar none",
      "date": "Feb 3, 2021",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "WOW. What an epic ending to the best show of all time. I am not an easy person to impress by any means, but holy shit was this show amazing. Do yourself a favour and watch it.",
      "date": "Jan 31, 2021",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "An epic ending to this beloved saga. <3",
      "date": "Jan 23, 2021",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Must watch tv for all ages. My favorite season of one of my all-time favorite shows.",
      "date": "Jan 13, 2021",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "HOLY FRIK!! Perfection at it's best! This is one of the only tv shows in current existence that actually manages to maintain it's quality in story, character, and animation throughout it's run. Admittedly, I feel like the finale conflict between Aang and Mark Hamill could have been a bit more top of the line, but still I whole heartedly give this show 11 out of 10. If you haven't seen it, quit reading this and go watch it! 8{D",
      "date": "Jan 12, 2021",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "just flat out perfect",
      "date": "Jan 8, 2021",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "The single greatest cartoon series of all time",
      "date": "Jan 7, 2021",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Absolutely Perfect!!",
      "date": "Jan 6, 2021",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "This season is the word \"iconic\" personified.",
      "date": "Jan 1, 2021",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Whoever gave this show anything less than 5 stars has absolutely zero taste and their opinion should be automatically invalidated. This may be the greatest animated series of all time. Period. My only regret is that I discovered it relatively recently. People have been telling me for years how great this show is, and the show still surpassed every expectation. Plus, Dave Filoni was a key force in season 1!!! Of course he was. Best show ever!!!!!!!\n\nPS: I will be fair and say the beginning part of S3 had the weakest episodes in the whole series, but the home stretch of S3 is the absolute strongest. Again, shades of grey here, it's a perfect series",
      "date": "Jan 1, 2021",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "AVATAR THE LAST AIRBENDER really is a little masterpiece of an animated TV series. It has all the right mix of friendship, philosophy, action and style. As a fantasy series, it manages to nab that feeling of timelessness - as relevant today as when it was released.",
      "date": "Dec 23, 2020",
      "rating": 4.0,
      "episode info": "Season 3"
    },
    {
      "review": "A very satisfying final season. The show more deeply unpacks themes of the series, while still integrating its classic humor.",
      "date": "Nov 26, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Nothing really happened. No consequences. Aang is truly a gary stu.",
      "date": "Nov 23, 2020",
      "rating": 0.5,
      "episode info": "Season 3"
    },
    {
      "review": "Avatar Avatar Avatar. When I was a little kid I saw the series and I really liked it but 6 years passed and it was still in the media so I started to sit down and start watching the series and wow it is simply amazing it is for both kids and adults and teens. And you simply after the series want to be grounded or air or water and it's unbelievable everything I say is true for season 1 2 and 3 as well\n\n\n\nThis is amazing",
      "date": "Nov 16, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Avatar: The Last Airbender Season 3 is full of jokes and incredible fight scene, making for a smashing final season.",
      "date": "Nov 9, 2020",
      "rating": 4.5,
      "episode info": "Season 3"
    },
    {
      "review": "This show stuck the landing! All the characterization and build-up paid off, the fights are spectacularly animated, and it managed to give everyone a huge emotional payoff. I still miss this show 12 years after it finished airing. I'm still talking about this incredible show, and its legacy. It's nice to see how much this show meant to so many other people too.",
      "date": "Nov 9, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "best nickelodeon of show of all time and S3 cements that title.",
      "date": "Oct 29, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "A perfect finale to a practically perfect show. I loved nearly every second.",
      "date": "Oct 27, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "its a great show. The animation is good, its well written and the soundtracks are great. It has really good character development . I recomend watching it",
      "date": "Oct 13, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Absolutely amazing. Nearly everything is leveled up over Book 2 (I still like Book 2 better because Book 3 is missing the best part of the show). That said, this season has by far the best episode selection. Six of my ten favorite episodes are from Book 3. Episodes like Sozin's Comet, The Southern Raiders, Day of Black Sun, Sokka's Master, The Firebending Masters, and The Boiling Rock are flawless pieces of media that I constantly rewatch. This season also has my favorite episode, The Beach. While The Storm and Zuko Alone do resonate with me more and I consider them to be better episodes, The Beach is not only great at humanizing its villains and adding hardcore emotion, but this is the funniest episode. Azula made me laugh out loud at least 5 times and every other character, even the most minor ones, made me burst out laughing. Other good aspects are at their best in this season. The animation is fantastic and truly stunning at times. The action is at its best with the battles in Sozin's Comet and Katara vs Hama are fantastic, creative, and emotional. I also find this to be the funniest season. The Beach and The Ember Island Players are the funniest episodes in the show and moments like \"Hello, Zuko here.\" are literally comedy gold. There are also plenty of tears to be shed. Azula's end, Katara's bloodbending, the campfire scene in The Beach, Sokka and Toph accepting death, and Zuko and Iroh's reunion make me cry every time. The characters are also great. Aang, Katara, Sokka, and Toph are definitely at their best from a humor and character stand point. Aang's fear and dilemna with killing Ozai, Katara's dark vengeance and reluctant trust, and Sokka's rise to leadership are truly compelling character motivations. However, this season does have two issues. The first is minor, and that is one episode. Nightmares and Daydreams is my least favorite episode of any Avatar show. It's humor is awful and so many lines made me facepalm. The tone is inconsistent, going from juvenile and obnoxious to dark and terrifying. The only good things were one or two jokes being so crazy I laughed. What can I say, shock humor just isn't good anymore. However, the real issue is the lack of Iroh. Iroh is hardly in the season, only playing a major role in the finale and maybe one other episode. As he is my favorite character, this initially bothered me. However, I now realize that this does hurt the season. The highlight of the other two seasons was Zuko and Iroh's dynamic. They worked off each other so well and are truly the duo that learns the most in the show. Zuko instead learns a lot on his own in this season. That's all well and good, but I prefer when the two work together. However, the scene where they reunite only works so well because we missed Iroh so much. I can't complain too much, but Iroh is the best character and if he was in the show more, I would have smiled a bit more throughout. Granted, this is nearly perfect and truly media at its absolute best. Too bad Korra never lived up to it.",
      "date": "Oct 9, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "No amount of delays in its original run could tamper the epicness or emotional power of Book 3, doing the near-impossible by concluding a children's cartoon in spectacularly mature fashion.",
      "date": "Oct 3, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Must watch. It is one of the best animated series ever made.",
      "date": "Sep 28, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Avatar is one of the funniest and most clever shows of any kind that I've ever seen, and the fact that it's a show for kids makes it all the more impressive. The climax of Season 3 and the entire show is incredibly well done, ensuring maximum replay value and laying the foundation for the Legend of Korra (next on the list).",
      "date": "Sep 3, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "The story is really good and well-written! In all aspects, book 3 is just as good and amazing as the 2nd book. The characters are still very interesting. Zuko's character development is one of the best.. His redemption arc is very compelling! Also the finale is really thrilling and satisfying!\n\nThis show is one of the best cartoon series I've watched!",
      "date": "Sep 3, 2020",
      "rating": 4.5,
      "episode info": "Season 3"
    },
    {
      "review": "A perfect season all together, this season is able to go full on dark in its themes with episodes like The Puppet Master while balancing it with more comedic episodes like Ember Island Players or even The Headband. This season can only be described as epic with a great finale that ties up every loose end except Zuko's mothers whereabouts but that information can be found in extended lore for those who are interested. The only gripe I could possibly have is that the fire lord while a clear evil threat and presence has next to no motivations other than mustache twirly world domination. Azula is a much more compelling villain will her lack of motherly love due to her sociopath tendencies, manipulation and cruelty which could have led her to feel she needed to prove herself by ruling the world but that is not to take away from what this series was able to do in its story telling and journey in this incredible world. I am not an anime fan at all but there are two anime shows I have ever been a fan of and that Avatar the Last Air bender and The Boondocks. There is certainly a reason for that.",
      "date": "Sep 1, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "I've let this season stew for a long time before I wrote this review because I wanted to see if it was truly as good as I thought it was. I have not stopped thinking about it for over a week. It is probably one of the most singularly significant pieces of media that I've come across. It hasn't changed the way I see the world, but it certainly makes it very hard to fall asleep at night without thinking of scenes that had such nuanced meaning. The last 4 episodes (aka the finale) were the best ending to a show I think I've ever seen. The only things that come close are book series from my childhood. I am now jaded with other tv shows. I don't know if I'll ever find one with such growth to it again.",
      "date": "Aug 31, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "WHY DID THIS SHOW HAVE TO END WWWWWHHHHHYYYYYYY.",
      "date": "Aug 26, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "no words to speak off",
      "date": "Aug 23, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "What started as a way to pass through the afternoon tiredness, turned out to be one of the best shows I have ever watched. \nThe first season was slow, and a little bit boring to my taste, perfectly during a dopamine detox period. However, as the season 2 begins, the story simply gets more and more interesting. Each episodes draw me in more and more, and push the story to a higher and higher ground. The end of season 2 was absolutely sad, and as season 3 begins, the uprising energy and storyline just keeps going. \nIncredibly inspirational story and full of thoughtful eastern philosophies. 100% would recommend.\n\nEdit after a few days. I have learnt so much from watching this show. The PSD after watching this show is stronger than pretty much all the shows I have watched in the past. The character building is so effective that I felt like I lost a really good friend after the show ends. The utilization of the theme music is near perfection. The emotion I feel every time the Avatar's love starts is indescribable. The creator successfully linked the music a unique emotion with the song, great job guys!",
      "date": "Aug 20, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "\"QUE GRAN AVENTURA, QUE SERA RECORDADA\"\nCuando recuerdo en esta serie en la etapa de mi infancia, no puedo no envolverme en sentimentalismo de nostalgia, simplemente la recuerdo con gran cariño y es un gran gusto después de haberla visto otra vez después de tantos años saber que su grandeza no radicaba nada mas en el recuerdo de un niño,para mi simplemente no hay palabras para describirla, en especial porque es difícil explicar ese sentimiento único que ciertos elementos de la historia de Aang me hacían sentir, siento ser sentimentalista, pero eso pasa cuando tratas de describir las cosas con las que tienes un gran vinculo, no se puede evitar. Así que simplemente no puedo poner mi mente en una reseña, solo puedo hablar de lo que yo siento cada vez que pienso en esta historia, pero seré un poco justo conmigo mismo y en resumidas cuentas diré, que la parte final de Avatar:La leyenda de Aang cumple con la expectativa y entrega el final que todos queríamos y al hacer hace también nos entrega muchísimo mas en esa gran conclusión y como toda gran historia se extrañara no tener mas de ella.",
      "date": "Aug 19, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "The American television series that was commercially successful and acclaimed for its outstanding animation and plot. I've finally watched the whole thing from beginning to end and I can now say it's one of the best and most epic animated TV shows of all time. In a war-torn world of elemental magic, a young boy reawakens to undertake a dangerous mystic quest to fulfill his destiny as the Avatar, and bring peace to the world. Touching on mature themes like war, genocide and imperialism, it is also a series with a defined structure, full of compelling and well-developed characters and a funny sense of humor and good morals. Each episode is a great adventure in its own right, usually concluded with stunning action sequences and the show couldn't have a better conclusion to the story. It is absolutely EPIC!",
      "date": "Aug 17, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Amazing, perfect, beautiful. I wasn't able to watch it as a kid because I didn't have cable, but since it was on Netflix I binged it and it's the best TV show I've ever seen! Watch it, please!!",
      "date": "Aug 10, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Awesome! Well developed story line. Blows the movie away!",
      "date": "Aug 5, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "My friend recommend this show to me, and i'm glad he did!\nHonestly this show is great! Action amazing, love the comedy, characters and their character developments. Especially Zuko, so badass.\nYea, I definitely recommend this.",
      "date": "Aug 4, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "A perfect final season, all the characters got a moment to shine and the arc of each main character is amazing.",
      "date": "Jul 29, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "The third season was the best.",
      "date": "Jul 28, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "The perfect conclusion to the serie\nI enjoy every single episode",
      "date": "Jul 23, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "It's just so good. The plot, the characters. Don't let the fact that it's officially a kids series get in the way of watching it. I don't even think it is a kids series. I loved it as a kid and I love it now, and my parents love it as well. Great show!!",
      "date": "Jul 16, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Absolutely Phenomenal Series",
      "date": "Jul 2, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "The best TV show I ever watched. An amazing story, with morals, character development, real-world problems for every age. I will definitely rewatch it multiple times and get my best friend to watch it as well!",
      "date": "Jun 30, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Perfect in every single way.",
      "date": "Jun 30, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "best show every. just so good",
      "date": "Jun 28, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Book 3 is an insane, terrific, and intense ride to sit through. With much more moments to memorize and a series finale to put fans waiting for The Legend of Korra excitedly, Avatar: The Last Airbender ends with an amazing season.",
      "date": "Jun 25, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "This tv show had the best character development and amazing story line!!! they need to make more stories about the avatars and season 4 of Aang the avatar",
      "date": "Jun 22, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Absolutely AMAZING series! Exciting storyline and great character development based on a beautiful culture. ❤️",
      "date": "Jun 21, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "One of the best shows ever made. The character development, animation, humor and action in this show is unmatched.",
      "date": "Jun 17, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "This show has always tackled heavy sociopolitical issues while maintaining a perfectly timed, charming humor and wonderful characters. The third season is no different. The animation is beautifully done, whether aesthetically, compositionally, or the choreography itself. I saw this series years ago and I still remember the music score. The episodes are engaging, but more importantly, thought-provoking--especially in how the themes from the first season are woven into Aang's fundamental character development as well as the external narrative. Every moment is filled with sincere emotion clearly imbued by the creators. Beautiful work.",
      "date": "Jun 16, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "My favorite show of all time.  2nd time watching it all the way through!  My kids love it.  \n\nGrowing up, it was easily dismissed at a glance by my parents as, \"just a stupid kid show about a boy with an arrow on his head.\"  I finally got them to actually try it.  Now they are binge watching it for their \"romantic dates,\"  applying it to their own \"religious metaphors\", and loving every second of it.  It is by far one of the greatest series of all time.  I love Avatar the Last Airbender!",
      "date": "Jun 13, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "from the beginning i have praise this show from the first season to the second season and i am so happy and amazed how they can make this show from start to finished amazing one of my favorite endings of a show of all time",
      "date": "Jun 12, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "One of the best animated series I have ever seen. So much heart and good humour and very well written. Extremely likeable characters and overall story. Just re-watched it all on Netflix and it was a joyful experience. Recommended for kids and adults alike.",
      "date": "Jun 12, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "With more incredible animation, characters and humour, this season is a satisfying conclusion to one of the greatest animated shows in history.",
      "date": "Jun 12, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "zula iro zuko the fire nation the transformation of people and places loved this show",
      "date": "Jun 8, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "This is one of the best kids genre TV shows ever done. The show appeals to both kids and adults alike, because of how well the story was written. Sure it has some goofy moments in it, but that is OK, because it did not break the continuity of the story. The second thing is how great the story arch and character development were done. The story draws you into caring about the characters which always makes a good story!  I plan on watching this again and again!",
      "date": "Jun 8, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "I will watch this series many times. I apologize to all the people around me that have to listen to me go on about it. Everything shines, but the thing I appreciate most is how the magic--how the lore--all serves the characters. A series about people controlling the elements that shows how the elements control those people. A series about people with unlimited power undone by the most subtle and human things. A series worth watching at any age with anyone. Absolutely beautiful.",
      "date": "Jun 8, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "This show is amazing. From story, characters, voice acting (Fire lord Ozai's voice sound familiar 😉) and direction all great. Music makes it even better.",
      "date": "Jun 7, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Honestly one of, if not the greatest television show to ever be produced. Incredibly, thematically rich. Well developed multi layered characters. A gorgeos plot accompanied with an equally beautiful art style. Just overall a masterpiece that has and will live the test of time.",
      "date": "Jun 5, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "This is the gratest animated series ever created",
      "date": "Jun 5, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Brilliant show. Transcends generations.",
      "date": "Jun 4, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "The best season so far. We see and understand the redemption of Zuko. Aang is funnier than ever and the show has never been so entertaining. The final was so wonderfully written, that i can't do it any justice with normal words.",
      "date": "Jun 3, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "You already KNOW why this is 5/5 stars. Romance? Action? Comedy? Powers? Culture? This show has it all.",
      "date": "Jun 2, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Such a good show. Fun, addicting, emotional and powerful in all kind of ways. The third and final chapter proves to be better than the previous seasons as we see huge character development of Aang, Katara and Toph. But most importantly, Zuko's story arc developed incredible as he decides to switch sides in a crucial moment in the show. The last two episodes are intense and I wished that Aang's duel with Ozai would've lasted longer, but I'm happy the way the creators decided to end this astonishing piece of television.",
      "date": "May 31, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "This season was much better than the first two seasons. Zuko actually had a better story arc than the movie version. Must see season.",
      "date": "May 31, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Good. But not as good as Space Force....",
      "date": "May 30, 2020",
      "rating": 4.5,
      "episode info": "Season 3"
    },
    {
      "review": "Greatest TV show I have watched.",
      "date": "May 28, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Maybe the best TV show of all time. Perfection",
      "date": "May 28, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Best and more profound show ever! and not just for children",
      "date": "May 27, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Never loved a show like I love this show.",
      "date": "May 27, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "I rewatched this show that I remembered and loved from my childhood and found myself to be surprised by the amount of perfection this show has. Avatar: The Last Airbender has an incredible plot within all three of its seasons, beautifully played recursive themes, and perhaps the most perfectly executed examples of character development, especially through Zuko. Avatar is a series meant for all audiences.",
      "date": "May 27, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Season three is absolute perfection. The episodes with a story are thrilling and unpredictable, and when they end in defeat you can really feel the frustration of the characters. Each filler episode is its own little gem, telling intricate stories that effortlessly bounce between tones -- comedic, heartwarming, moving. They add depth to every character and beautifully handle their struggles. The finale was perfect, portraying the evolution of the characters and tying up all loose ends.",
      "date": "May 26, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "The best Gateway Anime out there.  Lots of fun for the whole family!",
      "date": "May 26, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Best series finale anyone can ask for. Every character finds closure, villains are dealt with very respectfully.",
      "date": "May 26, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "one of the greatest shows of all time. loved it as a child but truly appreciate it as a grown man. one of the most well written shows with the best character development you are likely to find anywhere. give it a watch",
      "date": "May 25, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "This season brings the story arcs of the first two seasons to an incredible and satisfying end. For a kids show, it's remarkably nuanced. No main characters are one-sided, each is incredibly deep. The story is compelling. If you were thinking about watching the series and wanted to look at season 3 reviews- then my advice is to watch each season, You will be pleased",
      "date": "May 25, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "The greatest tv show of all time. Other than the episode the great divide, every episode was enlightening, emotional, and entertaining. Had some of the best villains and charachter arcs in cinematic history. The music is one of the best parts that are overshadowed. This is not a kids show. This is a show that anyone could watch and find the beauty in. It is by far the best television show I have ever watched. It surpassed any movie I have ever watched either. Watching as an adult versus as a kid,  I realized how incredibly diverse it was in real life issues, historic lessons and culture. 100 stars if I could give it stll wouldnt be enough. I can't wait for the live action version.",
      "date": "May 24, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "The hype is completely true, great show for all ages.",
      "date": "May 24, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "With Stunning Bisuals, Spectacular Character Development, Top-Notch Humor, and Love, Avatar: The Last Airbender is one of the Greatest Stories Ever Told.",
      "date": "May 24, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Avatar Series is most likely the best creative production I've ever watched. The characters and their beliefs make them unique and lovable to the audience. I have watched this series at least 4 times and I do not get tired of being part of their amazing journey. It  makes me so mad that the live-action was a disgusting disaster but maybe because the bar is up so high...",
      "date": "May 22, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "This may be the best thing to ever come from Nickelodeon. The character development in this show is unreal, and this final season wraps it up perfectly. Zuko just might be one of the best characters ever, in any TV show or movie. He is the key to making the show a masterpiece.",
      "date": "May 21, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "With wonderful voice acting and a story that thinks deeper than even the most demanding audience could want, Avatar wraps up its plot in most satisfying fashion.",
      "date": "May 21, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "The last season of TLA is incredible. They have such dynamic characters, compelling villains, life lessons, incredible action, and more all packed in one place.",
      "date": "May 19, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Super good bake. Checked all the boxes.",
      "date": "May 19, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "This show has my favorite conclusion in literally any fantasy story ever. The characters, worlds, bending/action, culture, beauty, and everything in between, is genuinely and absolutely perfect",
      "date": "May 18, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "No words to describe how good this show is. This season puts so much in perspective, while also offering amazing anamations and one of the best fight scenes I've ever seen. They have spared no efforts in making this a beautiful artwork",
      "date": "May 17, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "One of the best things I've ever seen. Deep characters, deep themes, great writing, great storytelling. Everything is just so close to perfection.",
      "date": "May 12, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "if you haven't seen this watch in now!!!\nSeriously, if you reading this and haven't yet seen the show, stop what your doing and go frikkin watch it! :)",
      "date": "May 9, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "The finale was breathtaking. It brought everything together. Seeing the resolution of many of the plot points, and the relationship of the gang, was all really satisfying.",
      "date": "May 7, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "A \"heroes journey\" wrapped in a  \"good versus evil\" told as a \"coming of age\" tale. An incredible story for a children's show. The directing, humor, themes, characters, music, culture, all of it.",
      "date": "May 6, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Avatar the last airbender season 3 is probably one of the greatest endings in a tv show, the season 3, have some amazing episodes like the day of the black sun part 1 and 2, the Sozin's comet part 1, 2, 3 and 4, I prefer the second season for how few bad episodes it has, this one have some bad ones (there are no bad Avatar episodes there are just some of them that aren't as good as others) but they are still pretty enjoyable, and I will say that this season have one of the best scenes (if it is not the best scene) in the whole series; the Agni kai between Zuko and Azula that scene is just fenomenal in every possible way, the music takes the scene the animation starts to become even more impressive, it is just great, one thing I really like is Aang in this season, I like how he feels guilty about have lost Ba Sing Se and I also really like that the first time they try to defeat the firelord they failed, they really failed, I think this season have the best Aang writing. It is an amazing and epic end for a one of the bests tv shows ever that is why I will give Avatar the last airbender season 3 a 10 out of 10",
      "date": "Apr 29, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "The 3rd season of Avatar is my least favorite.  It still had great characters and stuff but after the defeat of the heroes in the last season almost every character is different except for Toph.  The season opened strong but then led into the worst episodes of the series (except for the great divide.).  There was this lame assassin that was hired to kill the avatar and he was just merely an obstacle with no character at all.  Once they invaded the Fire Nation in The day of Black sun the show got great again and the characters seemed more similar to their appearances in the first two seasons (Except for Zuko).  The ending was a 4 part epic with great animation and fight scenes.  This was such a great show",
      "date": "Apr 10, 2020",
      "rating": 4.5,
      "episode info": "Season 3"
    },
    {
      "review": "This show is something that everyone needs to see. Im not a critic, this is my opinion and i truly believe that this is a MUST WATCH for anyone of any age.",
      "date": "Mar 31, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Here we have the perfect wrap up of philosophy, morality, war, and love from this beloved series that will carry on for generations and into the next series.",
      "date": "Mar 20, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "The perfect story telling, there will never be anything this good again",
      "date": "Feb 17, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Easily the best animated show ever created, arguably the best t.v. series period. If you have not seen this, regardless of your age, you're missing out.",
      "date": "Feb 9, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "What a great ending! Masterfully done! This show is just a masterpiece at storytelling and emotions! The action scenes are amazing and just........WOW......GO WATCH THIS SHOW!!!!",
      "date": "Jan 22, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Wholly satisfying conclusion to the show. Character arcs are wonderfully completed, and the show remains thrilling right to the end, including an extremely memorable final fight.",
      "date": "Jan 10, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Amazing just amazing",
      "date": "Jan 9, 2020",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Absolutely Masterpiece. \nI was really afraid of the final; however, they completed this splendid series with great decision.",
      "date": "Dec 29, 2019",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Avatar: The Last Airbender is a TV series that I loved as a kid and continue to love as an adult. For me, that is a test that no other animated series has passed.",
      "date": "Dec 21, 2019",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "The best written animated series ever produced. I'm blessed to have grown up with this show. Truly a work of art.",
      "date": "Dec 3, 2019",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "This is the best animation ever made, I don't know how they came up with all this but it's really original and mind blowing. THANK YOUUUUUUU!!!!!!!",
      "date": "Nov 28, 2019",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "The idea is of the show about bringing balance in the world and the comedy, effects which entertains viewers are the key to total perfection of this show.",
      "date": "Nov 9, 2019",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Just finished watching it for the fourth time and I'm still as in love as the first time. My favorite show of all time. Period. Full stop. Simply amazing. The concept, world building, the writing, the characters, the arcs and development of the story. Everything was made with such care and thought that it shows in every second of the 61 episodes. It teaches you meaningful lessons while still being funny and entertaining. I wish I could watch it again for the first time. But then again, maybe it wouldn't evoke the happy childhood memories it does. Everyone should watch this show, no matter what age or who they are.",
      "date": "Oct 9, 2019",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "The third season is amazing along with the whole series and finishes up the story with an incredibly satisfying ending.",
      "date": "Oct 5, 2019",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "La mejor serie de todos los tiempos.",
      "date": "Sep 14, 2019",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Anyone who knows the behind-the-scenes of this show should be completely amazed, as I am, that they were able to pull off the completely perfect ending that is season 3.  Initially, this was supposed to be two seasons, but the creators had to pack it all into 21 episodes.  \nThe last 4 episodes make a pretty solid mini-movie.  A wonderful end to an amazing story arc!",
      "date": "Sep 9, 2019",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "I loved it so much I bought the show on DVD. Worth every penny.",
      "date": "Jul 26, 2019",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "On the heels of two exemplary seasons, season 3 somehow tops them both, ending with a worthy conclusion to a truly legendary series.  I've never watched a series more than once -  I'm on my fourth Avatar watch-through.",
      "date": "Jul 22, 2019",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "This is absolutley one of the best shows I have ever seen and hits all the tragic notes at an even pace with its comedy. Although the first few episode are a little rough its almost impossible to notice as you are too busy laughing and crying along with the characters. Truly a masterpiece.",
      "date": "Jun 23, 2019",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "A good show must have an outstanding ending to be great. Avatar: The Last Airbender is just that. Words don't do it justice.",
      "date": "May 23, 2019",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "I love the story line, animation, and how the characters change over time",
      "date": "May 12, 2019",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "The strongest season yet!\nThe first half focuses on regrouping and gaining more insight into the daily life of the Fire Nation for Team Avatar, while Zuko learns that finally getting what he's wanted for so long isn't what he'd expected it to be.\nIn the second half of the season everybody gets quite a meaningful episode (or two) where the characters story arc 'matures\", all culminating in the brilliant 4-part season finale!",
      "date": "Mar 9, 2019",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Probably the best season, much like the other seasons only that team avatar is more complete with even Zuko ending up joining.",
      "date": "Mar 1, 2019",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "The third and last season begins surprisingly lame, but gets better from there, culminating in a four-part finale that screams the word \"epic\" with its every frame",
      "date": "Feb 22, 2019",
      "rating": 4.0,
      "episode info": "Season 3"
    },
    {
      "review": "When I was in middle school, Nickelodeon used to play reruns of Avatar: The Last Airbender all the time. Back then it was still a relatively new show, but I never remembered it airing or ending. However, it was one of the only shows that my sister and I could agree on watching, so I remember the reruns well. I never watched the full show in order. I never saw all the episodes. Only bits and pieces of different episodes stuck with me over time. I always thought it was a good show, but it was never anything more than that. Just some good entertainment. As I\u0092ve grown up (some would say I haven\u0092t), I\u0092ve gotten into conversations about it here and there. Either people remember it like I do, as a pretty good, fun show, or they love it to death, acting like it\u0092s the greatest television show to ever stream across the planet. Hearing people\u0092s adoration for Avatar over the years, I\u0092ve gotten curious. Had I missed something? Was it better than I remembered? So I decided to re-watch it these past couple months. Long story short: Avatar: The Last Airbender IS the greatest television show of all time. \n\nAs I made my way through The Last Airbender, I was continually shocked by how good the show was. Every few episodes or so I was blown away that a cartoon could be so good. I now realize the fault in my thinking. I underestimated the show because it\u0092s a cartoon. I guess it worked in the show\u0092s favor, because I ended up appreciating it even more, but it\u0092s unfair towards the creators. People tend to think that cartoons are just for kids, simply because they\u0092re animated. Recently, with the success of shows like Bojack Horsemen and Rick and Morty, people have understood that cartoons can be incredibly, sometimes shockingly, deep and adult. But because Avatar is a Nickelodeon cartoon, people still characterize it as a kid\u0092s show. The truth is that Avatar is technically a kid\u0092s show, but more so than any other kid\u0092s show ever, it can be enjoyed by anyone. An eight year-old and a 98 year-old can sit down together and receive the same level of enjoyment from it. Because of this, I would call Avatar family-friendly. It\u0092s not a kid\u0092s show. It\u0092s an everyone show, and that might be one of its greatest strengths. Because of Avatar\u0092s incredibly wide audience, it can touch on serious, profound, and emotional issues without being too heavy-handed or serious. So it\u0092s serious without being serious, if that makes any sense. Regardless of everything I just said, I was still a bit embarrassed when I first started watching. During an early episode, before I realized how amazing the show actually is, my roommate and his girlfriend walked into our apartment. I immediately smiled and said, \u0093I know. I\u0092m watching a kid\u0092s show on a Friday night. Don\u0092t judge me.\u0094 Later my roommate told me that his girlfriend had said, \u0093I don\u0092t know why he apologized. That show is fantastic.\u0094 Turns out I wasn\u0092t being lame for watching Avatar; I was being lame for watching Avatar on a Friday night.  \n\nNow it\u0092s time for me to explain why I think Avatar is so good. To be honest, the answer is everything, but I\u0092ll try and be a bit more specific. First of all, the characters are fantastic. They\u0092re richly drawn, and they feel like real people in a real universe. The show starts off slowly with small, serialized adventures. The story becomes more defined eventually, and thankfully a lot of what gets introduced early on is brought back in satisfying ways. The best part about the early episodes is that they slowly and slyly add mounds of characterization to each character, gradually building your affection for them overtime. By the end of the first season, you\u0092ve been introduced to an incredible world, and you\u0092ve fallen in love with the characters that inhabit it. The second season introduces new characters, and the third brings them together for an amazing finale. The way the show adds texture to its main and secondary characters is genuinely something to be admired. Nobody is one-note. Nobody is simple. They really do feel real. \n\nFrom a story standpoint, Avatar is also fantastic. The show runs 61 episodes overall, and I would say all except maybe ten work towards the larger narrative. These ten or so episodes are the most episodic of the bunch, but even at their worst, they still manage to add characterization and simple fun to the series. (One of) The thing(s) that makes Avatar so special is how it\u0092s never black and white. There is good and evil everywhere, in the heroes and the villains. This only adds to the universe as a whole, making it feel lived-in and believable. From an action standpoint, the show is simply stunning. The action scenes are based on real-life martial arts, and the animation brings them to life fully and awesomely. The animation itself is beautiful, and it only gets better as the series goes on. The cinematography is fantastic; the way scenes are framed adds depth to them that would be lost in a lessor effort. The music is amazing. The humor is on point. The emotion is real. The themes are deep. It does not get better than this. \n\nThe Last Airbender ends in a four-part finale that\u0092s essentially a 90 minute movie. Like Avengers: Infinity War, it only works with the foundation that comes before it. But with that foundation, Avatar\u0092s finale proves itself to be one of the greatest conclusions to anything ever. After watching the entire show, it will make you cheer and laugh and cry. I\u0092m not the kind of person who yells things out while watching a movie. The only time I ever remember doing this was during the end of Infinity War for that matter, and I think that was completely called for. But multiple times during Avatar\u0092s finale, I howled at the screen; it was that good. Part of the reason the finale is so satisfying is because the show isn\u0092t dragged out forever. Most TV shows are aired until they\u0092re no longer popular, which leaves them with lackluster and narratively dry endings. Think of The Office for example. Avatar has three planned-out seasons. It wasn\u0092t cancelled; it was designed to be three seasons long. Because of this planning, every character is given exactly the amount of time they need to develop, and everything comes together perfectly in the end. \n\nTrust me, I\u0092m not crazy. If you don\u0092t believe me, google Avatar right now. You\u0092ll see that I am far from the only one who thinks this way. Years of bad publicity from Nickelodeon, a terrible movie adaptation, and a James Cameron movie of the same name have taken the spotlight away from Avatar. But nothing deserves it more than this show. I highly recommend it. Please, if you\u0092ve managed to get to the end of this review, give Avatar a chance. You won\u0092t realize how amazing it is until it\u0092s over, but by then you\u0092ll want to watch it again anyways. That\u0092s because Avatar: The Last Airbender is a modern masterpiece.",
      "date": "Oct 24, 2018",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "The greatest animated series of all time and undoubtedly one of the best shows ever aired in general. Somehow it manages to weave quirky humor, a captivating plot, and incredibly touching character arcs into one amazing show. I doubt there will be a 'children's' show that can even begin to compare with this masterpiece for a very long time.",
      "date": "Oct 21, 2018",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "90% for this one, it kinda took a different approach in telling the story. Although there is alot of perfect moments between Aang Katara Sokka Toph and Zuko, this season is more of a 1 storyline kind of thing. Although this season provides us with the best best best season finale fight ever made. Zuko vs Azula, and Aang vs Ozai is both litttttt.",
      "date": "Oct 21, 2018",
      "rating": 4.5,
      "episode info": "Season 3"
    },
    {
      "review": "You couldn't have asked for a better conclusion to a TV series than what we got.",
      "date": "Oct 12, 2018",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "One of the most heartwarming and epic Seasons of any show ever. Hard to think of something I didn't like.",
      "date": "Oct 5, 2018",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Avatar takes you to a fabulous journey of self spiritual discovery, with a mix of adventure, witty comedy, extraordinary martial arts action and complex character developments. The series succeeds in getting you fully entangled in its drama, presenting you with an amazingly captivating plot.\nYou become an instant fan once you finish watching it!",
      "date": "Sep 20, 2018",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "the greates show in the world",
      "date": "Jul 30, 2018",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Dragon ball level action with the heart of naruto=Avatar's finale",
      "date": "May 31, 2018",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Greatest SHOW OF ALL TIME. HAS A PERFECT MIX OF ALL GENRES WITH A WONDERFUL OVER ARCHING PLOT AND DEEP DEEP CHARACTER DEVELOPMENT WITHIN THREE SHORT SEASONS. NO OTHER SHOWS HAS BROUGHT SO MUCH JOY AND HEARTBREAK, ALONG WITH LAUGHS AND PHILOSOPHICAL IDEOLOGY. TO SUM IN ONE WORD, BRILLIANT. \n--NR",
      "date": "May 26, 2018",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "tHe very last episode was underwhelming, average and predictable. It left me disappointed and with a hollow feeling, but apart from that the series was great, innovative and creative",
      "date": "May 3, 2018",
      "rating": 4.5,
      "episode info": "Season 3"
    },
    {
      "review": "As if the show couldn't improve from Book 2: Water, the third installment of Avatar; The Last Airbender is nothing short of perfection. Book 3: Fire manages to further develop already completely fleshed out characters; leading them to be more realistic and emotionally complex than ever. Each character has a meaningful role in the series, and no component goes unused. Each moment is perfectly laid out, and each episode makes you want to watch the next. Book 3 will bring you a wide range of emotions; from joy to anger to sadness to relief. I am utterly in awe of how incredible this show is, and I truthfully believe it is on par with some of the best television ever made.",
      "date": "Mar 30, 2018",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "This season is absolutely perfect. The way they fleshed out and developed every character in this season was masterfully done, and the story became so epic. The ending was great, the characters are fantastic, the pacing is perfect, everything is perfect.",
      "date": "Feb 23, 2018",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "The big one, the season in which all of our characters have become truly matured and now have to confront not just physical enemies but their own mindsets and convictions as well. This season asks us what it means to forgive, it asks us what it means to atone... it asks us what it means to have to kill. And it culminates in a perfectly arranged 4 part finale that really compares more to a feature film than a television series.\n\nAnd then the whole thing wraps up beautifully. Truly a show that few can rival.",
      "date": "Dec 26, 2017",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "One of the best cartoon shows I've seen. Definitely worth watching every season. Every episode has its own story so it keeps things interesting. Its entertaining, funny and not only for kids, but for all ages.",
      "date": "Nov 2, 2017",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "This is the king of all animated television. It\u0092s so focused on the story and that\u0092s why there\u0092s no shame in loving it as an adult. Every episode is entertaining, every character has layers, and it\u0092s truly a masterful piece of work. The best show to ever be on Nickelodeon. It\u0092s a creative and enjoyable show that while not very long, is mesmerizing the whole way through. Don\u0092t knock this one off as \u0093just another kids show.\u0094 It\u0092ll blow you away.",
      "date": "Oct 6, 2017",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "One of the best conclusions that I have seen in a show, this show should be held as one of the best in history",
      "date": "Aug 25, 2017",
      "rating": 5.0,
      "episode info": "Season 3"
    }
  ]
}