{
  "star_trek_lower_decks": [
    {
      "review": "Definitely found their stride. Got the feel good glow that Trek  is known for.",
      "date": "Apr 12, 2024",
      "rating": 4.0,
      "episode info": "Season 2"
    },
    {
      "review": "Why do people keep saying this is a show with 'heart'? Where, exactly? The only thing these characters care about are themselves. Jokes are mean-spirited and just not funny. It 'has heart' if friendship means 'abuse', I guess. Can't stomach another episode. No more for me, thanks.",
      "date": "Mar 24, 2024",
      "rating": 0.5,
      "episode info": "Season 2"
    },
    {
      "review": "Season 2 was excellent",
      "date": "Oct 7, 2023",
      "rating": 4.0,
      "episode info": "Season 2"
    },
    {
      "review": "Somehow this show keeps getting better! Fun to see all the references in the background.",
      "date": "Sep 9, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Fresh but nostalgic, lower decks continues to make me want more and more. Fantastic characters, exciting new missions, bringing new backstory and development to many previous races and ideas throughout the trek franchise. If you love star trek, you must love lower decks.",
      "date": "Sep 1, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Jokes are a little better this season. Characters seem less grating. More of the same, just a little better.",
      "date": "Aug 22, 2023",
      "rating": 3.5,
      "episode info": "Season 2"
    },
    {
      "review": "Encontro su forma en la Temporada 2.",
      "date": "Jun 13, 2023",
      "rating": 4.0,
      "episode info": "Season 2"
    },
    {
      "review": "I am loving this show!",
      "date": "May 8, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Another hilarious season that elevates the show with a bit of drama while keeping the comedy.  The voice cast remains superb, delivering hilarious performances while sticking true to their Star Trek characters while the show runners maintain that delicate balance as well, making fun of Star Trek while also still loving the show.  Best of all with this season, a touch of drama is delivered with a gut punch of a cliffhanger.  Great watch overall.",
      "date": "Mar 25, 2023",
      "rating": 4.5,
      "episode info": "Season 2"
    },
    {
      "review": "The show really came into its own here. Solid season, and a step up from S1.",
      "date": "Feb 16, 2023",
      "rating": 4.5,
      "episode info": "Season 2"
    },
    {
      "review": "Awesome Series!.. Very Funny!",
      "date": "Feb 7, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Was skeptical at first but Lower Decks turned to my favorite Star Trek series … nice cruise through the Star Trek universe with cool characters and creative stories.",
      "date": "Jan 23, 2023",
      "rating": 4.5,
      "episode info": "Season 2"
    },
    {
      "review": "Much better than the first season.",
      "date": "Nov 9, 2022",
      "rating": 4.5,
      "episode info": "Season 2"
    },
    {
      "review": "Good second seaon. I love the character development.",
      "date": "Oct 30, 2022",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "If you are a Star Trek fan and don't like this show, you must have been mixing your Kheh'irho with your Iw HIq!",
      "date": "Oct 16, 2022",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "The second season improves on the first by giving better depth to the characters we met in season one as well as showing us more of the Star Trek universe post Dominion War. The shows biggest credit is the art style which is reminiscent of the TNG / DS9 era and does away with most of the eye gouging modern track art in which everything is either dark and dreary or so bright you can't see the screen.\n\nOverall a decent Star Trek show that whilst better than the likes of Discovery Etc pales in comparison to some of the better Sci-Fi available to watch.",
      "date": "Sep 30, 2022",
      "rating": 3.5,
      "episode info": "Season 2"
    },
    {
      "review": "Trek fans will enjoy this.  Lot's of inside jokes.  Not woke.  Pretty funny.",
      "date": "Sep 28, 2022",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "It really found its footing in the second season. A minimal amount of sjw nonsense inserted per usual, but if you ignore that it's a great series.",
      "date": "Sep 27, 2022",
      "rating": 3.5,
      "episode info": "Season 2"
    },
    {
      "review": "This season expands the universe of Star Trek and goes deep into character developing. We get more interactions between the crew and we get to know better each protagonist of the show. Fantastic season!",
      "date": "Sep 17, 2022",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Again I don't understand why it's a 77% approval this was a great series",
      "date": "Sep 16, 2022",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Nothing different about this season from the first.  Except there was one episode that finally contained some laughs.  However my assessment that this show is aimed at 10 year olds who have been Star Trek fans for 40 years still stands.\n\nAvoid.",
      "date": "Aug 17, 2022",
      "rating": 1.0,
      "episode info": "Season 2"
    },
    {
      "review": "Incredibly funny, with a big heart and impressive depth of Star Trek lore.",
      "date": "Jul 26, 2022",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "I just love this series. The characters are delightful, interesting, full of energy and it is such a joy learning about them. Yes, I'm a proud nerd and identify with all of the characters of this show.\n\nIt's the character development that makes this show so entertaining. The writers are willing to think \"outside the box\" with the challenges/situations facing the crew. Each character sees the world from a different perspective and that makes each character interesting, individually, and even more so as an ensemble cast.\n\nAnd I would be remiss not mentioning the regular references (homages?) to past Star Trek series (TOS, TNG, Enterprise) characters and episodes. The writers KNOW (and understand the philosophy of Star Trek). A gift for an avid Star Trek viewer.\n\nAlso, watch the \"The Ready Room\" interviews with the cast. It really brings life to the \"Lower Decks\" characters as each actor/actress imparts their perspective on their character. A wonderful view of the future!\n\nThank You Mike and Crew!",
      "date": "Jul 22, 2022",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "This is the sad story about a boy whose dreams of becoming a starship captain are getting destroyed by a (very cool) mobbing colleague who happens to be the daughter of the current captain. \n\nUnfortunately not being politically correct and praising a mobber as a hero deducts some points for me, I cannot enjoy this. Also it is racist, as in \"Race xy is so stupid and ignorant of their own culture\", a known phenomena in Star Trek and high fantasy, but never shown this plain stupid as in here, also a big minus these days. Lastly I seem to miss something every episode, its not always logical what's happening between the episode, also a minus for me. This leaves the series with nothing but 1.5 stars",
      "date": "Jun 29, 2022",
      "rating": 1.5,
      "episode info": "Season 2"
    },
    {
      "review": "This show keeps getting better. I am starting to believe nothing is sacred that cant be made fun of. I encourage the writers to keep it up. Maybe one of the ensigns could come across some old pictures of captain pike and comment about his perfect hair. Man I wish mine looked like that. \nThanks for focusing on quality writing rather shoving some agenda in our faces. I don't want to forget to praise the animation. It definitely adds the characters and story. I wish you success with season 3 no \"Shakka when the walls fell.\"",
      "date": "Jun 23, 2022",
      "rating": 4.5,
      "episode info": "Season 2"
    },
    {
      "review": "Most of the new Star Trek has failed because it expected us to take stupid ideas seriously. This does not, and therefore, it works.",
      "date": "Jun 17, 2022",
      "rating": 3.5,
      "episode info": "Season 2"
    },
    {
      "review": "Wonder how could some one invest on that kind of sh...!",
      "date": "May 21, 2022",
      "rating": 0.5,
      "episode info": "Season 2"
    },
    {
      "review": "Given other spins offs have been so bland woke i was kind of surprised this one was actually made me laugh without feeling like i was being vertical signaled for being white, male and straight.",
      "date": "Apr 5, 2022",
      "rating": 3.0,
      "episode info": "Season 2"
    },
    {
      "review": "The ONLY GOOD current star trek on the market.",
      "date": "Mar 18, 2022",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Eye rolling claptrap that epitomes Hollywoods demise. A hyperactive teenage brat who appears to have consumed 50 expressos and vomits out constant unfunny diatribes with no pause for breath. Sigh, whats to like when the principal Mariner character has no redeeming qualities and is written to be so irritating and unlikable.",
      "date": "Mar 9, 2022",
      "rating": 1.0,
      "episode info": "Season 2"
    },
    {
      "review": "I am excited because it seems every season of this show it gets better. I love the episodic nature of this show but with hints of a bigger seasons wide pakled plot.",
      "date": "Mar 5, 2022",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Season two takes it up a level. I hesitate to describe a group as being the real Star Trek fans, but this is THE series for that group of fans who appreciated everything up through Enterprise and then felt abandoned by all the \"new Trek\" that followed. If you're tired of dark storylines and shows that look more like Star Wars than Star Trek filled with boring monologues and overly intense action, this is a fun comedic take on the Star Trek that real fans (oops... can't say that) love.",
      "date": "Feb 15, 2022",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "More insanity than season one? Why yes, absolutely. Thank you very much.",
      "date": "Feb 10, 2022",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Very funny. Nostalgia is subtle and is worked in very well and not too overwhelming. Can't wait for more.",
      "date": "Feb 4, 2022",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Fantastic.  Good stuff.  I needed this after Discovery bombed out.",
      "date": "Jan 28, 2022",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "This season was much stronger than the last one right out of the gate. My only wish is that it wasn't constrained by the half hour format, but that comes with the territory of being an adult animated comedy I suppose.",
      "date": "Dec 31, 2021",
      "rating": 4.0,
      "episode info": "Season 2"
    },
    {
      "review": "Not the absolute worst thing I've seen, but I don't think I laughed once. I loved Rick and Morty and it appeared from the trailers that they were trying to copy that style. I dunno, maybe it's funnier after the 3rd episode? I just found it boring and nothing like Star Trek. Would have loved an animated Next Generation, why couldn't we get that?",
      "date": "Dec 26, 2021",
      "rating": 1.0,
      "episode info": "Season 2"
    },
    {
      "review": "Fantastic characters, funny, nostalgic joy. I hope this long continues.",
      "date": "Dec 21, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "I simply love this show! I can't get enough of it. It has a lot of familiar elements, but it also explores new territory with characters that I actually like and am invested in.",
      "date": "Nov 25, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Awesome continue to already great series.",
      "date": "Nov 23, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Didn't waste the goodwill and effort put in by the end of Season 1. A great season of Star Trek.",
      "date": "Nov 22, 2021",
      "rating": 4.5,
      "episode info": "Season 2"
    },
    {
      "review": "This show hit its stride in season 2. Campy. Full of obscure mid-90s fan service. Likable ensemble cast. Bite-sized episodes. Irreligious humor. Only a few of these things are often associated with Star Trek, and yet it feels like the most faithful rendition of Trek in years. If you grew up on Star Trek that was more likely to feature a string quartet than firing the ship's phasers, you'll find this show hilarious.",
      "date": "Nov 17, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "This show has not improved from the first one. The only one who has had character development was Boimler by being on board the Titan. He gets a big confidence boost being on dangerous away missions. Once he is back on the ship the show revolves around, Mariner goes out of her way to sabotage him, questions his experience on board the Titan.\n\nEveryone else is still as incompetent, Mariner is still unlikeable. Mariner is more out of control this season. Tilla(?) the green one. Would rather reprogram the cyborg because he liked pears when he normally doesn't. Apparently this makes her a good friend? \n\nThe captain puts her ship and crew in danger because they cannot pass an evaluation course. The drill sergeant was onboard the ship. So that makes perfect sense to be that petty with this show's captain and crew. \n\nThey killed off the Bajoran security officer in season 1 and brought him back in the beginning of season 2.  \n\nEnd of the season the Captain who is also Mariner's mother is getting a promotion, and her daughter Mariner does everything she can to ruin this promotion. How is this character meant to be likable? Mariner goes out of her way to stir the pot among the senior staff about this promotion.  The thing is, Mariner does this because she doesn't want her mom to leave. Honestly she causes more trouble than she's worth. \n\nMariner can't handle constructive criticism from her mother. Surprise surprise.  They fly through an open asteroid field which honestly, if these writers knew anything about how physics worked in space they would know that even a grain of sediment is going to tear through you with out protection.\n\nTo be honest the last few minutes of the episode didn't come as a surprise.",
      "date": "Nov 4, 2021",
      "rating": 0.5,
      "episode info": "Season 2"
    },
    {
      "review": "Getting better, with classic elements and poking fun at some of the bizarre bridge goings on.",
      "date": "Oct 29, 2021",
      "rating": 3.5,
      "episode info": "Season 2"
    },
    {
      "review": "This is very good Star Trek",
      "date": "Oct 29, 2021",
      "rating": 4.5,
      "episode info": "Season 2"
    },
    {
      "review": "In its second season Star Trek: Lower Decks is not only able to maintain the quality established in the first season but also it is able to bring some fresh takes with episodes that are even funnier than in the first season.",
      "date": "Oct 29, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Everything I loved about Season 1 was dialed up past Warp Factor 10. I am so excited for season 3!",
      "date": "Oct 29, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Found their footing even more in season two. Great fun and Easter egg time!",
      "date": "Oct 29, 2021",
      "rating": 4.5,
      "episode info": "Season 2"
    },
    {
      "review": "At the very deep heart of ST: Lower Decks are some classic television comedies that were in syndication (how you repeatedly watched an old show on broadcast television back in the day) when I was a pup.  These are the comedies based on the real stories of what Dad and Grandpa really did during the war, WW II that is: Sgt. Bilko with the great Phil Silvers and McHale's Navy which featured Ernest Borgnine.  Of course for my generation there was M*A*S*H*, the often acerbic comic take on the war in Viet Nam.\nST: Lower Deck mines Star Trek canon which means there is oh so much to play with all the while respecting the genre rules of comedy and sci-fi.  Think Victor Borge or the great British \"Carry On\" comedies.  \nI binged both seasons together and what I really want now is ST: Lower Decks - The Movie.  The ST: LD Season 2 episode wej Duj is proof this writing team could do it, probably even with music.  Somebody call Linn-Manuel, you mean he's already on the phone, no way.",
      "date": "Oct 26, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "best star trek series! and since this is the internet, if you disagree with me... you're wrong",
      "date": "Oct 19, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Lower Decks has found its stride in Season 2, delivering comic relief while remaining true to the canon, ethos and episodic format of Rick Berman era Star Trek.",
      "date": "Oct 15, 2021",
      "rating": 4.0,
      "episode info": "Season 2"
    },
    {
      "review": "Better than the first season.",
      "date": "Oct 15, 2021",
      "rating": 3.0,
      "episode info": "Season 2"
    },
    {
      "review": "Characters have good development and the series respects pre-established canon and the humour isn't annoying.",
      "date": "Oct 15, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "I liked Season 1 just fine. I had my criticisms and reservations, but it was decent.\n\nI can't believe how much I love Season 2.\n\nTalk about an incredible turnaround. The jokes are funnier with better timing, the stories are interesting, and the characters are so much more fleshed out and better explored. Best of all is how they handled their Star Trek references for non-Trekkians. In S01, there were numerous times I was lost or felt excluded because I hadn't watch any previous Trek content. But in this season, they've improved on the writing so that even if you don't fully comprehend the reference, you can still understand the joke from context. Most of the obscure reference jokes are visual gags in the background, for the more dedicated fans. Of all the shows that I'm currently watching and enjoying, ST:LD is the one I most look forward to. \n\nI would wholeheartedly say it's absolutely worth getting through Season 1 just to get to S2. And I think you might appreciate S01 much more afterwards.",
      "date": "Oct 12, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Lower Decks continues to be a Trekkies wet dream. The characters are a joy to watch, especially Tendi and Rotherford. The episodes are packled full of nods and winks to the previous series and it rarely feels cheap or forced. This is fan service done right. A true gem for the fans and I can't stop smiling all the way through.",
      "date": "Oct 10, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Really a funny take on things in the Star Trek universe, while still being respectful to the source material.",
      "date": "Oct 10, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Better than the first season. Consistently funny. Not too dark to watch before bed.",
      "date": "Oct 10, 2021",
      "rating": 4.5,
      "episode info": "Season 2"
    },
    {
      "review": "Really funny, confirms a lot of cool canon and creates some new",
      "date": "Oct 9, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Brilliantly balances satirizing Star Trek while also 100% embracing the spirit and feel of 90s Trek.\n\nDon't listen to cranky gate-keeping boomers, this show rules.",
      "date": "Oct 9, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Great way to explore concepts touched upon but never fully fleshed out. Also: hilarious.",
      "date": "Oct 9, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Even better than Season 1, Lower Decks is really hitting its stride in Season 2. Manages to balance its light-hearted tone with the same wholesome exploration of humanity, inclusiveness, and friendship that has always been at the core of Star Trek.",
      "date": "Oct 9, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Strength to strength with each episode. This show manages to balance the adult themes and wholesomeness along with each episodes A and B plot (sometimes a C plot) all in a 24 minute episode. Best of all the whole thing feels perfectly like Trek.",
      "date": "Oct 8, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "It's the most incredible Trek in the last 20 years! Haters of the show are just outing themselves as having ZERO sense of humour.",
      "date": "Oct 8, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Lower Decks is pinnacle Star Trek wholesomeness, wrapped up in an absolutely hilarious, easter-egg-laden, NSFW tortilla, topped with comfort sauce. It just keeps getting better, and the STSP callbacks are just [chef's kiss].",
      "date": "Oct 8, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Incredibly funny and with a great reverence for Star Trek and everything that makes it wonderful. With Season 1s initial growing pains out of the way Season 2 hits the ground with all engines running while still somehow getting even better with every episode.",
      "date": "Oct 8, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "If you are a true Star Trek fan, you'll love the references to every series so far. Even TAS stuff is being brought out",
      "date": "Oct 8, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "I'm a lifelong Trek fan since TNG first aired, this is such a great show for fans. Produced  with so much love and attention to detail, a real delight for a Trek fan.\n\nBut also incredibly accessible to new or non-fans. To quote my non-fan friend who watches the show regularly \"It's just great writing and funny characters!\".\n\nIf you like workplace comedies like Brooklyn 99, or Parks and Rec, and enjoy animation, give a handful of episodes a try!",
      "date": "Oct 8, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Lots of inside jokes and Easter eggs for Trekkies to enjoy on top of a funny plot and great, charismatic cast",
      "date": "Oct 8, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Amazing and hilarious so far. Some of the best trek I've seen. My non trek fan wife even loved to watch it with me. Haters are really missing out on funny jokes, great characters and amazing references to past series in what is one of the greatest love letters to trek.",
      "date": "Oct 8, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Best New Trek in a long time",
      "date": "Oct 8, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "It's a blast of strange new worlds and a day in the life of an ensign isn't an easy one.",
      "date": "Oct 8, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Fucking great. Best star trek in a while",
      "date": "Oct 8, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Incredible show! As a Trek fan I love all of the jokes. Making fun of something you love feels so sincere, here. The writing is so great and the animation is beautiful. Here's to many many more episodes!!",
      "date": "Oct 8, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "If Fan service and Obscure Star Trek Canon had a transport accident and became one show this would be it",
      "date": "Oct 8, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "That's a long time Star Trek fan this is one of the best Star Trek shows I've ever seen. Continuously hilarious, the joke show appreciation and respect for the history and lore of Star Trek while building on it. It also stays true to many of the core tenants of Star Trek. Throughout the show there are themes of self-improvement, cooperation, and understanding. Season 2 has been particularly enjoyable and I cannot think of an episode that I did not find completely hilarious. In regards to many of the negative reviews, this show is not a children's show and it is a comedy so if you don't enjoy adult television or humour then this show is not for you.",
      "date": "Oct 8, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Lower Decks is everything anyone who has ever made a Star Trek joke could possibly want from a Trek show. \nIts Star Trek s**tposting writ large and with an animation budget to match.\nAnd yet still... Somehow it condenses and concentrates every bit of the Humanistic positivity that lives at the core of Star Trek.\nIt puts a big dumb grin on this Trekkie's face every Thursday night its on. \nHere's to another 8 seasons!",
      "date": "Oct 8, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Not suitable for children. Features full male nudity, kinky sex, etc.",
      "date": "Oct 7, 2021",
      "rating": 0.5,
      "episode info": "Season 2"
    },
    {
      "review": "This is......funny? This is ignorant. Wait,  not as ignorant as the professional reviewers.",
      "date": "Oct 7, 2021",
      "rating": 0.5,
      "episode info": "Season 2"
    },
    {
      "review": "What a piece of crap!!! What did they do to Star Trek?",
      "date": "Oct 6, 2021",
      "rating": 1.0,
      "episode info": "Season 2"
    },
    {
      "review": "Still my favourite new Star Trek show. Way better than STD or Picard in my opinion. With this season the series really improved. Interesting and funny stories and many references to the good old Star Trek. In some scenes the humor is still too blatant and dumb for me, but overall all is good. Another positive is that my fears about Mariner and Boimler from season 1 didn't come true. Mariner didn't turn into a total Mary Sue and Boimler isn't always shown as a complete idiot. I would recommend this show to any fan of the old Trek series, that don't mind the cartoon humor.",
      "date": "Sep 16, 2021",
      "rating": 4.0,
      "episode info": "Season 2"
    },
    {
      "review": "I liked season 1 and season 2 does not disappoint.  Great stories with fun humor.  Keep going!",
      "date": "Sep 15, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Really an improvement over Season 1! Much more consistent tonally; funnier; characters are more likable. May be relying a bit too heavily on previous canon, but I'm relieved to have something new from Star Trek to watch, and hope it keeps going several more seasons!!!",
      "date": "Sep 14, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Too much fascination in kicking in balls.",
      "date": "Sep 11, 2021",
      "rating": 2.0,
      "episode info": "Season 2"
    },
    {
      "review": "Amusing as fan fiction.  The funniest thing about the show is the idea that it's actually trying to pass as \"canon\"!  Once you get past that it's okay.",
      "date": "Sep 9, 2021",
      "rating": 2.0,
      "episode info": "Season 2"
    },
    {
      "review": "While not vastly different than the first season. So far season 2 of Lower Decks solidifies the strong character dynamics from the first season and bridges them over to another season all the while still wearing the Star Trek legacy on its sleeves. So far the season is having a bit more fun with both the meta and the lore of Star Trek, making it a must-see for any fan of animation or Star Trek.",
      "date": "Sep 7, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "It's just not funny. Even worse, it's effing cringe.\nIt also doesn't have anything to do with Star Trek except for the name and the looks. \nStay away and save your time.",
      "date": "Sep 1, 2021",
      "rating": 0.5,
      "episode info": "Season 2"
    },
    {
      "review": "Im a huge Star Trek fan and loved this! wasn't a fan of discovery for obvious reasons.... but this was refreshing.. reminiscent of family guy meets rick n morty",
      "date": "Aug 30, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "It's funny. I laugh a lot. I laugh a lot because it's funny. And it's fantastic Trek! That's the sum, folks!",
      "date": "Aug 29, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "This show, and specifically this season so far, is so much better, and smarter than I expected.  The show runners obviously love and know the source material, the humor on it's face is \"juvenile\" but has smart well thought jokes in the background.\nIt is depressing to see so many whine about new Trek as if it hasn't always been about diversity, equity, and justice.  Way to totally miss the point.",
      "date": "Aug 25, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Genuine belly laughs. Also loving the references to Next Generation lore.",
      "date": "Aug 23, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Great start to the season!",
      "date": "Aug 23, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "If I had a thousand years to ponder, I still could not come up with a reason why the New Star Trek Show Runners decided to take these shows (Lower Decks, STD (!), STP) in the direction they took them in.\n\"Sheer F***ing Hubris.\" (???)\nCould be, but in all likelihood it's something even less benign than that.\n\nWelcome to the Bronze......no , scratch that, ALUMINIUM Age of Television.",
      "date": "Aug 22, 2021",
      "rating": 0.5,
      "episode info": "Season 2"
    },
    {
      "review": "Season 2 continues the high quality of the second half of season 1. Definitely a franchise highlight.",
      "date": "Aug 22, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "What if Star Trek consisted of over emotional hyper-active self centered buffoons instead of competent officers?  This is the series that shows you.  Do you like a Star Trek show filled with nonsensical over the top plots stuffed full of disrespectful call backs?  This is the show for you.",
      "date": "Aug 16, 2021",
      "rating": 0.5,
      "episode info": "Season 2"
    },
    {
      "review": "Awful. Trying to copy Rick & Morty and failing. Why did they even make this?",
      "date": "Aug 14, 2021",
      "rating": 0.5,
      "episode info": "Season 2"
    },
    {
      "review": "Why do all the characters act like they're on crack? Not funny at all actually kinda of annoying.",
      "date": "Aug 14, 2021",
      "rating": 0.5,
      "episode info": "Season 2"
    },
    {
      "review": "NOPE. This show is not for me. It's too hyperactive, there is no time to let the story breath. Also can someone explain why Boimler is always yelling? Is that supposed to be funny or annoying because it comes off as very annoying. If you don't like Star Trek you might actually like this show.",
      "date": "Aug 13, 2021",
      "rating": 0.5,
      "episode info": "Season 2"
    },
    {
      "review": "Same old same old. Season 1 was not funny, it's a show trying to be other shows without having it's own voice. I rolled my eyes at every ST reference the show makes in EP 1. The fact that this is called \"Star Trek\" is very weird. The tone is totally off for being Star Trek and I am not excited for season 2. I barely got through the first episode.",
      "date": "Aug 13, 2021",
      "rating": 0.5,
      "episode info": "Season 2"
    },
    {
      "review": "I really enjoyed this season 2 premiere, I became really dark and funny. Really enjoyed mariner and the captain's relationship. This gets a 5/5 from me.",
      "date": "Aug 12, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    }
  ]
}