{
  "avatar_the_last_airbender": [
    {
      "review": "My favorite season of the show, very good and action packed. Leaves from the vine had me bawling though.",
      "date": "May 14, 2024",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Una verdadera obra maestra, la empezé a ver en 2024 y sin lugar a duda es una de las mejores series de la historia. La evolución de los personajes la historia y la acción es un 10. Me encanta la personalidad de cada persona y como se complementan cada capítulo que pasa. Ojala sacaran más Series así",
      "date": "Apr 29, 2024",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "It only gets better this season. Amazing.",
      "date": "Apr 27, 2024",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "It improves and everything that the first season did so well on.",
      "date": "Apr 19, 2024",
      "rating": 4.5,
      "episode info": "Season 2"
    },
    {
      "review": "Perfect in every aspect of each episode, S2 perfect continuation",
      "date": "Apr 17, 2024",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "An great continuation of the greatest tv show ever made even more emotional add toph a great addition to the show fantastic written book two earth just incredible",
      "date": "Apr 14, 2024",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "I wasn’t sure they could improve on the first season but they absolutely did. The animation is beautiful. The voice acting and screen writing is among the very best. The plot is intense, reflective, and beautiful. I promise you that although this was made by Nikelodeon, this will be one of the most emotionally intense stories you will ever watch.",
      "date": "Apr 10, 2024",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Somehow brings the world of Avatar to new heights in this season solidifying it as one of the best shows of all time. An almost perfect show with great characters in an expertly crafted world. Almost everything you might be wondering about the world is answered at some point in the show. The peak of fantasy.",
      "date": "Apr 7, 2024",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Another great season in a fantastic series",
      "date": "Mar 21, 2024",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Really good Show. Good rythm, good story, good characters and personalities.",
      "date": "Mar 3, 2024",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Season two is where the story really starts to become a masterpiece. All the little setups that we got in season one are getting proper attention and they're building towards the grand finale in season three",
      "date": "Feb 28, 2024",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "A master class of television. This stands with the greatest shows ever made.",
      "date": "Feb 23, 2024",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "My favorite season of my favorite series of all time. Or, sorry, \"book\". So I guess it's technically my favorite book as well.",
      "date": "Feb 23, 2024",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Very nice second season continuing the story and building upon it.",
      "date": "Feb 20, 2024",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "If you think a show can't get any better after the first season think again. Love the introduction to the new characters!",
      "date": "Feb 19, 2024",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "GALACTIC SLAY. \neven better than the first",
      "date": "Jan 3, 2024",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Even better than Season 1 and by introducing Toph adds another great character. And with Azula has one of the best villains.",
      "date": "Dec 28, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Best TV show in history. Animation, music, character development. 10/10",
      "date": "Dec 26, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Kocham i polecam mega to anime",
      "date": "Nov 22, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "It gets even better. Deeper mythology, topics, more drama and fun!",
      "date": "Nov 15, 2023",
      "rating": 4.5,
      "episode info": "Season 2"
    },
    {
      "review": "Delivered emotionally, introduction of awesome characters, and wonderful finale. Animation was a massive improvement from season 1 too.",
      "date": "Nov 5, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Bro but wow that's from nick🤩🤩",
      "date": "Oct 13, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "This is so fantastic",
      "date": "Sep 19, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "This is a masterpiece",
      "date": "Sep 11, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "This is a masterpiece",
      "date": "Sep 6, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "This is a masterpiece",
      "date": "Sep 6, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Brilliant animated series. 10/10",
      "date": "Sep 2, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "It's fun to explore the earth kingdom and the get intorduced to Toph Beifong. Really good season",
      "date": "Aug 15, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "An improvement over the first season. More important chatacter development, a great continuation of the story, awsesome fight scenes and another banger season finally.",
      "date": "Aug 2, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "This season is just as good as the last",
      "date": "Jul 29, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Amazing, if you like this thought you should watch 'the dragon prince', it's like a \"modern\" version of this",
      "date": "Jul 27, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "In my view, Season 2 of Avatar: The Last Airbender strikes the ideal balance in tone and storytelling compared to the other seasons. It doesn't have the overly lighthearted feel of Season 1 nor the heavy seriousness of Season 3, but finds a nice middle ground that works well. Although it doesn't introduce as many new major characters as Season 1, it features some of the most memorable scenes and moments in the entire series. While Season 3 delves deeper thematically, Season 2 still offers plenty in terms of character development, plot progression and emotional resonance. This season introduces and highlights on fan favorite characters like Toph and Azula, giving them arcs that elevate the story. Overall, Season 2 exemplifies what makes Avatar great - a fascinating tale told through a blend of comedy, adventure, gravitas and heart.",
      "date": "Jul 21, 2023",
      "rating": 4.5,
      "episode info": "Season 2"
    },
    {
      "review": "Is this even better than Season 1? I don't know. I just know both were amazing.",
      "date": "Jul 11, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "With seasons like this one, it's no wonder why Avatar: The Last Airbender is viewed as the greatest animated series of all time.",
      "date": "Jul 8, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "This series is one of the best ever on television. The first series started as a kid show, and quickly grew into more. This season takes off, gives you high adventure and a plot that spans the world. Fantastically written, Avatar season 2 just gets better and better",
      "date": "Jul 2, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Increible serie, atemporal. gran desarrollo de personajes, creación de universo y en general mi favorita",
      "date": "Jun 5, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "It's amazing, I doubt the Live Action will live up to the OG animation, let's see.",
      "date": "May 28, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Season 2 is as close to perfection as possible. Great villain, Great plot twists, Great tension, awesome character arcs.",
      "date": "May 24, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Season 2 of Avatar is even better than the first. The new additions to the cast are good. And the writing is even sharper.",
      "date": "Apr 20, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Greatest tv series I have ever watched and rewatched. I watched it as a kid growing up and enjoyed it a lot. Then during my teenage years, I rewatched it with my sister and my parents. Lately, I rewatched it at university with my Uni friends. Each time I appreciated a completely different aspect of the show. It is utter perfection in world-building, character development and the telling of a good story. All can appreciate the show regardless of age or gender or race. It is the epitome of storytelling.",
      "date": "Apr 10, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "I love the way it portrays the characters and humanizes even those who are in the wrong. I cannot name a single poorly-developed character. I could go on and on about how I admire it's philosophical and spiritual foundation. It encourages the pursuit of learning and living by truth, and it teaches that all life is sacred. I love how it takes the highlights of cultures and histories around the world and brings them together in a unified story of understanding. At the plot's climax, it teaches the importance of justice through non-violence. Throughout the story it shows the blessings of working hard enough to become a master while still maintaining a child-like spirit.",
      "date": "Mar 11, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Still my favorite animated show ever",
      "date": "Feb 1, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Probably the best season of a cartoon I've ever seen.  It is truly flawless in every way you can imagine and more.  I cannot even conceive the pure genius that went into every second of this, \"Simple kids' cartoon.\"  The story points both masterfully finish old plotlines while simultaneously setting up the most important arcs and plot threads of the series.  Also, Toph is the single best character, animation or live action, of all time.",
      "date": "Jan 22, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "a masterpiece of media",
      "date": "Jan 17, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "best season of the greatest show of all time",
      "date": "Jan 12, 2023",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "So uh, why didn't I watch this show sooner?\nIt's so good, the plot, the character development, the animation... it's all amazing!\nEVEN THE FILLER EPISODES(they are very few) ARE NOT BAD. Amazing show 15/10. Do you know how Rotten tomatoes thinks She-Hulk is such an amazing show and a \"refreshing breath for the MCU blablablablablabla\"? Well, the best episode in She-hulk does not even hold a candle to the worst episode of Avatar: The Last Airbender. Watch this show instead of any other show Rotten Tomatoes has bribed into promoting.",
      "date": "Dec 14, 2022",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "What a large step up from season one! Toph is possbily my favorite character in the whole show, but I go back and forth between her and the rest of the characters. Zuko's character arc in particular is so fun to watch, and his Uncle Iroh is hilarious. I genuinly didn't know what would happen in the finale, which is very surprising. 9/10, great job.",
      "date": "Dec 13, 2022",
      "rating": 4.5,
      "episode info": "Season 2"
    },
    {
      "review": "It's just 10/10 nothing more to say ^^",
      "date": "Dec 4, 2022",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "It is a amazing series and i really recommend it, they story and characters are amazing",
      "date": "Nov 19, 2022",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Just a Perfect Series in General for me, the zuko Charakter Arc Peaks in this Season",
      "date": "Oct 12, 2022",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Libro Dos: Tierra.\nLa serie continua con lo anteriormente visto y también lleva a que nuestro amigo Aang tenga que aprender el elemento tierra, el mundo planteado en esta temporada es maravilloso, cada capitulo cuenta (no hay capítulos de relleno) y sigue con la misma calidad que tiene la temporada anterior.",
      "date": "Oct 1, 2022",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "AVATAR: THE LAST AIRBENDER continues its winning streak with the heart and emotion of season 2, and just when you think it'll never stop entertaining everyone from start to finish, it ultimately ends in a shocker, and it'll leave everybody wanting more.",
      "date": "Aug 28, 2022",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Season Score: 89% |Ratings by Episode | {EP1: 7.5/10, EP2: 8.5/10, EP3: 9/10, EP4: 9/10, EP5: 10/10, EP6: 10/10, EP7: 10/10, EP8: 9/10, EP9: 8.5/10, EP10: 9/10, EP11: 9/10, EP12: 7/10, EP13: 7.5/10, EP14: 10/10, EP15: 9.5/10, EP16: 8.5/10, EP17: 9/10, EP18: 9/10}/ 18 Episodes = 89%",
      "date": "Aug 18, 2022",
      "rating": 4.5,
      "episode info": "Season 2"
    },
    {
      "review": "I rewatch this series once a year and it never gets old.",
      "date": "Aug 13, 2022",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Amazing show and series",
      "date": "Jul 1, 2022",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Yepp, worth it, very much so",
      "date": "Jun 2, 2022",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "This is my opinion for the best show ever.",
      "date": "Jun 1, 2022",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "A wonderful season that is as close to perfection as can be ... and Zukowoo",
      "date": "May 19, 2022",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Avatar the last blender",
      "date": "May 5, 2022",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "it pains me to think that when some people here the last air bender all they thin of is that dumpster fire of a movie.",
      "date": "Mar 16, 2022",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "In season 2, ATLA really takes off on a whole other level! Honestly, every time I rewatch this show I'm shocked at how well written everything is for a kids' animated series! The characters and world building are the real stars of the show! Watching ATLA with a friend adds so much to the experience, I highly recommend it!",
      "date": "Feb 27, 2022",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Season Two, delivers in it's expansion of the world delving deeper into darker, broader and more spectacular new ground, while continuing to tell a worthwhile story in \"Avatar: The Last Airbender\"",
      "date": "Jan 21, 2022",
      "rating": 4.0,
      "episode info": "Season 2"
    },
    {
      "review": "Absolutely wonderful. The character progression as this show goes on is amazing. everything from the animation to the storyline is flawless. Literally never misses a beat.",
      "date": "Jan 11, 2022",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "This season is a lot darker than the previous one and the creators deserve a lot of credit for tackling things like war and loss considering the young target audience. If the first book was about exploring the world this one really shows how it is to live in it. The character work for a bunch of characters, as well as overall plot progression, is super well done and the action is also more entertaining than ever.",
      "date": "Jan 3, 2022",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Every episode of this season is undefeatable. Aang and the Gaang return eagerly with all the angst, snark and action this series deserves, balancing serious topics with family friendly episodes and comedy. At this point there's no going back, you will probably love this series at this point regardless of any earlier misgivings.",
      "date": "Jan 2, 2022",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "The beginning of one of the greatest redemption arcs in the history of fiction. The story of Avatar follows the three act structure, this book being Act 2. Even ending with our main characters at their lowest point.",
      "date": "Dec 17, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Book 2: Earth is a definite improvement from the previous season (which I already loved quite a bit). \nWhereas, with season one, there were a couple episodes I was a bit iffy on, this season, there were only one or two episodes I thought we're just OK. The rest were awesome!\nWe got even more characters to know and love will still be able to focus on the characters we already knew in a way that was evenly spread out, the stakes this season were raised to even higher levels than the previous season, the emotional moments were abundant and each one hit harder than the last, and the action was just as good if not better than season one.\nI already really liked season one, I really freaking liked season two, and if this pattern continues, I'm going to freaking love season three! ONTO THE NEXT BOOK: FIRE!",
      "date": "Nov 14, 2021",
      "rating": 4.0,
      "episode info": "Season 2"
    },
    {
      "review": "It does a fantastic job of building on the original season.  There's a lot of great character development and themes at play.",
      "date": "Oct 21, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "One of the best television shows, not just kids' shows, of a generation. Avatar teaches grace, humility, forgiveness and other poignant life lessons with an optimistic outlook. From the hilarious references to former professional wrestlers turned Hollywood actors (The Boulder) to the absolutely heartbreaking and moving rendition of Leaves From the Vine by Uncle Iroh, this show truly runs the full gamut of human emotions. An absolute must watch.\n\nYou'll like it if: You have a heart.  \nYou won't like it if: You are determined to hate cartoons.",
      "date": "Aug 23, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "One of the best-animated shows ever.",
      "date": "Jul 19, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "There you go…that's what I call the best thing Nickelodeon has ever animated. I like this season so much more then the first season that it's frightening. And remember, I gave the first season a pretty positive review, but it's nowhere near the excellence of this season. The story here I'm not really going to go into so much detail about because once again, the over arcing story is great, just like the last season. But it's when the show is episodic that's really hit or miss. This season, however, was a grand slam in that department. The characters that they met weren't annoying, and if they were, not as annoying as they were in the first season, biggest example of that is with Jet. Speaking of Jet…he's back for this season, and is actually fixed, which is a sigh of relief. Let's be honest, the characters in a tv show is what is going to keep you interested, not the story. Avatar is no exception, and the main characters are great. Aang and Katara are still great, but Sokka might have just became my favorite animated Nickelodeon character this season. He went from a hit or miss funny guy to arguably the best character in the season. But hey, our new member of the group, Toph, is also a great character, especially with her being blind, that seemed like a great touch. Our new villains, Azula and the other two, are also great and insane, and are better \"villains\" but not better characters. Now, I think Sokka is my favorite character this season…but the best characters were Iroh and Zuko. I'm not gonna lie, but I cared about them a lot more then the main characters, and I still cared about the main group, but I thought what Zuko was going through was better. And I think that's all I have to say. If you liked the first season enough, you'll love this one, cause all the problems that season had are all fixed. Please, if you have the opportunity to watch this show, please do, you won't regret it. I know I haven't, and I can't WAIT to watch for season 3!",
      "date": "Jul 8, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Undoubtedly, Avatar is a great show. It is a fun adventure series to watch but it has its flaws. The story is well-written as well as the characters. I would even argue that Zuko is one of the best characters to ever be written. However, the love story is inappropriate for the characters' age and even for the target audience. Speaking of which, having a very young target audience it impacted the progression of the show, making it too fast. Those are some of the flaws I've found in this show but other than that I would say the show is great. The direction is fresh and original.",
      "date": "Jun 30, 2021",
      "rating": 3.5,
      "episode info": "Season 2"
    },
    {
      "review": "Flawless. Amazing characters, amazing plot, amazing finale, just PERFECT.",
      "date": "May 23, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "This season of Avatar: The Last Airbender takes everything you loved about the first season and cranks them up to 100, we are introduced to a new villain in the form of a teenaged Fire Nation Princess named Azula. Princess Azula is an absolute perfectionist and a true prodigy when it comes to her blue-fired firebending, and she is determined on capturing the Avatar and her brother Zuko. Team Avatar also gain a new ally in the form of a blind, smart alec, earthbending girl, these two new characters are welcomed editions to the show. We get to watch as Zuko struggles to do the right thing as the line between right and wrong grows increasingly more blurred for the estranged teenager, his story arc is easily my favorite this season Zuko goes through a tremendous amount of development throughout this season and I loved every minute of it. This season overall was completely perfect and everything you could've wanted out of the sequel season to season one, our characters are developing a lot through the season some for the best and others for the worst and I enjoyed watching every minute of it, both the good and the bad.",
      "date": "May 19, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "This season introduced some of the greatest characters in cartoon history. The combination of skill and teamwork is just incredible and amazing to watch!",
      "date": "May 9, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Iroh and zuko get 5 stars by themself",
      "date": "Mar 17, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Book 2 earth did improve over book 1 water, but I don't find it as much fun, as book 1.",
      "date": "Mar 12, 2021",
      "rating": 4.0,
      "episode info": "Season 2"
    },
    {
      "review": "Another great season to a great show. This season focuses on developing characters like Katara, and Zuko as well as introducing new characters. It also perfectly balances furthering the over-arching story, while having smaller episode-long stories.",
      "date": "Mar 7, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "I don't worry this season is great too. Just keep on watching!",
      "date": "Feb 6, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "In my opinion the best show of all time. A must watch.",
      "date": "Jan 31, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Not my favorite season of the show but still good.",
      "date": "Jan 23, 2021",
      "rating": 4.0,
      "episode info": "Season 2"
    },
    {
      "review": "This is my personal favorite season out of this masterpiece of a show. The introduction of Toph, Zuko trying to find himself, Iroh being Iroh, Sokka's stupidity and sarcasm, and so on, OH it was beautiful! I love the 3 dimensional feel of these 2D characters and how compelling they are. The animation was perfection as always. Seriously, if you reading this and haven't yet seen the show, stop what your doing and go frikkin watch it! :{)",
      "date": "Jan 12, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Much better than Book 1!\nJust so f*cking awesome!!",
      "date": "Jan 6, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Whoever gave this show anything less than 5 stars has absolutely zero taste and their opinion should be automatically invalidated. This may be the greatest animated series of all time. Period. My only regret is that I discovered it relatively recently. People have been telling me for years how great this show is, and the show still surpassed every expectation. Plus, Dave Filoni was a key force in season 1!!! Of course he was. Best show ever!!!!!!!",
      "date": "Jan 1, 2021",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Even better then Book 1, this is WAY too real. I've never seen a cartoon show with this much emotion and thrill.",
      "date": "Dec 16, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "It's not too late to try the AVATAR: THE LAST AIRBENDER series. \nSeason 2 easily picks up where season 1 leaves off, adds more characters and shows the the main characters growing into their roles. This fantasy series has a kind of timeless quality to it that makes its universe believable.",
      "date": "Dec 9, 2020",
      "rating": 4.5,
      "episode info": "Season 2"
    },
    {
      "review": "Even better than the first season. The Ba Sing Se episodes are especially groundbreaking and original, including themes of surveillance and disinformation. Appa gets his very own show and its wonderful.",
      "date": "Nov 26, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Poorly written characters with poor motivations. The story is bland and predictable. The praise comes from westaboos.",
      "date": "Nov 23, 2020",
      "rating": 0.5,
      "episode info": "Season 2"
    },
    {
      "review": "Avatar Avatar Avatar. When I was a little kid I saw the series and I really liked it but 6 years passed and it was still in the media so I started to sit down and start watching the series and wow it is simply amazing it is for both kids and adults and teens. And you simply after the series want to be grounded or air or water and it's unbelievable everything I say is true for season 1 2 and 3 as well\n\n\n\nThis is amazing",
      "date": "Nov 16, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Season 2 builds upon and improves everything that made Season 1 so great! It introduced Toph, Azula, Mai, and Ty Lee. It upped the ante for our characters while staying fresh. It maintained the fantastic blend of comedy, action and emotions that we loved from Season 1 while being able to be it's own, complete story.",
      "date": "Nov 9, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Avatar: The Last Airbender Season 2 becomes even more creative than the first season, making for an even better ride.",
      "date": "Nov 8, 2020",
      "rating": 4.5,
      "episode info": "Season 2"
    },
    {
      "review": "if you haven't seen this watch in now!!!\nSeriously, if you reading this and haven't yet seen the show, stop what your doing and go frikkin watch it! :)",
      "date": "Nov 6, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "TOPH HAS THE BEST CHARACTER INTRO. AND THE TEA SHOP IS BRILLIANT.",
      "date": "Oct 29, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "I can't think of a single reason for someone to give this show a bad rating. It's perfect for all ages. It's hilarious, action-filled, emotional, complex, thrilling. It's honestly just perfect.",
      "date": "Oct 27, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Absolutely brilliant. The incredible action, story, characters, and writing overshadow any minor nitpick. Upon rewatching, I have learned that the key to Avatar is Zuko and Iroh and their dynamic. Before discussing that, I will mention my minor issues. Starting off, there are a few episodes I don't like all that much. However, others like The Avatar State, The Swamp, and City of Walls and Secrets, so this is a nitpick. I also think Azula is underutilized and not as cool as people say. She feels more like the generic OP final boss archetype than the complex character she would become. Also, some of her lines are a bit too sassy and obnoxious for me, sounding like a high school popular girl. Long Feng is also just kind of there, but his voice is very cool. However, everything else is perfect. The story progresses very naturally, moving from finding Aang a teacher to trying to find out how to protect Ba Sing Se to the inevitable final battle that does not disappoint. Some of my favorite fights in the series are here. The showdown between Aang and Azula in The Drill, Toph's incredible victory in The Blind Bandit, and the final battle in Crossroads of Destiny are all amazing in their choreography and emotion. Episodes like Zuko Alone, Crossroads of Destiny, The Drill, Bitter Work, and The Tales of Ba Sing Se are beautiful pieces of media. The Tale of Iroh, Appa's kidnapping, and nearly all of Crossroads are some of the best moments in the series. This is just scratching the surface of Book 2's brilliance. However, the best aspect of Avatar has always been its characters. In this season, the characters are great. Aang has a very strong emotional dilemma in the series and he grows a lot. His trauma of losing Appa is truly heartbreaking and leads to a great subplot. Appa's disappearance proved that he was more than just a mascot and an important part of the show. The subplot gave us great episodes like The Serpent's Pass, The Desert, and Appa's Lost Days.  Katara also grows much more than in Book 1, which is actually saying quite a bit. Sokka is incredibly funny and has a few strong character moments. Toph is a fan favorite for good reason (though I think Sokka is overall the better character). I also really like Mai and Ty Lee and how their opposite personalities work off each other. However, Zuko and Iroh are the absolute highlight of the season. Iroh is my favorite character and Zuko is the most well-developed one. Their dynamic is by far the best in the show, and their relationship develops really well. This is Iroh's best season for humor, wisdom, and charm. The stuff with him and his tea shop is hilarious and his speeches are moving (R.I.P. Mako). The bond between these characters is so strong and it it why the emotional and epic moments work. One scene in Crossroads of Destiny is a good example. Iroh and Zuko are surrounded by evil earthbenders and Azula. The scene plays out like this: Iroh- Did I ever tell you how I got my nickname, 'The Dragon of the West\"? Azula- I'm not interested in a lengthy anecdote, uncle. Iroh- It's more of a demonstration really. (Iroh drinks tea, Zuko looks at him and smiles, and Zuko moves behind Iroh as Iroh breathes fire). This scene is one of the greatest in the show as it perfectly encapsulates how well Zuko and Iroh know each other and how well they work together. I recommend watching this scene, this episode, and this season. It is my favorite in the Avatar universe, even above Book 3. The only other seasons of cartoons I might like more are seasons 4 and 8 of The Simpsons. This season is nearly flawless and I am so glad Shaymalan didn't make a movie out of this. However, the whole show is great and all 3 seasons rock. However, this one edges out Book 3 for Zuko and Iroh's dynamic.",
      "date": "Oct 7, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "As you can see the rating. \nIt is a must watch.",
      "date": "Sep 28, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "The story builds in scope, the characters mature and are joined by top-notch additions, and the action never ceases to amaze.",
      "date": "Sep 18, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "This is a lot more exciting than the 1st book, and I really can't stop watching! 😂 The story is very compelling and all the characters (including the new characters) are really really amazing! The character developments are so captivating especially Zuko's, so I guess he's my favorite character now! The writing started strong and finished stronger with a very exciting ending, almost like a cliffhanger! The episodes are full of rich characterizations and some have gut-punch ending (like one of my favorite episodes: \"Zuko Alone\") Some episodes are heavy on funny moments too and I think that's one of the reasons that this show is so great. It perfectly blends humor and the serious and emotional aspects of the plot! Also, the action scenes are very thrilling to watch! Avatar is not just a cartoon show for kids, it's really so great that I think it shouldn't be labeled as just a children show. \n\nSpecial mention to my favorite episodes 😂\nThe Avatar State\nThe Cave of Two Lovers\nZuko Alone\nThe Chase\nThe Secret of the Fire Nation\nCity of Walls and Secrets\nTales of Ba Sing Se\nLake Laogai\nThe Earth King\nThe Crossroads of Destiny",
      "date": "Sep 3, 2020",
      "rating": 4.5,
      "episode info": "Season 2"
    },
    {
      "review": "Although the end arc of the season with the earth kingdom and Appas kidnapping was some of the weakest aspects of the series, the cliffhanger ending and betrayals were gripping and the characters of Azula and her crew as well as Zuko had great arcs and cemented them as my favorite characters along with of course Uncle Iroh. Toph was also a good addition to the series and her episode that focuses on the way different people learn and how a teacher must adapt really resonated with some of my academic experience. Add to that the compelling ideas about how a loss of a sense increases bending ability which alludes to the idea that bending acts as a sixth sense was a clever idea. When I first saw the season I must have watched it out of order because I remember is as my least favorite but upon re watching it is a significant step up from Season 1 and an ultimately great season overall.",
      "date": "Sep 1, 2020",
      "rating": 4.5,
      "episode info": "Season 2"
    },
    {
      "review": "Leaves from the vine got me crying to death.",
      "date": "Aug 26, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "best series in the word",
      "date": "Aug 23, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "The American television series that was commercially successful and acclaimed for its outstanding animation and plot. I've finally watched the whole thing from beginning to end and I can now say it's one of the best and most epic animated TV shows of all time. In a war-torn world of elemental magic, a young boy reawakens to undertake a dangerous mystic quest to fulfill his destiny as the Avatar, and bring peace to the world. Touching on mature themes like war, genocide and imperialism, it is also a series with a defined structure, full of compelling and well-developed characters and a funny sense of humor and good morals. Each episode is a great adventure in its own right, usually concluded with stunning action sequences. Great conclusion full of despair and hopelessness!",
      "date": "Aug 17, 2020",
      "rating": 4.5,
      "episode info": "Season 2"
    },
    {
      "review": "I love it, but season two is absolutely heartbreaking.",
      "date": "Aug 15, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "\"LA BANDIDA CIEGA APARECE\"\nEn el libro 2 de la historia de Aang vemos el avance de la aventura de nuestros héroes y el crecimiento de personajes que ellos ofrecen, sigo sorprendido de lo mucho que un personaje como Zuko puede ofrecer y evolucionar y realmente puedes empatizar con el, sus capas de complejidad en el pasado que le atormenta y no le deja vivir, simplemente es impresionante, a parte de uno u otro momento por allí, no creo que nada se compare en mi opinión a la entrada del nuevo acompañante del grupo Toph, una niña ciega que esta dotada con una extrema habilidad de tierra control y como sabemos mas adelante evoluciona para convertirse en la creadora del metal control, simplemente me encanta Toph, desde su diseño, su actitud y la voz que la dobla al español latino, es junto con Appa de los mejores diseños de la serie y por ultimo solo comentar hacia donde fue toda esta serie, que me di cuenta de lo poco que se comenta el estado Avatar y lo poco que se usa, porque el estado avatar en esta serie a diferencia de la de Korra es como una carga que Aang tiene que soportar por ser el elegido, mas que un poder que lo acompaña, esto cambia rumbo al final claro, pero no pude no notar esto y en general llegando al final de este libro, aunque no fue tan satisfactorio como el de la primera temporada, podemos seguir viendo la construcción de toda la trama como realmente cambia y evoluciona para un sorprendente final.",
      "date": "Aug 15, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "just amazing. would absolutely recommend if you haven't seen yet.(it is on netflix in the time i am writing this)",
      "date": "Aug 7, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "the season as a whole was really great. I loved the growth of all the characters. I also thought the episodes went better together now that its following a central plot. The last fight was really interesting. My favorite characters are iro and sokka. they're both really funny, but they have a purpose other than to make you laugh. iro is really wise and sokka is very practical. I also really enjoyed seeing zuko change this season. I feel like katara and ang are kind of boring. She doesn't have much of a personality besides being the responsible one, and neither does he besides being fun and the avatar. Toph was pretty annoying, but I hope she can grow more as a character next season.",
      "date": "Aug 2, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "A great evolution for the story, also the new characters that apear in this season are great and the complete final arc in this season is amazing i really love all that happen in Ba Sing Se.",
      "date": "Jul 9, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Absolutely Phenomenal Series",
      "date": "Jul 2, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Best show to ever be created",
      "date": "Jun 28, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Book 2 of Avatar: The Last Airbender surprises audiences with hilarious laugh-out-loud scenes, and a brand new character sure to become more peoples' favorite. Now that we get the strong person we wanted, you now have the right to not dislike the series.",
      "date": "Jun 25, 2020",
      "rating": 4.5,
      "episode info": "Season 2"
    },
    {
      "review": "This tv show had the best character development and amazing story line!!! they need to make more stories about the avatars and season 4 of Aang the avatar",
      "date": "Jun 22, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Absolutely AMAZING series! Exciting storyline and great character development based on a beautiful culture. ❤️",
      "date": "Jun 21, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Amazing in every way, anyone who hasn't watched it should definitely do so right away.",
      "date": "Jun 15, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "wow you think this show couldn't get any better glad i was wrong",
      "date": "Jun 12, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "With more incredible animation and humour, this season of Avatar is a worthy successor to the show's first season. Also, the ending is an incredibly brave one.",
      "date": "Jun 12, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "dude loved toph loved the earth bending twinkle toes cant say it enough this is timeless and i could watch it forever",
      "date": "Jun 8, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "\"The Tales of Ba Sing Se\" is one of the best television episodes I have ever watched. It's a microcosm for all that is right with this show. That some of the tales are a minute or two long and still whole, still enjoyable, shows the care with which this series was created. One of the videos I watched on this episode specifically talked about the nuance of the characters, and perhaps that's what makes them so interesting. Whatever it is, I spent all day looking forward to getting off work and watching an episode or two. I'm addicted to good writing.",
      "date": "Jun 8, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "A nice return to the best animated show of all time. Him trying to figure out water bending and then earth. It was beautiful, because we feel the urgency to learn how to control these elements. We also get a lot of great character development for Zuko. Overall brilliant.",
      "date": "Jun 3, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Such a good show. Fun, addicting, emotional and powerful in all kind of ways. The sophomore season focuses on evolving our main characters and adding a new bender to the group to round up the story development.",
      "date": "May 29, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "I rewatched this show that I remembered and loved from my childhood and found myself to be surprised by the amount of perfection this show has. Avatar: The Last Airbender has an incredible plot within all three of its seasons, beautifully played recursive themes, and perhaps the most perfectly executed examples of character development, especially through Zuko. Avatar is a series meant for all audiences.",
      "date": "May 27, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "With new cast members to guide returning favorites, the Second Season of Avatar lives up to the hype. 🌊🌍🔥🌪",
      "date": "May 24, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Season two manages to outdo the fantastic pilot season. It brilliantly balances philosophical moments, whimsical comedy, and engrossing fight scenes. The pace and change of setting are fast enough to prevent maintain an engaging story but slow enough to create rich and meaningful tales with deep underlying messages, especially for a kids' show. But the most amazing part of this season is the characters. Each one develops in a great way that doesn't feel forced or too fast and maintains complex and nuanced relationships with the others. Toph adds a fresh new addition to the group.",
      "date": "May 23, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Darker, more gritty and intense, and further developing the key characters as they go through lots of changes, Season 2 does everything it's supposed to do in spectacular fashion.",
      "date": "May 21, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Avatar has figured its pace out. It's nearly flawless.",
      "date": "May 21, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Season 2 is great.  I don't know if I prefer it to the first season or not but the season retains the great characters from the first season and adds some new favorites of mine.  The ending of season 2 (book 2) was amazing where the villians actually won and defeated the heroes.",
      "date": "May 19, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "An already strong season is followed up by a sequel season that literally improves upon every aspect of the show. At this point, anyone who has seen it knows this show will be immortal",
      "date": "May 18, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "The plot, the characters development, the life lessons, the amazing animation, the fantastic wonder that is bending. Even though this may be targeted at kids, you'll be surprised by how much a \"\"grown up\"\" can learn and cherish in it.",
      "date": "May 17, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Season 2 saw the introduction of Toph Beifong, who is such an intriguing character that adds so much to the show. I could go on and on about how her character serves the plot in so many ways. Konietzko made such a good choice when he decided to make her character a girl rather than a man, as it served to subvert a lot of gender stereotypes, which is a popular theme in ATLA, but also just added spice to the show. 10/10",
      "date": "May 7, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "A \"heroes journey\" wrapped in a  \"good versus evil\" told as a \"coming of age\" tale. An incredible story for a children's show. The directing, humor, themes, characters, music, culture, all of it.",
      "date": "May 6, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Wow, I never thought there will be a season of a show that was as good as the empire strikes back, this is one of the best seasons of all time, it has some of the best character arcs, episodes, figths and animations of all time, you can fight me in this but is personally my favorite season of Avatar, it has some great episodes as; Zuko alone, tales of Ba sing se, Apaa's lost days, the puppetmaster and of course the crossroads of destiny, Zuko's journey in this season is amazing the same for Aang, I think that my favorite episode from the whole series is Zuko Alone;because  this episode just goes so deep into my favorite character it tells you the story of a kid a scared kid that loses everything; his mother, his kingdom, and it says to the character that, his past will never be gone, his past will always be with him, his identity, and he must learn how to live with it, even if the society rejects him everytime he tries to do something good, that I like the most about this season is that for a moment all the characters are happy and you as a spectator want your characters to be happy but that will never happend because is not realistic at all, so I will give Avatar the last airbender a 10 out of 10",
      "date": "Apr 28, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "The second season outdoes the first! I did not believe this was possible! The story arcs of Zuko and Aapa are phenomenal. An exhibition of masterful storytelling and art! This show is for all ages and all times. Truly a gem!",
      "date": "Mar 20, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Even better than the last, it's a satisfying middle chapter with all the good stuff we expect, all leading to and notionally kicking cliffhanger.",
      "date": "Mar 16, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "somehow it better better the season one!",
      "date": "Feb 17, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Better than season one, which is saying something.",
      "date": "Feb 9, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Season two of the masterpiece show considerably extends the mythology and story, and really expands the characters and adds new ones!",
      "date": "Jan 22, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    },
    {
      "review": "Season 2 expands the cast, and delves deeper into the characters it follows. This is especially true with Iroh and Zuko, including a touching backstory following Iroh and his late son. Concludes with questions about the Zuko's motivations and a thrilling final episode.",
      "date": "Jan 10, 2020",
      "rating": 5.0,
      "episode info": "Season 2"
    }
  ]
}