{
  "star_trek_lower_decks": [
    {
      "review": "As the rating shows, I really liked this series. A comedy / animated series... some how mentally I just couldn't see it working but love Star Trek enough to give it a try.",
      "date": "May 2, 2024",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Shame to have such a thing in Star Trek universe",
      "date": "Apr 14, 2024",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "A little jarring with the humor mixing with the historical dramatic vibes of Trek but it grew on me!",
      "date": "Apr 12, 2024",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "Hated it. Not funny. Did not like even a single character. Everyone is mean and stuck on themselves. Also, why is everyone SHOUTING ALL THE TIME?! Feels like Red vs Blue or Rick and Morty, not Startrek. Where's the optimism? The camaraderie?",
      "date": "Mar 24, 2024",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "It's well made but I just don't find it funny. Mostly a lot of shouting.",
      "date": "Mar 23, 2024",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "It was finding its feet but it did a good job",
      "date": "Oct 7, 2023",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "This is a paramount plus series it's awesome",
      "date": "Sep 14, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Fantastic! Fun, unique and exactly what Star Trek needed.",
      "date": "Sep 9, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I am a life long fan of star trek, and I've noticed how I'm not the only one who thinks that season one of LD SUCKS so hopefully season 2 and beyond gets better (per the ratings here I'm hopeful)",
      "date": "Sep 8, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Fresh but nostalgic, lower decks continues to make me want more and more. Fantastic characters, exciting new missions, bringing new backstory and development to many previous races and ideas throughout the trek franchise. If you love star trek, you must love lower decks.",
      "date": "Sep 1, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The comedy is a mix of Star Trek references and watered down raunchy, adult cartoons like Family Guy or Rick and Morty. The episodic formula is simplistic enough to prop up the quirky characters and their antics. It's never too over bearing, but it's not a great celebration of Star Trek either.",
      "date": "Aug 22, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "Season 1 of Lower Decks is not fantastic, but it does get better with each episode until it's sincerely enjoyable.",
      "date": "Aug 18, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "I like Jack Quaid, I liked Star Trek, but I hate this.",
      "date": "Aug 17, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Overall, the characters attempt to live by the rules and ideologies of the original Star Trek universe however they attempt to make it a Rick and Morty style clone too often for laughs. There's not much depth to many of the conversations or arguments.",
      "date": "May 19, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "I love having a behind-the-scenes look at the Star Trek Universe!",
      "date": "May 8, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Hilarious comedic take on the \"Star Trek\" franchise that while pokes fun at it, tells stories with a genuine love.  The vocal cast is superb across the board, with Tawny Newsome giving Ensign Beckett the right mix of rebelliousness yet capability as a Star Fleet officer. What's great is that she is not a complete screw up but a genuinely capable officer that just plays by her own rules.  Behind the camera, the show runners have fun making fun of Star Trek but much of the humor is based on the actual shows, with even some of the original actors coming end for guest appearances.  Simply put, a Star Trek cartoon for Star Trek fans and a great watch all-round.",
      "date": "Mar 24, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Bit of a slow start, but it's really solid towards the end. I was definitely skeptical of the premise but they pulled it off.",
      "date": "Feb 16, 2023",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "Funny as hell.  Great writing; comedy and Star Trek story lines",
      "date": "Feb 7, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Awesome Series!.. Very Funny!",
      "date": "Feb 7, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Was skeptical at first but Lower Decks turned to my favorite Star Trek series … nice cruise through the Star Trek universe with cool characters and creative stories.",
      "date": "Jan 23, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "So much inside humour. Any Trekkie will love this show.",
      "date": "Jan 16, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "bad jokes written for a ten year old's humor yet not appropriate for kids. gave it 3-4 episodes but its too low brow and not tom paris low brow.",
      "date": "Nov 18, 2022",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Star Trek Lower Decks Season 1 takes it time to find it's stride but once it does it's a reference filled, great voice acting and hilarious Voyage",
      "date": "Nov 16, 2022",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "Uneven first season, but plenty to like if you're already a trekkie.",
      "date": "Nov 9, 2022",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "Totally underrated. I thought it was a cartoon for kids so i wasn't interested at first but im glad i watched it!",
      "date": "Nov 6, 2022",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Love! Fun to watch, and love call backs to Star Trek episodes.",
      "date": "Oct 30, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I think the most important thing is to not go into this expecting The Next Generation version of Star Trek: The Animated Series. It's a comedy bordering on parody set in the Star Trek universe. \n\nSeason 1 does start off slow, characters can be kind of annoying at first, but in the latter half of the season the quality really improves and it's worth sticking with as season 2 is excellent.",
      "date": "Oct 7, 2022",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "The first season of Lower Decks appears to be a collection of fan pandering moments and comedy and jokes ripped from every other cartoon comedy I've ever seen. The shows biggest credit is now doubt the style which is reminiscent of the TNG / DS9 era and does away with most of the eye gouging modern track art in which everything is either dark and dreary or so bright you can't see the screen.\n\nOverall a decent Star Trek show that whilst better than the likes of Discovery Etc pales in comparison to some of the better Sci-Fi available to watch.",
      "date": "Sep 30, 2022",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "Not sure why this doesn't have a higher rating. It's funny and I enjoyed it.",
      "date": "Sep 27, 2022",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "After some truly depressing attempts at Star Trek revival such as Discovery, Picard and all modern films, I was beginning to think the only Trek worthy reboot lied within the Orville. A completely separate enterprise.\n\nBut no, lower decks is great. TNG had an undercurrent of humour throughout and the format always had a duality of purpose, that the writers capitalised on for subtle laughs. Lower decks takes all the humour and absurdism from Star Trek of old, and creates a wonderful amalgam by combining it with the lore and feel of the universe. Well worth watching with an open mind.",
      "date": "Sep 24, 2022",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "I love this show! Not only does it give me the Star Trek I've always wanted. One that is serious but also makes fun of itself it also has superb animation. It has a sense of freshness and also nostalgia. Given a perspective from a lesser-known Starfleet ship and the grunts that keep it running. I can't stop watching it.",
      "date": "Sep 23, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "its a good show, entertaining. \n2 things keep it from being great though 1.) The Becket Mariner character is a bit too wild, 2.) Too many references to other star trek shows.\n\nAgain, its entertaining and worth a watch. Might take you a couple episodes to connect to the characters though.",
      "date": "Sep 21, 2022",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "If you are a fan of the original Star Trek and Next Generation this is the show for you. It's extremely loyal to the source material, sounds, etc. They invented the \"second contact\" and \"California class\" ships. Of course is an animated series and takes a crazy take on Star Trek. If you are not a trekkie and you are looking for show similar to \"Rick and Morty\" you will be disappointed!",
      "date": "Sep 17, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I know the reviews weren't it great but I just binge watched it and loved it",
      "date": "Sep 16, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "As a long time fan of Star Trek it was really fun to see this change of tone.",
      "date": "Sep 9, 2022",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Love it!!!\n\nHonestly when I first heard about Star Trek Lower Decks way back when I was less than enthused. However having seen some interviews with the showrunner and cast and then watching the first episode two times so far, I am totally digging this show.\n\nThe script is excellent, animation is great, all the voice actors are top notch and the world in which they live is one that I find fascinating and worthy of further exploration.  They understand what Star Trek is all about and yet are able to take it in a new refreshing direction, similar to  what The Mandalorian achieved over in the Star Wars universe.\n\nI don't understand why the audience score on this site is on the low side. This show rocks and I am totally looking forward to more episodes!\n\n---Pranakasha Matt",
      "date": "Aug 14, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show is a love letter to Star Trek and the fans. It is a celebration of the elements of campiness that is in sci-fi and Star Trek. While going on adventures that seem even too wild for Star Trek, they still maintain the heart of what Trek is about. The characters are us. A great addition to the Trek Universe.",
      "date": "Aug 8, 2022",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "I have not laughed so hard in a while with an animated tv series. What a great premise for a show. The Starfleet crew that work in the underbelly of the ship (Lower Decks) are what this ship focusses on. Each character is unique. For some of my kids this was their introduction to star trek, I know that is sacrilege. However even though new to star trek they loved it.    \nVoice acting is spot on. It is great to see something so established be able to make fun of itself.",
      "date": "Jun 23, 2022",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "It's a little misleading to call this Star Trek. It is more of a parody of Star Trek. Once I accepted this, I actually enjoyed the show.",
      "date": "Jun 16, 2022",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "It has its moments occasionally, but a lot of the comedic characters are just annoying. More and more shows recently have had the comedic relief characters just be loud and annoying, rather than actually funny.",
      "date": "Jun 4, 2022",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show is pure joy. It cuts deep into whatever your favorite version of Star Trek is. It is funny.   It has heart. It is well voiced and well drawn.  Enjoy this show for what it is - a celebration of all of Star Trek for the people who love it.",
      "date": "May 27, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I'm not a die hard Star Trek fan, so take this as you will, but I think this show is great! I love the crazy humor and the fact that I don't know the ins and outs of Star Trek but can still enjoy this means a lot. I love Rick and morty and this show reminds me of it without the immense gore and sexual notes. It's still an adult animation, and I love it!",
      "date": "May 19, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Cheap jokes, cliche characters, no real insight or thoughtfulness, didn't even feel like Star Trek",
      "date": "Apr 1, 2022",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "For a long time i didn‘t even try to watch this series because it is a cartoon and because ST Discovery and even ST Picard Season 1 were ridiculous, dumb and terrible.\n\nBut this series is the best Star Trek i have seen since Enterprise (2005)! This is a cartoon and the figures talk more logically and grown up than every self rightous-crybaby-figure from Star Trek Discovery. The design of the ships fits better to the „Next Gen\" universe and every episode that i watched so far was interesting, funny and just great.\n\nI hope there will be a lot of seasons!",
      "date": "Mar 16, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Screechy irritating unfunny principal teenage character is just so impossible to palate. After just a few minutes you are willing all the script writers to write her out of the show with the most humorous and gruesome demise. Yet another embarrassment to the franchise which is now on its knees.",
      "date": "Mar 9, 2022",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Sooooooooooooo pathetic and painfully unfunny...",
      "date": "Feb 28, 2022",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "This is the series that long suffering Star Trek fans have been waiting for after years of all the \"new Trek\" that really doesn't appeal to longstanding hardcore Star Trek fans who appreciate upbeat positive episodic TV that isn't always dark in nature or full of overacted characters who spend 50% of every episode delivering boring whispered monologues. This is finally one for the base of fans that new Trek seems to have forgotten about!",
      "date": "Feb 15, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Absolutely frenetic and funny as hell. It's full of fan service but even people who are not overly familiar with Star Trek will get some laughs, they just won't get the numerous callbacks to other series.",
      "date": "Feb 10, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Very funny. Nostalgia is subtle and is worked in very well and not too overwhelming. Can't wait for more.",
      "date": "Feb 4, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Fantastic work.  I hope they keep it coming.  This was a fresh take on star trek, which was much needed after Discovery.",
      "date": "Jan 28, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Always good with Trek.",
      "date": "Nov 23, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Started off rough but got there.",
      "date": "Nov 22, 2021",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Takes a few episodes to pick up steam, but nails it by the end of the season. It's campy, full of TNG references, and often hilarious. If Discovery and Picard don't feel like \"real trek\" to you, give this a watch.",
      "date": "Nov 17, 2021",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "Very enjoyable show. It makes fun of Star Trek in a way that's tasteful and, in my opinion, fresh. It's not serious or over the top. It's not SUPPOSED to be Star Trek. That's why in the intro, the ship crashes, nopes out of a battle with the BORG and is being chased by aliens. I think people need to take a step back and stop complaining because it's not \"true Star Trek\" and get over it. It's entertaining because it knows it's not supposed to be serious, and anyone who thinks it is, really needs to reevaluate themselves and not take everything so seriously.",
      "date": "Nov 15, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I could not even finish the pilot episode, as this is Star Trek in name only.",
      "date": "Nov 12, 2021",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Took me a moment to realize Boimler isn't the main character. Mariner is apparently the main character and she's rather unlikable. There's a lot of forced humor in this show, the only thing that made me chuckle was the intro.  There's a lot of meta jokes about the star trek series. \n\nThe cyborg was an interesting concept a human who has to fight for his emotions due to Vulkan technology. Sadly they discard that after the first episode and never touch on it again. They make this guy a nervous wreck, Boimler is a nervous wreck, the green one is an air head, and Mariner as said before is very unlikeable.",
      "date": "Nov 4, 2021",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Mariner..... someone actually wrote this character. I hope he's fired. I would watch the show, but Mariner is always on screen, annoying, cringe, so 2005, in a bad way.\nI just keep wondering, how someone got paid to write like she/he's in a high school. It is actually unbelievable, that people get paid for this ****.\n\n+ CBS pays for reviews here. Any 5 star, no profile pic, review you see here is an ad by CBS.",
      "date": "Nov 2, 2021",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Star Trek: Lower Decks proves that truly funny and heartwarming animated storytelling FOR ADULTS is possible in the star trek franchise.",
      "date": "Oct 29, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The attention to detail, the easter eggs, and the non-stop fun has me in love with Lower Decks.",
      "date": "Oct 29, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Would someone please make good Star Trek again?",
      "date": "Oct 25, 2021",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "my fav star trek series",
      "date": "Oct 19, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Lower Decks is the best thing to happen to Star Trek since Janeway dealt with Tuvix.\nIt is utterly hilarious, and at its core... Every bit, if not more, Humanistic than a considerable chunk of modern Trek.",
      "date": "Oct 15, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Hasn't mich to do with Star Trek but enjoyable?",
      "date": "Oct 15, 2021",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "Really funny, confirms a lot of cool canon and creates some new",
      "date": "Oct 9, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "True Str Trek fans can't ignore all those references. Specially those from TOS.",
      "date": "Oct 8, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "No sure what it is, but it isn't Star Trek!",
      "date": "Oct 6, 2021",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show is meant to be pastiche, but ultimately mocks and belittles the franchise. Puerile trash.",
      "date": "Oct 3, 2021",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Geared to those with the emotional intelligence of a child and the intellect of someone that can follow the plot of an episode of Star Trek, this show is a cringe-filled nightmare of bad writing and over the top voice acting. If you think The Family Guy is still fresh after all these years and still watch annoying tween cartoons, this show might be for you. I hated it.",
      "date": "Sep 23, 2021",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "A pale shadow of Star Treks once greatness. Could have been better with less cheesiness.",
      "date": "Sep 18, 2021",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "I like it.  So many animated shows focus on being weird.  Not this one.  This is a fun take on the franchise.  Good stories in Star Trek fashion with more humor put in.  Not quite a kids show but it is definitely good for teens and up. I hope it stays around for a while.",
      "date": "Sep 15, 2021",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "It's very hard for a show, with a fun premise and fun characters be bad or a waste of the audience's time. And while there are a few missteps in the first couple of episodes Lower Decks encapsulates all the fun of working in space, with all the heart that Star Trek Encapsulates.",
      "date": "Sep 7, 2021",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "Glad I was only on a Free Trial of Amazon Prime when I watched this.  This has the same problems as Discovery. This would appeal to a specific audience who wouldnt watch star trek in the first place, and the appeal would be pandering to their bias.",
      "date": "Aug 31, 2021",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Initially watching the pilot, I agreed with all the half start ratings and thought this would be just as bad as discovery. However, after rewatching it with more of an open mind, its fun, with intelligent jokes and story telling and often makes fun of itself. plus plenty of nostalgic characters stopping by.  (riker, dianna, and recently tom paris from voyager which actually gets a bad wrap and finds its footing after a few rocky episodes, okay like 4 but it seriously picks up (SPOILERS: and kes dies of somewhat soon so try and hold out)",
      "date": "Aug 31, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Im a huge Star Trek fan and loved this! wasn't a fan of discovery for obvious reasons.... but this was refreshing.. reminiscent of family guy meets rick n morty",
      "date": "Aug 30, 2021",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "The creator of this show could not even come up with something original and they keep riding the coat tales of previous star trek incarnation. It's just another poor attempt and the hacks at CBS are doing the same thing as Disney did with star wars by driving the franchise to it's death.",
      "date": "Aug 14, 2021",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Exceptionally well-writen series that isn't afraid to take shots at it's own IP. Funniest Trek out there IMO and the fact that it's animated lets them have amazing cinematic-scale action that feels epic despite each episode's smaller run-time. Grew up watching Star Trek and IMO it's the best Trek yet.",
      "date": "Aug 14, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "To date this is the best of the new Star Trek shows for me - better than Discovery and Picard. It feels a bit more like Star Trek. But it still has a lot of issues. The characters are mostly okay, except for Beckett (too much of a Mary Sue) and Boimler (the butt of every joke). The humor is pretty dumb and many jokes don't land or are annoying. Also because it's a parody I personally don't really consider this canon, otherwise I would have to compare it with the old Star Trek series and rate this with just one star.",
      "date": "Aug 12, 2021",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "I grew up with Star Trek and love sci-fi animation shows like Rick & Morty, and this one looked rather promising too. But I just couldn't stand it. It's more of the same pandering to women and denigrating men. The same old boring formula that clearly doesn't resonate with the majority of men or women. Waste of a good idea.",
      "date": "Aug 2, 2021",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Makes the same mistakes Discovery made.",
      "date": "Aug 2, 2021",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Imagine you wake up tied to a chair. As you come to, a person walks into frame; it's your mother...but wait, something is wrong. It's actually the world's least funny comedian wearing your mother as a skin suit. He then forces you to listen to his stand-up routine.\n\nThat's basically what it feels like to watch this painfully unfunny attempt at creating another animated foray into the world of Star Trek.\n\nThe universe of Trek is just window-dressing, a vehicle to deliver the \"jokes\".\n\nThe fact people got paid to make this is the real joke.",
      "date": "Jul 25, 2021",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Where to begin...\nStar Trek: Lower Decks, is comedy at it's worst. The premise itself has the potential to be interesting. \"What's it like for the people NOT on the bridge of a Federation starship?\"\nThe execution though, just falls flat. I'm sure there were a few moments that made me chuckle(I can't think of any off the top of my head), but for the most part Lower Decks just comes off as just another animated show that tries too hard to get a laugh and ends up failing miserably.\nBottom line, I cannot recommend watching Star Trek: Lower Decks unless you are a massive fan of modern cartoons and a massive Trekkie.",
      "date": "Jul 24, 2021",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Yup Funny Star Trek.\nOften a bit to flat Humor but it could be Worse.",
      "date": "Jul 17, 2021",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "I think the audience reviews for this show have suffered unfairly in the wake of Discovery. \n\nThis is a good show, with the capacity to get better. The characters are entertaining with room to grow, some of the setups are, well, sci-fi, which has been sadly lacking of late. Starfleet is lampooned, but not mocked, and is basically shown as a benevolent institution. Another refreshing change. Finally, in moments of genuine crisis, the characters get it together and act like Fleet, with nary a tear to be seen. \n\nThis show deserves a chance. I'm looking forward to the next season, and this is from someone who thinks Discovery and Picard should be put out of our collective misery.",
      "date": "Jun 27, 2021",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "New Trek has very much abandoned its ties to the pre-Kelvin adventures and despite its excessive nostalgic references to previous characters and episodes, 'Lower Decks' doesn't appear to have any intention in taking the Star Trek legacy anymore seriously than 'Discovery' or 'Picard' did (in my opinion).\nBeing animated, it has the potential to show us more alien looking lifeforms and locales than before, which it does - but only to eject some petulant slapstick from the various situations created. There's no tension because there's not meant to be. There's no reflecting on mistakes or growing as a character because that wouldn't be funny...\nLong gone are the days of going where no one has gone before, focusing on mad-cap, crazy reactions to whatever they come across, insulting both themselves and their discoveries at a ludicrously fast pace.\nIf you like comedy ala Rick and Morty, you're going to find this inferior to that series but still generally entertaining. If you're looking for Star Trek, something that has ideas and takes itself seriously - well, you might find it amusing in itself, but you're not going to find Star Trek here...",
      "date": "Jun 21, 2021",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "That show is not Star Trek.",
      "date": "Jun 1, 2021",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "If you're a Trek fan this loving tribute to the Trek universe is a must see. Wonderful.",
      "date": "May 16, 2021",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Funny and loving take on Trek tropes.",
      "date": "May 10, 2021",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "It's a very boring show desperately trying hard to be funny. The characters are annoying and the jokes are lame.",
      "date": "May 9, 2021",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "It's a fantastic series that pays a perfect homage/fan service to a rich Star Trek history. It is hands down the best 1st season of any Star Trek series and is a much watch unless you hate Star Trek or fun.",
      "date": "May 3, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I literally made an account on here just so I could leave this review. Ignore all the 1 star reviews, this show is sick. A great entry to the Star Trek canon and well worth a watch even if you've never watched Star Trek (and essential if you have).",
      "date": "Apr 19, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "this series is pure rubbish not one bit funny and it's all about making men look stupid and they need a strong woman to save them. This is also apart of the faketrek universe.",
      "date": "Apr 17, 2021",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Look... I'm an old Trek fan. My dad introduced the (TOS) show back in the 70s before any of the movies came out. When I saw Star Trek: The Motion Picture, though flawed, I was amazed. Then... Wrath of Kahn came out -my dad and I watched it on VHS but regardless, it hooked me. With the exception of ST 5, I'm a fan of all the movies and the TNG (and their first two movies). Needless to say, I'm an old-school fan. I know this show gets A LOT of FLACK from people like me, and a lot of the YouTube channels I subscribe to hate it and report on how much the viewers don't care for the show. Honestly, I don't associate the show with old Trek (or any of Trek series). I simply look at it as an animated show which features ST (and name drops lol) and I watch it and laugh. I don't think it does a disservice to ST. DS9, TNG, TOS -all stellar. I even watched the Animated series -back IN the 70s when it aired (granted they were re-runs, but still)! I say let the show have some fun with Trek. Oh, and in case anyone is wondering: I think STD and Picard are garbage... either of those two shows should be flushed. STLD is just silly, and I like it. Perfect? NOPE. But just goofy, funny, well voiced humor -yep.",
      "date": "Apr 14, 2021",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "A love letter to Trek fans of all ages. This is a breath of fresh air. An upbeat sci-fi show closer to The Next Generation and The Orville than the dark seriousness that most modern series tend to gravitate towards. If you enjoyed any of the Star Treks from the 1960s to modern day, Lower Decks will make you smile.",
      "date": "Mar 26, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Funny, well-written and well-executed by the animation team.",
      "date": "Mar 25, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I was hesitant to watch Lower Decks. After the disasters of Discovery and Picard I couldn't fathom watching another Trek show butchering everything that I care about. But I've been pleasantly surprised by the sheer joy of Lower Decks. The more I've watched, the more I've fallen in love with the characters and the format. I'm so glad there is a second season on the way.",
      "date": "Mar 23, 2021",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "I don't like Startrek at all, but I love this 😍. I need more R rated Trek in my life.",
      "date": "Mar 10, 2021",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "When I first watch the tailor my thought where this is going to suck.\nHowever when I gave it a chance I was pleasantly surprised how good it was.",
      "date": "Mar 8, 2021",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "The greatest Star Trek cartoon series ever!!!!!!!!!!!!!",
      "date": "Mar 7, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I absolutely love this show can not wait until it comes back !!!!!",
      "date": "Mar 5, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "As a Star Trek fan I am embarrassed by this show.",
      "date": "Mar 2, 2021",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "It's a little light weight, but if you want some laughs, entertainment and a touch of Starfleet mixed with some very irreverent in-jokes, gives this a try",
      "date": "Feb 27, 2021",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "A fun show in its own right, but really nostalgic and enjoyable for fans of the series.",
      "date": "Feb 18, 2021",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "As a long time Star Trek fan, I am really enjoying this show. A continuation of the tng feel while also adapting to modern tv sensibility's. While I feel they may go a bit hard on the trek references, I am excited to see where this how is going.",
      "date": "Feb 16, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This was unnecessarily placed in the star trek universe. Looking past that then it's is a decent sci-fi comedy with attempts to be similar to Rick and Morty",
      "date": "Feb 15, 2021",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "This show has sreat characters and funny situations. It's a fresh new take on the Star Trek franchise.",
      "date": "Feb 15, 2021",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Crude and unfunny. This is not worthy of the Star Trek name",
      "date": "Dec 24, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Not funny. Nor does it feel like Star Fleet, not even a parody version of it.",
      "date": "Dec 5, 2020",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "All the low ratings are weak! I love lower decks, all the references and how it's put together is wonderful. STSP material +",
      "date": "Dec 4, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "A lot of the references are definitely for Star Trek fans, but if that's you, Lower Decks is the best Star Trek has been since DS9.",
      "date": "Dec 2, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is the best star trek show since freaking TNG. It is fun fast paced wildly imaginative, I don't know what is wrong with critics and audience reviews my guess it it got hacked by butthurt star wars neckbeards.\nIf you are a casual scifi fan you will have fun if you are a deep trekkie you will have more all the shout outs to prior series and easter eggs makes this far better than discovery and picard combined.",
      "date": "Dec 1, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I thought it was a strong start, and I love the nods to old Trek and even to some of the fan stuff that makes its way into the show. Clearly, the writers know their audience. Trek purists and NuTrek haters will likely dislike it, though.",
      "date": "Dec 1, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "It's a well crafted show as a fan of DS9 and other trek shows it is easy to get into and actually addresses what fans have been joking about for years including what actually happens on a hollodeck and how the lower half of the crew reacts to near death",
      "date": "Nov 25, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Lucky enough for a show",
      "date": "Nov 21, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show is miles better than Discovery in it's first scene. This show has a fresh take on the Star Trek formula, while still pertaining to the aspects that make it Star Trek. The animation isn't my favorite style, but the world still feels like the one seen in Next Generation.\n\nI feel like this was very much targeted towards the millennial generation. There is an ongoing theme of figuring out your path in your career and the person you want to become. As well, there is a theme of eager to please your superiors. As someone who is only just starting out in my field, I definitely understand where these characters are coming from and I can relate to that fear of speaking out of turn or not presenting oneself as someone who deserves to be there.\n\nI really hope this show doesn't get torn down as a lazy sitcom parody. All sitcoms follow tropes, so I don't see why this show should be brought down based on that. Star Trek is based around a formula, and this show seems follows it much better than it's higher budget counterpart.",
      "date": "Nov 21, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Nice references to Star Trek but I expect to laugh in a comedy show and it never happened here.",
      "date": "Nov 18, 2020",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "it's not as as bad as i thought, it's actually really good, i just feel like people would have less of a negative reaction if the writers didn't manage to get the star trek license, and have to make this show as a parody, just like the Orville.\nthat way the show would stand on it's own and not really be associated with the star trek franchise.",
      "date": "Nov 15, 2020",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "Wannabe comedians...\nAll of the jokes are centered around deep knowledge of the series. Everyone else is left out.",
      "date": "Nov 9, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Awesome! Great comic approach! feels like star trek meets rick n morty.",
      "date": "Nov 3, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I love Star Trek. My partner doesn't care either way about Star Trek but loves adult animated shows. We both hated this. It's just a loud obnoxious mess that insults the franchise while also failing to work as a comedy. Avoid it like the plague.",
      "date": "Nov 3, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "All the bad reviews are from Star Trek fans who have expectations of this show to mirror what they are used to, and are upset that it does not. Take it for what it is: a light cartoon sitcom in the Star Trek universe. It's not meant to be taken too seriously.",
      "date": "Nov 2, 2020",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "An attempt to be a Star Trek parody was made, but unfortunately the writers can't decide if it's going to be a parody for adults or a children's show. Good episodes are few and far between rehashed children's cartoon tropes, resulting in a cringeworthy mess.",
      "date": "Nov 2, 2020",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "I didn't love the first episode, but I really enjoyed the rest of the season. I think as long as you don't take it too seriously.  Its fun.",
      "date": "Nov 1, 2020",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Effing brilliant. I've been happy with the franchise revival so far, but this is an absolute love letter to Star Trek. A *real* one, this time.",
      "date": "Oct 30, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I loved this show. It is clever and funny I can not wait for the next season.",
      "date": "Oct 29, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show is a interesting parody on the source material. Whilst having a very weak start the show finds a stable footing mid-season. Occasionally its fan service is a misstep or falls flat and sometimes the comedy falls a bit flat. \n\nWhen I feel like some silly Star Trek fun this show is there but I approach with trepidation.",
      "date": "Oct 27, 2020",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "Wow this has seen better days",
      "date": "Oct 27, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I've always thought animation was a great medium for sci-fi shows and Lower Decks takes full advantage of a lot of the things you can do with animated sci-fi, allowing for more alien-looking aliens, detailed sci-fi landscapes and a lot of scenarios you can't easily do with traditional live-action without having to invest in a ton of CGI.\n\nI would say the biggest thing that will probably throw people when it comes to this show is the expectation that it's more \"adult\" than it is.  It's probably about on par with Voyager/ENT in terms of general adult content like nudity/references to sex, though it does have a lot more swearing than either of those shows.  I do like that despite being a so-called \"Comedy\" show, it actually does seem to focus a lot on character development, especially with Mariner.  Even better, they have some great action.  The episode \"Crisis Point\", in particular, has some really gorgeous shots.  They do save the best for last though and the finale utilizes the animated format to its best advantage for an action-packed space battle that would have been very costly to do in a live-action show with the same budget.\n\nI do have a couple of complaints but they're fairly minor.  The first one is that certain things happen too fast in the show, episodes can feel a bit packed or rushed at times, which is understandable given the shorter format.  I really wish the season finale had been a two-parter.  The second issue I have is probably unique to me. I love the call-backs to everything in the show, but sometimes I feel the verbal callbacks are a bit more noticeable/overt to the point of being a little distracting.  The visual callbacks tend to be more subtle and I like them a lot more.\n\nOverall, really enjoying this show and looking forward to Season 2!",
      "date": "Oct 26, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "I'll admit it gets off to a slow start, but by midseason through the season finale the laughs are frequent (and clever!). There are also more than a few touching moments alongside throwbacks and cameos. Great for fans of Star Trek (like me), but also connects with non-fans (my kids).",
      "date": "Oct 25, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Committed Star Trek fans probably do catch the references to the Star Trek shows, but hit or miss if they find them enjoyable. The in-universe jokes and references likely are funnier to people who have been involved in the Star Trek writing and production process, rather than to the average viewer.",
      "date": "Oct 25, 2020",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "An absolutely stellar addition to the Trek franchise, and a bold direction for a Trek series.  The comedy is sharp and a delight for veteran Trek fans. The tie ins to the animated series of the 1970's is is nothing if not brilliant.  LD is a love letter to the fans and it is just beautiful!",
      "date": "Oct 25, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Light-hearted, generally optimistic (as Trek should be) and fun. Sometimes it's a bit too \"gory\" for my taste, but because it's animation it doesn't really distract from the rest of the show. I love the characters and their dynamics. The stories are nice homages to classic Star Trek but always with a funny twist. Ignore the haters, try the first three episodes and you'll see if its something for you.",
      "date": "Oct 22, 2020",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "Fun and engaging. We finally get an \"everyman\" lead in the ST franchise.",
      "date": "Oct 22, 2020",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "After a poor opening and eye-rolling second episode, I'm shocked and very pleased to rate Lower Decks as highly as I am at the end of the first season!\n\nThe best parts of Lower Decks definitively come from the Star Trek setting but it's a series that is held back by a genre (\"adult\" cartoons) where juvenile comedy is the least interesting part. When Lower Decks puts its focus on more Trek-like adventures, and makes jokes based on familiar Trek-like situations instead of superficial references and callbacks, it really shines. It has some very likeable, vibrant, well-acted over-the-top characters, but suffers from glazed-over character development that intentionally resets at the end of every episode, with the same couples and challenges re-run several times. The last episode is definitely the pinnacle of the show, which has a real threat, real stakes, great callbacks (The Titan!) and character development. It has all the Lower Decks silliness going on but doesn't let it hinder the great drama and characterisation throughout the episode. \n\nThere is some real heart and definitely some real Star Trek here, and I'm happy it's being renewed for another season. I hope the creators refocus their efforts more on ridiculous space adventures and allow the characters to develop in a more serious, fruitful way. Keep the silliness, but create some real drama each episode. If they do that, they could really achieve a colourful comedy Star Trek for everyone.",
      "date": "Oct 20, 2020",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Lower Decks is more \"Star Trek\" then Discovery or Picard. Every episode they have a standalone adventure and still have some character development. It is enjoyable if you let yourself loosen up a little bit and realise that this is a COMEDY show. Unlike in Discovery or Picard, here some errors/mistakes can be excused. Lower Decks lacks all of the wannabe clever writing that is in Discovery or Picard, which is a good thing, it is one of the main pros of this show. A lot of jokes will go overhead of non Star Trek fans, but this show also has a lot of universal situational humour.\n\nIf you expect something like the original Animated Series, then this is not for you, at all. This is pure comedy.",
      "date": "Oct 19, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Silly, but clearly written by people who love Star Trek. Refreshing change from STD and Picard.",
      "date": "Oct 19, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This season for me felt like  A very strong 1st season for an animated star trek series. Lower Decks did a good job   Introducing the character dynamics,  Between the main characters and even the bridge crew, managed to keep a Star Trek feel even though it was a comedy,  and at some points actually made me laugh which is hard because people compare me to a Vulcan when watching comedy.  I may find something's funny and just sit there without laughing or showing any emotion to convey that I found it funny, but this show actually had me laughing out loud in certain moments or had me geeking out over little easter eggs and references to past iterations of Star Trek. The show even made me feel empathy at the end of the season when they killed off Shax.  My only gripe with this show that keeps me from giving it the full 5 stars is its pacing seems a bit rushed due to its short run time, The dialog sometimes feels rushed and so does some plot lines which sets back the show in certain aspects. But this fact is not to major for me",
      "date": "Oct 19, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "I think the current audience score for this season (41%) is unfair as it was rated this way within the first week of the season's release. The season takes a few episodes find its feet, so the second half of the season is much funnier and more engaging than the first half. I *really* hope that the second season carries that momentum so we will get more!!",
      "date": "Oct 19, 2020",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "I love this show. It does help that I've seen every episode of every Trek series and all the movies so I catch all the references- it's a show by Trek fans for Trek fans, which is both satire and homage. Good series that achieves exactly what it set out to. Ignore the \"all New Trek bad\" edgelords.",
      "date": "Oct 18, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "No idea why the score is so low! It's fun, funny, well written, great animation and good characters. Must see",
      "date": "Oct 18, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I absolutely LOVE this series! All the references to previous seasons might be my favorite part!",
      "date": "Oct 17, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Lower Decks is an awesome show.  The antics that the junior officers get into, are not too dissimilar to the stories my father would tell me about his time in the US Navy.  The humor is natural, the lines witty, and overall the show is perfect.",
      "date": "Oct 16, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Quirky and funny but still rooted in the Star Fleet ideals we have come to know and love.",
      "date": "Oct 16, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "More character growth and story than picard. It doesn t take itself serious which make most modern Startrek series feel cringy and flat. Good humor,  and a ton of references.",
      "date": "Oct 16, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Full stop, it is completely unlike any Star Trek you've ever seen, and yet... somehow, it's familiar and comforting. There are parts that seem vulgar, jarring, and unexpected, but - strange - I find myself entertained and endeared to the characters and the show. Perhaps it was The Orville that primed me for this; that and all the Rick and Morty I watch already? It's definitely it's own show, and while I acknowledge that it isn't for everyone, it brings me joy, and I hope it goes for at least six seasons and a movie.",
      "date": "Oct 15, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Just funny, playing with Star Trek genre, not so serious like (well, is there comedy Star Trek?) maybe predictable, but I've got real fun watching stories.",
      "date": "Oct 15, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Something I was kind of hoping would reverse the current Star Trek TV trend would be an animated comedy run by Mike McMahon.  Sadly, there was not much comedy to be found in this animated comedy.  Sure, there was some cleverness.  But not many laughs at all.  Perhaps 5 or 6 over the course of 10 episodes.  And because I wasn't distracted with laughter I realized how bad and annoying the characters are.  Mariner is a fast talking uninteresting \"bad girl\" who we don't care about and Boimler is an enthusiastic gullible moron.  Producers claimed the characters could not be dumb as they were in Star Fleet.  Yet...   But then we were told a lot of things by producers.  They said this was an \"Adult\" comedy.  Ha!  I would let a 9 year old watch this.  \n\nThe show seems mainly geared for fans as the bulk of the jokes are just fan-gasms more than funny gags.  It's filled to the brim with Trek references.  But if you aren't that familiar with the lore those references and gags will go right over your head.\n\nAvoid avoid avoid.  Not funny.  Not good.",
      "date": "Oct 14, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Star Trek: Lower Decks is a classic return to the camp of The Original Series and the early seasons of The Next Generation. Paying homage to much of Star Trek, and full of references to various moments in Trek History, it is fun at times and falls short, but is generally entertaining. If you want mindless entertainment that seems like it should be a Seth MacFarlane animated show, this is for you.",
      "date": "Oct 12, 2020",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "I will admit, I'm one of those who was skeptical about this show at first and really didn't care to see it (thanks to the lousy and pessimistic attitude of Star Trek: Discovery and Star Trek: Picard).   I didn't even start watching it till late in the season.  What changed my mind is the people who also weren't fond of the other series giving this one some praise.  I decided to give the show a shot and I wasn't disappointed.  It's not perfect but I must say, Star Trek: Lower Decks is truly a fine addition to the Star Trek franchise.",
      "date": "Oct 12, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Quite possible the most banal, insipid, unintelligent member berry approach to a series I've seen. It's not a love letter,  it's an insult to a once-proud franchise that had standards.   Obnoxious unlikable characters reflecting Star Fleet as a joke.  The seriousness to ethics, duty and responsibility that radiated through all TNG era Trek. Gone. Add to that we're assaulted with awful character in the name of Mariner Beckett.  She's the most unlikable, spastic, cocksure character I've ever watched.  The show has zero laughs and even less intelligence.  Not for the classic Star Trek audience.  More for the Rugrats meets Rick & Morty. If you are looking for the intelligence of \"only Nixon could go to China\" or struggle of wills against the back drop of torture in that \"there are 4 lights\" you won't find it here.  Beware the idea that this is a return to classic Trek. It's not. It may have the uniforms and set design. It doesn't have the philosophy nor the spiritual center of series. The only things Trek about it are the constant references and set design.  In short you'll recognize the universe, but not how the characters conduct themselves.   Hyperactive, derivative, devoid of anything substantive other than fan service with little to offer in it's effort to appeal the adult swim and marvel crowd.  Avoid at all costs.",
      "date": "Oct 11, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Welp, the series has finished its 1st season. The finale was epic, the show as a whole had some slow-ish moments, but was overall satisfying, & I really, REALLY hope we get more!\n#LiveLongAndHangLoose",
      "date": "Oct 11, 2020",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "Nu e chiar Star Trek dar e bun",
      "date": "Oct 10, 2020",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "It stumbled in the beginning with some rocky chemistry between characters but brought itself together after the 3rd episode. This show is now my favorite show on CBS all access. Can't wait till season 2.",
      "date": "Oct 10, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Its just great. Awesome references, good jokes, and good voice acting.",
      "date": "Oct 10, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is exactly what Star Trek needed. A fun, enjoyable, light hearted story line that can be watched over and over again. This series takes the brighter more jovial side of Star Trek and really makes it front and center. It keeps its ability to sneak in morals and themes without making them in your face. It's not dramatic and heart wrenching where you find yourself weeping or screaming into the pillow depending on what's happening. I found my self watching these episodes over and over and finding new details that called back to all its predecessors, and yet made the Star Trek universe fun again.",
      "date": "Oct 10, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It is not Star Trek and it isn't funny strike three for Kurtzman",
      "date": "Oct 9, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "The first few episodes were the hardest to get into because of the tonal shift from what I'd come to expect from Star Trek as a whole. After the initial shock wore off, not without a little help from the people at Trek Culture on YouTube, I realized there was a pretty good show beneath the admittedly crass delivery of some jokes.\nThe sheer amount of deep cuts and nods to Trek of yore is staggering to the point of having to have memory-alpha opened in my browser while watching, yet usually without distracting from the plot of the episode. Most of the characters are enjoyable and I found myself wanting to see more of everyone, especially the B plot characters Tendi and Rutherford.\nNow that the 10 episodes of season 1 have aired I find myself eager to return and watch it again. I'm really looking forward to the second season as well. If you decided to skip out on the show because you bought into the hate online, I'd encourage you to give it a go and just be ready for a tonal shift, mixed in with some clever writing, and a deluge of references to Star Trek canon. Also, if there are any Final Space fans out there then this is definitely right up your alley.",
      "date": "Oct 9, 2020",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "Having watched all of the episodes, I thought it was pretty good. Not exactly emmy worthy, but certainly not a sh*t show that people make it out to be.",
      "date": "Oct 9, 2020",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "I love Lower Decks season 1 it fresh and really funny, All Star Trek fans should watch this show.",
      "date": "Oct 9, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Only watched the first three episodes. Managed to fall asleep during each of them...literally, not figuratively. If you want a sci-fi space opera that adds comedy, try The Orville. It's the best Trek that's been on TV since DS9 ended. I thought that Discovery was bad, but this hits a new low.",
      "date": "Oct 8, 2020",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "True captures the spirit of Star Trek. It's funny and serious at the same time and still respects the canon like no show in the past years. If you know what IDIC means you'll give this show a chance and fall in love with it.",
      "date": "Oct 8, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "At first I was skeptical I was going to enjoy this show as honestly the trailer didn't look up to much. But I tuned in, and was pleasantly surprised by the first episode. From that point on the show just improved and improved every week. Was it perfect? No, but it was damn near close and it's easily the strongest first season of any Trek show. The characters are fantastic and diverse, and while most of the attention is on Boimler and Mariner, Tendi and Rutherford get plenty of time to shine as well. The whole season feels like a love letter to 90's Trek while carving out its own niche in the franchise, and I cannot wait for season 2!",
      "date": "Oct 8, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I went in with zero expectations and after 10 episodes I can confidently say.. this is the BEST Trek series in 19 years. Well done to all involved.",
      "date": "Oct 8, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Humorous take on the star trek universe. \n\nGreat animation, great writing, and amazing character dynamics.",
      "date": "Oct 8, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It's THE best Star Trek Show, definitely. It rewards being a fan and having seen all the other shows and movies, it's amazing.",
      "date": "Oct 1, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Was happy with the first episode and wondered what all the hate was about but as the episodes went on... it lost me. I really wanted to like it but it feels a bit too desperate to be Rick and Morty cash in rather than being itself",
      "date": "Sep 30, 2020",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "I really like the references to characters and things that happened in all levels of trek. It's a little over the top sometimes but I really enjoy it.",
      "date": "Sep 29, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "You gotta let a show breathe. We're 8 episodes in and Lower Decks is really finding itself. Taking more risks and giving the best kind of Fan Service. I'd also say it's the most Old School Trek thing to come out since Voyager went off the air. A legit baton carrier for the series.",
      "date": "Sep 29, 2020",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Absolutely hilarious take on the Trek-universe that still pays homage to all the canon-shows.  Actually provides the most fun POV as we are inserted into its madcap adventures from performing \"2nd Contact\" duties (very poorly), dating Salt Vampires, to jackin Romulan Birds of Prey.  \n\nSpeaking of which, you're along a fun merry ride of slightly-superior \"Family Guy/The Tick\" level animation - which we're totally happy with as the visual vehicle for the storylines - BUT THEN we get hit with some EXTREMELY badass graphics with the aesthetic of a Full-on video game.\n\nAll in all, I absolutely adore this playful yet serious entry into the Star Trek Universe.",
      "date": "Sep 28, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Really funny so far. More importantly, the show manages to develop characters and introduce conflicts and exciting action while maintaining the light-hearted comedic tone.",
      "date": "Sep 27, 2020",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "The first episode made me think this series was not going to be that great but after watching it more and more I began to love this show. I love the Easter eggs and the comedy.",
      "date": "Sep 27, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Writing this review after watching episode 8. THIS SHOW IS SO MUCH FUN! The characters, situations and settings are so familiar and provoke such a warm and cozy feeling... like it's home... it's the TNG era! No alternate timelines, no reboots. Jokes are not the smartest, but they hit right in the spot. Many of them are Star Trek things I have been making fun of in forums or conventions for as long as I have memory. This is so different from what we are used to, but for me it's really entertaining and I love it.",
      "date": "Sep 26, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Like many reviewers, I wonder who the target audience is intended to be? Children on Ritalin? People who claim this is pure Trek must be enjoying some of Colorado's finest product. Trek was always about teamwork, cooperation, and the best of humanity. These characters are boring, spastic, and the officers on the Cerritos treat the junior officers like garbage. That would never happen in Classic Trek, unless you're a Ferrengi. If you love TOS, TNG, VOY, DS9, or ENT, avoid this show like Rigelian Fever.",
      "date": "Sep 25, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "This is a fun Star Trek show that is episodic and light.",
      "date": "Sep 24, 2020",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "I am a child of the 80s/90s, so I grew up with TNG-era Trek. Lower Decks manages to bring back all the feels from this era, as well as a well-needed injection of humour into the franchise as a whole. The show is a new entity for the franchise, and while it has some flaws (not enough cameos for my liking), it is an entertaining half hour of television. Well worth a viewing if you are fan of Star Trek and comedy cartoon shows!",
      "date": "Sep 23, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Tiresome characters talking too fast and shouting too much. Obvious attempt to take some of The Orville's audience, but it's not gonna work. The humor isn't there, the writing quality isn't there. And the Rick&Morty style doesn't help it one bit in my view - I never cared about R&M and now that I know this is similar to it I probably won't ever give it a shot.\n\nOnly way this is good is if you're bored out of your mind.",
      "date": "Sep 22, 2020",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "This is a fun show! I am a life long Star Trek fan, growing up in the 80's with TNG. I have not liked what has happened with the franchise since Nemesis, J.J. Abrams' reboot, and Discovery. However, this is a breath of fresh air for the franchise.",
      "date": "Sep 20, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Star Trek Lower Decks is a lot of fun. It's the right balance of Star Trek and comic relief. I hope it continues on as it's perfect to unwind and have a laugh. It's a good counterbalance to Picard (philosophical) or Discovery (militaristic). And it keeps most positive Star Trek values alive.\n\nThe negative reviews aren't wrong per se. The series is likely hit or miss depending on your protectiveness or conservatism about Star Trek form. But on substance it's first degree fun with second degree good positive values.",
      "date": "Sep 19, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "love it! do not know why people been super harsh on it!",
      "date": "Sep 18, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The Star Trek show we never knew we needed.",
      "date": "Sep 18, 2020",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Its an hilarious take on star trek and a breath of fresh air from the new gritty doom and gloom the series has been taking with it's television outtings. I don't understand star trek fans these days. They complain theres no trek on television then they get trek on television and complain it isn't real trek. Fuck em they arent ever going to be satisfied. Great show!!",
      "date": "Sep 17, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "A great addition to the star trek universe. Ignore the bad reviews, this is worth watching.",
      "date": "Sep 17, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Just not good. Mary Sue Mariner and Dumb White Male Sidekick that is the butt of every joke.",
      "date": "Sep 11, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "It's terrible. It's so bad I have to turn it off if the wife enters the room. I'd be embarrassed to seen watching it. \n\nThe coughing scene at the start of episode 3. So rubbish.",
      "date": "Sep 11, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Much better than some of those user reviews will let you know. Funny, heartfelt, crazy and yet true Trek at its core.",
      "date": "Sep 11, 2020",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Utter Crap.\nTired. \nPathetic.\nDesperate",
      "date": "Sep 11, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "STINO Star Trek In Name Only\nThis show is star trek on the surface only. If you only ever liked Star Trek on that surface level then you might like this show, but if you ever saw past the phaser battles and the space setting you'll be dissapointed. You won't find any of that here, every time it does start to scratch the surface someone farts, or the Mary Sue character does something annoying or the wimpy male character is acts in a cringy fashion. \nUltimatly, don't waste your time.",
      "date": "Sep 11, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Those guys in command of Star Trek did not known a shi,,,, of what star trek really is.",
      "date": "Sep 10, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Why call this Star Trek?",
      "date": "Sep 9, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Genuinely funny, it's great to watch Star Trek in a format where it's not putting itself on a pedestal. It's too busy knocking them over to bother with that!",
      "date": "Sep 8, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Though manic at times, there is a good mix of parody and callbacks to the Star Trek universe. I expect it to be divisive to fans who think it mocks Trek unfairly, but I get the sense that the writers are huge fans of the original Treks - I could not express the same sentiment while watching ST:Picard or Discovery.",
      "date": "Sep 6, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Not a good star trek; not a good show either. Insulting.",
      "date": "Sep 3, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I'd say it's starting to find its feet after seeing episodes 3 and 4. We'll see what happens with the rest of the season.",
      "date": "Aug 31, 2020",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "I really don't understand all the bad reviews. This show is awesome! Light-hearted, I really enjoyed watching it. Maybe not as good as Rick & Morty, but as fun as Family guys / Simpson / American dad / Solar opposite. Worth 4 stars but put 5 to compensate :p",
      "date": "Aug 31, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "If they had done this without the really terrible comedy they may have had something, only reason it's not lower is nostalgia value of the aesthetics they used",
      "date": "Aug 30, 2020",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "Fantastic show. Great characters and a lot of light hearted poking at old Star Trek tropes. Some seem to be mad that this is not set in the same tone as the real life Star Trek shows. It is an ironic and comedic take on Star Trek and I love it. If you take this show for itself it is a lot of fun and I highly recommend to watch it.",
      "date": "Aug 29, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This i the exact opposite of Star Trek is suppose to be.",
      "date": "Aug 29, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I know there is a lot of hate for this show, but I like the irreverence of the show and that it doesn't try to be another dark version of Star Trek. The humor is adult level, I can see the influence of Rick and Morty. I say don't tie your self down too much on the constructs of Star Trek in general and just enjoy the humor and Easter Eggs dropped in each episode.",
      "date": "Aug 29, 2020",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "A great tribute to the Star Trek Universe. I appreciate the lighthearted take the shows creators employ here. The newest round of Star Trek live-action shows have tried to \"Game-of-Thrones-ify\" the property with these long, arching storylines, and it's just not Star Trek. It's great that this show takes a bit of wind out of those sails and lampoons itself. Star Trek TOS was an interesting, thought-provoking and kinda silly show. I think Lower Decks continues in that proud tradition.",
      "date": "Aug 28, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The story lines overall are pretty good; however, they could cool it a bit on the warp speed shtick and work a bit more on character development, ensuring that each really starts developing an independent personality. I mean, yeah, I get it, it's a comedy/spoof, but don't you  want to really see some unique characteristics? That's why \"character\" is in the word!",
      "date": "Aug 28, 2020",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "I wanted to like this show, and being written by Mike McMahan, I was optimistic it could be good. Unfortunately, it is unfunny and disappointing. The characters are often vain and mean-spirited. There's no character development, no hero's journey. Caustic behavior is often rewarded, with no consequences. The command crew is either cruel or just apathetic toward subordinates, and the lead character of ensign Marnier is loud, rude, and unlikable.",
      "date": "Aug 28, 2020",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "This show is a disaster. Not funny, annoying main character, totally out of sync with the Star Trek universe, imbecilic \"jokes\". Apparently created by people who really don't \"get\" Star Trek – or who don't care and wouldn't mind mutating Star Trek into a Star Wars JarJar parody.\nStay away…",
      "date": "Aug 28, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "It was silly and disrespectful towards Star Trek.  It's supposed to be a comedy, but I only laughed during the opening credit scene.",
      "date": "Aug 25, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "There are a lot of good things to say about this.  If any of the production staff reads this, my advice is:\n\nA) Give the characters more depth. \n\nSome of the character-defining \"ticks\" can be replaced by moments that show more of their humanity. Beckett Mariner comes across as a spoiled, two-dimensional jerk too much of the time. It was nice when she tried to help Brad in Ep. 2, but it comes a bit late and little.\n\nB) Humor / heart balance\n\nI think the series also has to commit to how emotionally \"realistic\" certain moments are meant to be: such as when Rutherford and his \"date\" are quipping during a zombie attack.\n\nBoth issues, interestingly, are creating a similar imbalance: too much \"funny\" with not enough reason for us to care. If a zombie attack has no weight, why care about the characters' journeys at all?\n\nHighly recommend the Orville to see how humor doesn't have to be sacrificed for heart! Hope to see a Season 2!",
      "date": "Aug 24, 2020",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "Its demeaning.   It's not funny.  I wouldn't recommend it for teens.",
      "date": "Aug 21, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I wanted to like this, but ugh.  Nothing there.  Easily forgettable.",
      "date": "Aug 20, 2020",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "Pretty good, TNG with a humour. This show has massive potential. I hope they get the chance to develop the characters.",
      "date": "Aug 20, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "I'm really liking the show so far! \nIs it perfect? No. No series is, not even OST and Next Gen, but it's really delightful and it gives Star Trek a fresh look to see live in Star Fleet from the perspective of the lower decks crew in a \"second class\" star ship. Those people are not \"the best of Star Fleet\" that we got used to seeing, they are just the every-man that *most* of us would be if we were in the world of Star Trek, and this shows us that even the average person has a place and an interesting live in the universe of Star Trek.\nAnd also I love the inside jokes for us trekkies and how the show fits perfectly in Star Trek canon. Like just now in episode 3 when they use the \"buffer time\" that Scotty discussed with La Forge in the episode \"Relics\" of Next Gen. You can definitely see that everyone involved in this show is a huge fan of Star Trek just like us.",
      "date": "Aug 20, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Waste of time.  Shot-gunned \"Rick and Morty\" style quipping that tries to be funny fan service.  Problem is - its meh.  Quickly got boring.  \n\nFan productions have done better comedy than this.",
      "date": "Aug 20, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "creo que es un concepto interesante... pero supongo que esta sufriendo del sindrome de \"Teen titans GO\" xD",
      "date": "Aug 20, 2020",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "Delightful addition to Star Trek. So fun, plenty of inside universe jokes and fan service easter eggs.",
      "date": "Aug 20, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Horrible. Just horrible. Comedy should not be written by people that does not know what a joke is. Star Trek should not be written by people that does not know a single interesting thing. Star Trek Comedy should not be written.",
      "date": "Aug 20, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "An crime committed against all that is Star Trek.  I have no problem with Star Trek being comedic or a version aimed at younger viewers, but this...\nPrimarily, if you want to even entertain this at all as being part of the Star Trek universe, the immediate problem is the idiocy of the characters prevents them from being Starfleet officers.  That's the big problem I had.  There's no way in any iteration of Star Trek I've watched in 35 years as a fan can I believe any of these characters could get through the Academy, much less being given the assignment to serve and have responsibility on a Starfleet vessel.  Once this wall is hit, it's impossible to watch any of it with any sense of this being anything even remotely \"Star Trek\" or objectively on any other level.",
      "date": "Aug 20, 2020",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "The dialogue was contrived and unfunny. Animation was fantastic, but wasted on a horrible writing staff.",
      "date": "Aug 19, 2020",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "Star Trek: Lower Decks is good. I really dig the light-hearted feel of the show and for the most part the jokes are landing with me. At the time of this review, I've only seen up to episode 2, but so far I'm sold. I especially liked how the episode ended. The crew is looking out for each other and building a stronger relationship with each other.\n\nObviously, the comedy format of the show isn't going to be for everyone, but I think this show will serve as a good bridge for new fans. At the same time, the TNG aesthetic is working for this old Trek veteran as well. I hope the show keeps going, because I think it has a lot of potential.",
      "date": "Aug 18, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Put simply, this show is both a brilliant love letter to The Next Generation, and a hilarious new take on some of the classic tropes of Star Trek in general. I've loved the new darker and grittier takes on the franchise bought by Discovery and Picard, but it's nice to revisit the more upbeat and hopeful outlook of older series. The balance of humour and old-school trek storytelling this show brings is what The Orville tried, and failed, to deliver.",
      "date": "Aug 18, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I wanted this to be good, but it was so bad. I not once got a full grin. There was maybe on funny line. But this is not star trek, this is not a spoof of star trek. It was honestly just kinda boring.",
      "date": "Aug 18, 2020",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "It is what they really wanted to do with Star Wars..",
      "date": "Aug 18, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Is this even Star Trek?  It's certainly not funny, and it certainly isn't more than a angsty-teen situation comedy (well, subtract the comedy.)  These guys had a huge opportunity.  They could have parodied a different episode of different star treks in each episode.  But no, its just the usual drek from the usual drek-merchants.",
      "date": "Aug 18, 2020",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is absolutely trash.  This is not funny at all.  Suffered through 2 episodes and I'm done.  It's seriously not worth your time  & money at all.\n\nThe reason it's not being picked up internationally?  Its a horrible show!\n\nSet your phaser to max and kill this show off now.",
      "date": "Aug 17, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Let me count the ways in which this show is funny...\n\nUm... ...?\n\nOkay let me count the ways the characters are likeable...\n\nErr..?\n\nLet me count... Nah I'll be honest, what a lot of shite this is. It's Star Trek in specter only. The ghostly shell of a once great series clinging onto a corpse of something calling itself Star Trek. And her... Talks and talks and talks and they all talk and nothing is relevant. It utterly blows my mind how this mutant was conceived then violently birthed on us.\n\nI do not recommend this what so ever.",
      "date": "Aug 17, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I enjoy it. Light-hearted, doesn't break canon, best Trek since Enterprise.",
      "date": "Aug 17, 2020",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Regressive, unfunny, lazy garbage.\n\nOrville is better than ANYTHING CBS has put out in over a decade.",
      "date": "Aug 17, 2020",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "I was a hardcore fan of TNG, I must say I wasn't expecting much from this show. I was totally WRONG. This new franchise has it all! And I only saw the first two episodes! I can't just wait for the next ones! By the way, Mariner ROCKS!!!!",
      "date": "Aug 17, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Boring, made it half way through episode 2.",
      "date": "Aug 16, 2020",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is an unfunny Rick & Morty / Final Space / etc clone with a Star Trek skin slapped on. Besides that, there's NOTHING Star Trek about it. If you don't incorporate the themes, soul and the core of Star Trek, then why name it \"Star Trek\"? Maybe they just want to cash in on the name. But if they continue to run this franchise into the ground, there'll be nothing left they could profit from. Avoid at all costs!",
      "date": "Aug 16, 2020",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "It is a disgrace to everything Star Trek stands for. Go home, Alex, nobody likes you.",
      "date": "Aug 16, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Why? Like seriously why do they keep destroying this franchise this show is unfunny and terribly written a wannabe copy of Rick and Morty and its countless copies the only good thing is the animation. This show could be smart and funny but is not both lease stop.",
      "date": "Aug 16, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Words that Immediately come to mind when watching this show:\nPandering,\nPathetic,\nTrend chasing,\nProfit chasing,\nGeneric,\nDisingenuous,\nPathetic,\n\"Edgy,\"\nFormulaic,\nTry hard,\nPathetic,\nTrash,\nBizarre",
      "date": "Aug 15, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Buenas a mi me encanta es algo fresco y divertido pero siempre manteniendo lo bueno del universo STAR TREK ojala hayan mas temporadas",
      "date": "Aug 15, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "So far I am a not impressed.  It is too over the top wackiness to be Star Trek.  I was hoping for something a subtle humor and little smarter.   The characters are obvious stereotypes and don't really fit the Star Trek universe.  That would be ok if it were actually funny but it is not that funny so... it is just sort of meh.",
      "date": "Aug 15, 2020",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Wow, this is awful. I wasn't expecting a great deal, and I'm only 3 episodes in, but I'm genuinely shocked at how terrible this is. Bottom line, it's not funny. It has nothing to say except that Star Fleet seems to be some sort of right wing American style moral police, Star Trek fans are morons and Gene oddenberry's vision is a joke. If someone who hated Star Trek went out to make a series deliberately mocking and insulting this much loved, optimistic, wonderful scifi framachise hey really couldn't have done it much better than this. I'm absolutely disgusted. FU CBS, FU",
      "date": "Aug 15, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Just so unfunny, it doesn't parody Star Trek, it disrespects it and laughs in the face of every fan of the franchise.",
      "date": "Aug 15, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I'm floored by how much I love this show. It goes back to the basic premise of Star Trek that humans have reached a utopian future where everyone can work to be the best version of themselves. The characters feel like real people, even if the first episode was a little chaotic. I see the influences of Rick and Morty, but they tone down the gross factor. I'm gonna get up early every Thursday so I can start my day off on a high note.",
      "date": "Aug 15, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "A great twist on the long-running franchise that is both refreshing and familiar, with tons of nostalgic nods to the Next Generation.  This show is an absolute must watch for any true fans of Star Trek, and for those just getting into the genre.  Warning: A sense of humor may be required.",
      "date": "Aug 15, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The MUSIC is STAR TREK. \nThe SHIP is STAR TREK. \nThe UNIFORMS are STAR TREK. \nThe rest is awful and it ISN'T STAR TREK.",
      "date": "Aug 15, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Sadly, the main gag seems to be someone either getting raped by an alien, hit in the crotch with a sharp Bat'leth, or bitten by zombie crew members. I'm not sure who's supposed to find this funny! Does that sound like the kind of humor geeky, intellectual Star Trek fans would love? I really don't know what they're doing with Star Trek lately.",
      "date": "Aug 14, 2020",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "All new Star Trek shows are garbage, this one continues denigrate characters and pre kurtzman trek,  they just need to stop.   It is not funny, no characters are interesting in any way,  the continual mocking of others in the show in an attempt to make a joke never works.  there is nothing Star Trek about this.   again just stop.",
      "date": "Aug 14, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I had very low expectations for this unusual step of the Star Trek Franchise, but they were beaten. The jokes were great, characters were already giving us a history of theirs indirectly and the dark humor was great (not too dark, not too bright). Everything was on point except the character designs being similar to Final Space and Rick and Morty. 8/10.",
      "date": "Aug 14, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "TNG was a great show, things got worse after. DS9 and Voyager are decent and have their place. But I have no idea what this is, are critics stuck up their own €%\\\\ ?  I mean this isn't for fans, is it for critics to say good for you ? It's garbage and won't make it to season 2.  Bye Star Trek.  RIP",
      "date": "Aug 14, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I don't even know where to start; The suspension of disbelief to think that starfleet is so grossly incompetent or that the characters are all extremely unlikable. \n\nAwful Awful Awful.",
      "date": "Aug 14, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "nothing new or funny",
      "date": "Aug 14, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I am just happy to have more Star Trek. It's not quite as bad as some on the internet claim it to be, but I do understand if one holds Star Trek to a higher standard.",
      "date": "Aug 14, 2020",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "Fun and self aware without going overboard. Really funny.",
      "date": "Aug 14, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The comedy on display here is mostly of the annoying kind; by trying to mimic the frenetic speed of something like Rick and Morty without having the writing to back it up, it just becomes a barrage of noise with a few Star Trek words thrown in at random. There are story ideas here that could have been good, but with no comedic angle and spotty-at-best understanding of Star Trek lore, the show ultimately neither pleases the existing fan-base nor bring anything of value to the rest of its audience.",
      "date": "Aug 14, 2020",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "Kurtzman Trek sucks! I want the 30 minutes I wasted watching the first episode back...",
      "date": "Aug 14, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I didn't mind episode 1, i kept an open mind.  However i felt enormously drained by 5 minutes into episode 2.  Maybe i'm a scrooge but i am unable to view this in a lighthearted mood given the absolute disrespect this show puts forth to all things great in Star Trek....and...well human decency.\nNetflix has Next Gen though - i'm watching that.  Wow i see what they mean about them getting Picard wrong in the new show.  He's an entirely different character in the original.",
      "date": "Aug 14, 2020",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Another kurtzman, bad robot failure why do they even try anymore. Leave Star Trek alone and go destroy some other franchise.",
      "date": "Aug 14, 2020",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "It's still early in the season, but it's an overall entertaining show and the best addition to the Star Trek franchise since Enterprise ended.",
      "date": "Aug 14, 2020",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Just not funny or even close to funny",
      "date": "Aug 13, 2020",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "this is such a love letter to Trek. plus i always wanted to see more perspectives n this universe. more of this pleas",
      "date": "Aug 13, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Why does this thing even exist? Pleeeeaasee CBS just stooooop.",
      "date": "Aug 13, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I was looking forward to this.... but unfortunately its a non-funny and non-fun \"satire\". Its a disservice to the Star Trek genre.",
      "date": "Aug 13, 2020",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "\"Hows it feel to have your favorite franchises just shit on constantly.\"\n\nLeave star trek & Star wars alone guys. You clearly have no idea what we want.",
      "date": "Aug 13, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "This is bsolutely the worst star trek spinoff.  It's not even funny.",
      "date": "Aug 13, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Not very at all, no originality whatsoever, like most other reviewers have mentioned it tries a bit too hard to be Rick and Morty, out!!",
      "date": "Aug 13, 2020",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "Geez... Why can't Kurtzman get anything right? He is handed a 50 year old franchise and in a few years has ran it into the ground, rolled over it steamroller, and allowed dogs to use it for their business. To call this show a dumpster fire is completely unfair... to dumpster fires!",
      "date": "Aug 13, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Lazy sitcom tropes ruin this show",
      "date": "Aug 13, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Star Trek: Lower Decks is about to become one of the best things to ever happen to Star Trek since Galaxy Quest. Go check it out. It's got cool animation, a sense of fun and is starting to become one of my favorite animated shows. The only negative thing about it is audiences on Rotten Tomatoes are treating it. Still, definitely worth watching.",
      "date": "Aug 12, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "A strong and fun start to a new series set in a much loved universe.\n\nThis light-hearted series might just be the one which ironically helps the franchise find its roots again.",
      "date": "Aug 12, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "If you're looking for \"a serious Trek series, but animated\" this is not for you. This is animated comedic GOLD. I laughed my behind off repeatedly. Cannot wait to see the rest of this season!",
      "date": "Aug 12, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Well done CBS, continuing to provide content that is not for Trekkies.  CBS has no interest in the people that have followed star trek for years.  I don't get that, as that is a massive audience!  Oh well.... GWGB.",
      "date": "Aug 12, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "First episode was fine with some funny moments. Looking forward to seeing where it goes.",
      "date": "Aug 12, 2020",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Very true to the TNG era...yes still fresh and entertaining",
      "date": "Aug 12, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Lots of hilarious references, the pilot doesn't do anything too out of the box, but sets it up for a lot of exciting shenanigans to come.",
      "date": "Aug 12, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "I've seen 1 episode so far, so I can't give an accurate guage of how the entire seaon is, but if it's more of the same but getting better as most things do, I really liked it. \n\nIt's different. Which I know die hard \"Fans\" of Star Trek are going to hate. I consider myself a Trekkie. I grew up in my teenage years watching the TNG crew, went back and watched TOS, stayed up late in AU to watch DS9 on television and the same for VOY, ENT, DIS & Picard. \n\nI've watched every episode & movie that Star Trek has released and loved everything for different reasons. It's the characters and settings that we love and admire, but times change. If Star Trek stayed the same, there would have been no reason to continue past TOS. \n\nWatch it, don't watch it. But don't review bomb something because it doesn't align with your views of what Star Trek should be. Appreciate the fact that we have Star Trek on our televisions again.",
      "date": "Aug 12, 2020",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Lo unico que faltaba! Una serie comica sobre Star Trek que nadie pidió ni se necesitaba. Una porqueria llena de chistes malos que se burlan de todo lo que vimos y oimos en las series clasicas de los 60s a 90s. Me basto con el primer episodio, no pienso ver mas esta mierda. Star Trek está MUERTA!!!!",
      "date": "Aug 12, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I don't get the hate for this show.\nIt's pretty true to Trek, funny. but it does play on the safe side, but for a first episode, it's good.\nMore a Star Wars fan, than Trek. I am may not be the best person to review. I do love ST:NG series and the follow-ups in the same era. This one cut from the same cloth. \nLower Decks follow a quarte of young Officers of USS Cerritos, California Class vessel that seen better days, as they must various realities of military life, from grunt work to the b.s. of the Senior Command Staff, and weekly danger that every Trek series uses for drama, now used for comic effect.\nThe cast is pretty solid, form clean-cut, studious. upward driven but woefully lacking any real-world experience, Ensign Brad Boimler. To Ensign Beckett Mariner, a Starfleet burnout who knows more about Starfleet then she lets on, but drive to do the right thing put at odds with protocol and the Senior Staff, derailing her career. She has made it her personal mission to protect the her fellow Lower Decks, and fun while she at it. To Ensign D'Vana Tendi, (a green skin busty Orion girl, as to Star Trek tradition) a young medical official wide eyes, cheerful, innocent,  is unfazed craziness of any situation. And Ensign Sam Rutherford, a newly cyborg implant enhanced Engineer, who Vulcan implant conflicts his natural human emotion, creating awkward situations if his pure nerdiness doesn't do it first.\nThe Senior staff of Cerritos is every Star Trek command crew, dialed to 11.\nFrom the \"Bro\" Commander, who to love throw his weight around(even if he only 2nd in command), The Bones like Senior Medical (who happen to be a Caitian, a species last seen in first time Trek was animated), and the Captain, whos relationship Ensign Mariner, make you wonder if she is put her feels separate from her professional duty.\nDon't buy the hate and give this show a chance.",
      "date": "Aug 12, 2020",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "I've only seen the pilot but it was cute and well done.",
      "date": "Aug 12, 2020",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "It's supposed to be funny Trek.  It's not funny and it's not Trek.",
      "date": "Aug 12, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "A fun, silly, satirical take on Star Trek.",
      "date": "Aug 12, 2020",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Just the sort of garbage you would expect from anything Alex Kurtzman had anything to do with. This raging dumpster fire is nothing but a giant middle finger to Star Trek fans and an insult to the franchise. The writing is awful. The characters are ridiculous and nothing but a complete joke. There are elements in the show you'll recognize as being from Star Trek, but nothing about the show itself is even in the same universe. If you're expecting it to be funny, it isn't. And there wasn't one second where my gag reflex would have permitted so much as a slight grin even if there were. It's no big mystery that this dung pile of a show couldn't get any international distribution. No other network wanted anything to do with it. The bottom line: Alex Kurtzman has found yet another way to destroy Star Trek, just from a new angle. If you care anything at all about Star Trek then I implore you, don't subject yourself to this trash. You'll regret if you do.",
      "date": "Aug 12, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Speaking as someone that has not liked Discovery, and was lukewarm on Picard this seems so much more like Star Tre. I am actually looking forward to seeing each episode next week.",
      "date": "Aug 12, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Just... wow. I can't even begin to express what a miserable fail this is. I suppose it's the inevitable course that new Trek's been taking. It certainly makes me miss the core idea of Gene's that every Star Fleet member was a qualified astronaut... and thus, an officer, as it was during the space program back in Gene's day. Professionalism is the hallmark of an Astronaut. I like the movie Apollo 13, but compare the film to the actual tapes of the accident happening. Calm. Cool. Collected. The entire time. A crew of three men, far from our planet, quite potentially minutes from death, and they kept their focus, did their jobs, and saved their own lives. \n\nDramatic moments happened in all the original Treks... but outbreaks of powerful emotions, like Picard in First Contact, stand out for good reason. Just like when Picard is letting his emotions come to the fore while maintaining his professionalism, like in Drumhead, or Measure of a Man. Kirk has been reinvented as a fly boy, a hothead, compared to the collected officer and a gentleman he was. A man who clearly belonged in command, and bore it's weight well. Now at the end of that downward slope... we arrive at a thinly painted Rick and Morty rip off. \n\nWhy in the nine circles of hell is the parody of Star Trek, The Orville... better?",
      "date": "Aug 12, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "This is incredibly lowbrow, especially for Star Trek. It seems to ttempt to imitate shows like Final Space and Rick and Morty, but has none of the wit, intelligence or charm. If this were not branded as part of the Star Trek franchise it may have been alright as background noise, though not much more. As a part of Trek it's an abomination, it's no wonder why Futurama said Star Trek was banned in the future.",
      "date": "Aug 11, 2020",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "Fun, not stuffy, JUST what Star Trek needs.",
      "date": "Aug 11, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Why do they keep letting people who dislike Star Trek and don't care about Star Trek write its new shows? This show is not funny. I did not laugh once. Worse, it's contrary to Star Trek's heart and soul. Avoid.",
      "date": "Aug 11, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "If you like Final Space then you should check this out.",
      "date": "Aug 11, 2020",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "The last thing I think the Star Trek franchise needed was a mocking, satirical show that isn't as funny as it thinks it is.",
      "date": "Aug 11, 2020",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great animation. Super funny. Shots feel very Trek while also being its own thing. It's a love letter to Trek.",
      "date": "Aug 11, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "I'm a big fan of lower decks. It's just what the franchise needs, a light-hearted, fun, quick-witted and cool looking comedy adventure that explores and expands upon the star trek universe in a way we've never seen before - from the point of view of the ensigns! Great concept and in my opinion they did it justice! Cannot wait for more. LLAP 🖖🏻",
      "date": "Aug 11, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "A excellent love letter to past seasons of Star Trek. Including the often forgotten Animated series this show is a must watch for any fan of the TNG Era of the Star Trek Franchise.",
      "date": "Aug 11, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "absolutely garbage.\nnot even worth me writing a proper review.",
      "date": "Aug 11, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Noise.  So much noise.  That's all this really was.  To make matters worse, they went for the \"black character must be loud and obnoxious\" stereotype.  Between her, and the random insanity that ensued, I found myself annoyed for most of the episode.  I didn't laugh a single time.  \n\nI'm sure there's people who say to just give the show a chance, but think about that for a second.  If you're making a new TV series, wouldn't you get a focus group to make sure that your first episode is a good example of what the series intends to be, since the first episode is crucial in hooking the audience?  It's like they tried to go for some Rick and Morty vibe, but completely failed to realize why Rick and Morty is funny.  Even if there are better episodes later, then they really screwed up in conveying that.  And since it's CBS All Access, aka \"old media who still don't get it\", you gotta wait a week to see the next one.  Most people probably cancelled the subscription, if they didn't already after Discovery and Picard.\n\nThe only possible redeeming quality about this show is the setting, which is nostalgic Star Trek: TNG era, from the ship design to the sound effects.  But it was totally wasted on this mess, in yet another failed new vision of what Star Trek should be.",
      "date": "Aug 11, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I'm sorry for all the people who were forced to work on this hot pile of something under a loaded gun. I wonder if there is a single person in the production team who knew what they were trying to achieve with this embarrassment. \nFunny? No. Relatable characters? No. Interesting story arc? No. Eye-catching drawing? No. Star Trek lore development? No. \nWhat are you, Lower decks? And Why are you?",
      "date": "Aug 11, 2020",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "This is not Star Trek. This is a poorly written cartoon with many problems, that is just borrowing the Star Trek name.",
      "date": "Aug 11, 2020",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Watched it but it does not feel like the classic Star Trek that died with Star Trek Enterprise.",
      "date": "Aug 11, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "This is NOT. A standard Trek show, and you can't expect it to be! It's a goofy animated comedy made for some laughs and fun stories. The writers are definitely paying a lot of attention to established Trek canon and Trek lore, especially from TNG. From the Nomad Easter egg to the uniforms, to the vibe, to the subtle jokes, the writing clearly shows that the writers understand Trek a lot; and they're definitely putting a lot of love into the writing and Easter eggs. While the comedy might not be everyone's style , I still recommend you give this show a shot with an open mind, it might surprise you! My biggest complaint is the pacing, its WAY too fast. But that might be fixed as more episodes come out... I honestly wish the episodes were longer. Either way, Episode 1 got a few laughs and smiles out of this Trek nerd. :)",
      "date": "Aug 11, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Why?? Kurtzman needs to go :(",
      "date": "Aug 11, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Absolutely terrible. It's not Star Trek, it's not even remotely funny. I struggled looking for a single joke to make me crack a smile... and failed. The Star Trek franchise is dead, we all know it, at least let it go with some sort of dignity (pretty hard after Discovery and Picard anyway) and cancel this trash...",
      "date": "Aug 11, 2020",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "It's like Futurama without the heart, and without anything approaching Star Trek. There's nothing interesting or smart about this series, and I was surprised by just how not funny it was.",
      "date": "Aug 11, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Seems like a fun Series with some potential willing to give a chance.",
      "date": "Aug 11, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Its like they don't know Trek. Unlike a GOOD parody or lampoon of a genre or show, rather than making fun of the tropes of the genre or of Trek in particular, which even the most ardent fan can laugh at (or even laugh harder than any) they assume and make up things to make fun of, attacking things that don't actually deserve to be made fun of.  The result of which is it feels off-base, and ultimately makes this feel more like a cheap and possibly mean spirited attack on Trek and on Trek fans.",
      "date": "Aug 11, 2020",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "When, in the first 5 minutes of the show, the writers can't even get something as basic as Romulan Ale right and call it Romulan Whiskey, you get anxious about what is to come. I SO WANTED to love this show, but it ended up being a B-rated Star Trek version of Southpark on acid... The aesthetics where nice. We could feel the TNG era, but once the characters started talking, hell broke loose. I'm all about adding a little more comedy on Star Trek, but having hyperactive characters on the brink of hysteria all the time and a first officer doing chest bumps with people under his authority? SERIOUSLY?!? If you don't care about Star Trek and just want to see a goofy sci-fi show, then maybe you'll like it. But for a ST fan, a hard pass...",
      "date": "Aug 11, 2020",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "I thought it was pretty faithful to Trek TNG era of canon and thought it was funny! I cannot wait to see it again this Thursday!",
      "date": "Aug 11, 2020",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "The concept of a light hearted Star Trek makes sense. But the minds behind this Trek confused juvenile for mature humor. The story of the \"lower decks\" has been needed since TNG, and was done the best by DS9 looking at the families and support staff. This cartoon Trek could have done the non-command crew well while being lighthearted and comical. But ultimately they became the command crew by default, so then what's the point. What they showed is they can't actually write Lower-decks about the lower decks. It is still command-Star Trek only without the bridge crew as stars, but the plot still revolved around the bridge crew.\n\nUltimately a comedy needs jokes that land. They didn't except for a bit of fan service for Trek diehards.  But I don't think there was a craving for American Pie in space.",
      "date": "Aug 11, 2020",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Tasteless humor. Unlikable characters. Its Not Star Trek and not funny. It's just garbage. Proof CBS Interactive is killing the franchise.",
      "date": "Aug 11, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I am not generally a big fan of animated Trek, but this show was very annoying to watch.  Very annoying voices and generally pointless.  Who would watch this? who was it made for exactly?",
      "date": "Aug 11, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Fun show set firmly in the Trek universe. Hopefully they stop and take a breath along the way, but a very solid start to the series.",
      "date": "Aug 11, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "No idea what this is meant to be, but it's not Star Trek and it's not entertaining.",
      "date": "Aug 11, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Another pile of garbage from Kurtzman & Company. Just because it says a Star Trek on it and they are wearing quasi- Star Trek uniforms, doesn't mean it is Star Trek. The jokes are lame, the animation could be much better. The 1973 and 74 Star Trek the animated series had better animation than this does. They had better stories than this does. The people putting these Star Trek shows together have no idea what Star Trek is. This is a waste of time and effort. Hopefully it will die quickly.",
      "date": "Aug 11, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "This is the nail in the coffin for the star trek franchise. I hope they're happy.",
      "date": "Aug 10, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "What the hell was that? It claimed to be Star Trek, the visuals sort of looked like Star Trek, but nobody acted like they were in Star Trek. Did the producer just use their teenage child's Star Trek SI fanfic as the script?",
      "date": "Aug 10, 2020",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is a much different direction than Star Treks of the past, but I like it.  It's a comedy, so it has a much different tone than your average ST series, but it stays true to the material.  Silliness aside, this series didn't try to rewrite everything like Discovery did.  I think this is refreshing.  I think there is room in the world for both a slower, philosophical, traditional Star Trek, as well as something like this.  \n\nI look forward to seeing more.",
      "date": "Aug 10, 2020",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Whomever thought this was a great idea of a show should be fired. This is a joke and it's not even a fun joke. The Orville is more Star Trek than whatever CBS has been producing as of late.",
      "date": "Aug 10, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Rotten to the core. It's not funny. Dreadful animation. Annoying characters that all talk at the same time (is that the humour?) This just simply isn't Star Trek.  Did the creators actually ever watch an episode of any star trek series. Because from where I'm standing, their understanding of the franchise is non existent.",
      "date": "Aug 10, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "When this show was first announced I was excited: a series from the perspective of \"the little people.\" Given how much I enjoyed previous episodes that followed that POV such as the TNG episode this series takes its name from, and other such episodes like Babylon 5's \"A View from the Gallery,\" I thought it would be a nice departure from the usual focus on the top tier officers. Then I found out it was going to be animated. .... I mean, ok? Then Picard debuted. ...wow. Then the trailer premiered, and I found myself not loving the style or the writing as I didn't laugh once.  Then CBS put out the first few minutes of the pilot and the establishing shot of the Starbase made it clear they were going for the TNG/DS9/VOY aesthetic and once again I was somewhat optimistic... until Mariner showed up and started rambling like a meth addict, which is odd as she was supposed to be drunk on Romulan \"whiskey.\" Oh boy. Not one laugh. \nWell, I just finished watching the first episode, which I acquired through means other than via CBS All Access as I cancelled that after the third episode of Picard, and I find myself kind numb really. I WANT to like this show. I love that someone finally figured out that the design of Disco and Picard are NOT what fans wanted, and that this series clearly takes place in the world of Star Trek we know and love. But it just wasn't FUNNY, which is the most damning thing anyone can say about a series that is supposed to be a comedy. To be blunt, Mariner just sucks. I get where they were going with her but they didn't make it work. She's arrogant, overbearing and while supposedly better than everyone and capable of much greater things she chooses to take the path of least resistance for \"reasons.\" She's the stereotypical slacker fantasy of \"yeah I could totally have a better life than I do right now, but like I refuse to sell out and live up to other's expectations cuz they're all hypocrites, man. Totally.\" Whatever. Meanwhile everyone that actually has to suffer and toil for every inch they get, never approaching a tenth of what she could achieve if she actually tried, secretly hate her guts. She's supposed to be the cool counter-culture spokesperson, but what her writers are too dense to grasp is that she is like that millionaire, lighting his cigar with a crisp hundred dollar bill while his limo rolls by the rest of us, simply because he CAN. Oh yeah, awesome character to hang your entire series on, CBS. \nBoimler, in contrast, also sucks but for reasons that rest on the opposite end of the spectrum. Dude is gutless to the point he can't actually do the right thing and follow orders, nor can he stand up to his commanding officer when she gives him unethical orders either. He's a spineless coward who supposedly \"sees the light\" at the end of the episode when really he just manages to be manipulated by Mariner's BS, not because she cares about him but because she's BORED and he's the flavor of the week. \nAt the end of the episode we have a comedy that didn't inspire a single laugh, and characters that aren't interesting enough to remember their names other than the two I mentioned above because they are constantly mentioned by name and rote memorization works. Basically Lower Decks wants to be Rick and Morty meets The Orville, and it's not. That little tidbit there is the final ironic point I'll draw attention to in this review: Seth McFarlane was turned down by CBS when he approached them years ago with the idea of a spoof set in the Star Trek universe because execs back then were concerned it would cheapen the brand. Fast forward to today and we have season 3 of The Orville premiering this fall, a show that has widely been accepted as the true successor to Trek by Trek fans, and CBS puts out Lower Decks, a series that actually manages to do that which those execs were worried about McFarlane doing when they turned him down. There is a day of reckoning coming to the executive offices of CBS soon, and they only have themselves to blame. Maybe next time they'll try something that most successful businesses have made their fortunes on: actually listening to the target consumer base and put out a product they want instead of trying to force feed them something they think they should want.",
      "date": "Aug 10, 2020",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "Not good, not horrible. one episode is difficult to judge a new series.",
      "date": "Aug 10, 2020",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "A new take on the Star Trek universe, absolutely loved it!",
      "date": "Aug 10, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I love Rick and Morty... this is just really badly written with cheap jokes.",
      "date": "Aug 10, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Life long star trek fan and I'm loving the lighter side of Trek. Rock on.",
      "date": "Aug 10, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Imagine taking a concept like \"Galaxy Quest, \" animating it while putting in almost no writing effort! This essentially sums up Lower Decks! This in no way should be called \"Star Trek!\" It is latching on to a well-known IP to trick real \" Star Trek\" fans into watching. It's barely good enough to air on Cartoon Network at 3 am. Let alone be gated behind the paywall of a terrible streaming service! The only small plus is the voice cast.",
      "date": "Aug 10, 2020",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "Pretty average, didn't laugh once. Might have grimaced at one point. Certain bits reminded me of The Whirly Dirly Conspiracy episode from ric n Morty.\n\nTo me it's seem generic with trek smeared on top. \n\nDid sound great, something STD n Picard are missing.",
      "date": "Aug 10, 2020",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Given that the general audience for Star Trek is an older crowd who have been fans since the days of TOS or TNG, it's hard to imagine who exactly the creators of this show thought it was for.\nThe level of humor is childish even by an actual child's standards. I've heard 5 year olds make more sophisticated (and funnier) jokes than this. The two female characters introduced in the first episode seem to have exactly the same personality, substituting shouting and manic behavior for humor.\nAll in all, an appalling waste of the Star Trek name.",
      "date": "Aug 10, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "So this is where Star Trek comes to die?",
      "date": "Aug 10, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Unfunny and it doesn't feel like Star Trek as all the new shows fail to do.\n\nWhere are the times of TOS, TNG and DS9?",
      "date": "Aug 10, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Cyborgs are a real thing now & are not to be made fun of.  Hiring a Rick & Morty showrunner does not make a concept \"funny\".  You stole your plot devices from The Orville.  You used Wolf 359 as a comedic device.  Sisko's wife dude in that battle bruh, that is not cool.  Little Jake had to grow up mummyless",
      "date": "Aug 10, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Not sure i was the audience for this cartoon for certain. So adding a extra star for a buffer.",
      "date": "Aug 10, 2020",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "I'm guessing the writers' room has a beverage vending machine .  .  . with only two options . . . Red Bull and Monster. One episode is all I needed to know that Lower Decks will not be on my watch list. It's a shame, it could have been good instead of a hectic mess.",
      "date": "Aug 10, 2020",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "The only thing about this that was Star Trek was the comm badge.",
      "date": "Aug 10, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Absolutely abysmal: Too unfunny to be for adults (childish humor of the lowest common denominator), and it's too insulting to be for kids too (the very first episode promotes PORN). I'm not even gonna go at how it is a sacrilege against anything canon Trek.",
      "date": "Aug 10, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I was really hoping this would be a kind of a fresh new turn-around for Star Trek, I was wrong. Even for low-brow humor, this is cringe. As far as the 'Star Trek' element, it's as if the writers googled a bunch of keywords in relation, then jammed it into the script where they thought it'd work. It's just sad at this point.",
      "date": "Aug 10, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Lower decks wants to be The Orville crossed with Final space, unfortunately it fails on both fronts. It's an animated comedy however it seems they forgot to put the comedy in. I can't help but feel like CBS have killed the horse, now all they're doing is flogging it's mangled corpse.",
      "date": "Aug 10, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I think it's a fun ride while having tongue and cheek fun with the TNG material, as well as several other Trek Series and movies.",
      "date": "Aug 10, 2020",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "I rather enjoyed the show. Beckett Mariner needs to dial it back by 15% and increase dynamic movement by 3. Am I right? She's too hyper, let her cool it back a little even keeping all her other personality traits and the show will be much better. Cerritos, reminds me to much of La Sirena, and that is not a good thing. Speaking of Cerritos, the ship is ugly, the California class looks just like a Nebula only with longer pylons. I loved the Star Trek callbacks in the show, that was nice. I dislike that its made by Bad Reboot, really didn't want to like the show but I do. I grew up with Star Trek, I love ToS and TaS, not all the jokes in this fit perfectly into Star Trek canon. Oddly the show itself fits canon better than Discord and Picard. Give the show an honest chance, chances are good you'll like it.",
      "date": "Aug 9, 2020",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "Is this a joke? As if Picard and STD where not bad enough now this floating turd too! 🤢🤮",
      "date": "Aug 9, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "What a disaster, what were they thinking? They should've called it something else at least!",
      "date": "Aug 9, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Poor pacing, Manic characters, lame plot.",
      "date": "Aug 9, 2020",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "It was entertaining.  The ensemble cast and particularly the four main characters, seem like a fun group.  The graphics were just horrible though, but expected of a pilot episode.",
      "date": "Aug 9, 2020",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "To me even in a comical Star Trek I have to believe that these guys would have graduated from Starfleet academy. Humour is played on the characters acting or being stupid, not on situations. I have to talk the opening: I felt insulted and I say that as a way to describe a feeling not to trash the show. A Starfleet vessel, one of the dreams of my childhood treated like it's been driven drunk? And fleeing from a battlefield? Cowardice in Starfleet? It happened on show but it was usually chastised by the end of the episode. I think and feel of Starfleet as the best mankind has to offer. Seeing this kind of things hits me deeply even if the opening is good and comical (I can recognise that it's well done, I hate the opening for the reasons above). I have to state though that this is still the most ST looking show in the last 15 years.",
      "date": "Aug 9, 2020",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "Awful. Just plain awful. Humor is ridiculously unfunny and does not act as a parody of Star Trek at all. I would use the first episode as an example of how NOT to do an animated show, or any show for that matter.",
      "date": "Aug 9, 2020",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "It would be a decent show if only they got rid of Marner. The animation is a garbage style. Please don't disregard core Star Trek principles like the PRIME DIRECTIVE.",
      "date": "Aug 9, 2020",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "I don't understand all the bad reviews. I really enjoyed the series so far and am looking forward to the rest of the season. It feels like a return the TNG-era with familiar ship and shuttle designs, uniforms, ship interiors, bat'leths, phasers, and LCARS panels. There's a ton of TNG-era references. It's not perfect but it's a cartoon and doesn't have to be. If you're on the fence then by all means do yourself a favor and at least use the free trial to check it out for yourself.",
      "date": "Aug 9, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Loved it.. couldn't stop laughing.  I've a huge ST fan, even own a few of the books. I always wondered what the lives of those in the \"lower decks\" were like.  The Orville does a nice job of a  \"D\" class crew.. I can't way till the next episode.",
      "date": "Aug 9, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "I really liked the it I can't wait for more episodes, it's a new breed of Star Trek which I found more enjoyable then Star Trek Discovery which is a utterly grim mess.",
      "date": "Aug 8, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Made by people who hate TNG & DS9 Style Star Trek for people that don't care or know about Star Trek. The idea that this is a good parody is just ridiculous...\nWatch the Orville for having a real Star Trek satire experience instead of this ...",
      "date": "Aug 8, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Is it groundbreaking? No. Genius? No. Does every joke in all 1 episodes hit their mark? No. Did you like and or tolerate Galaxy Quest? Or the Orville? And did you like a few of the humor ST episodes? Then that's what you're getting. It's not breaking new ground. The show is trying to be Red Dwarf as well.\nYou know all the characters and even this set up if you have read or seen anything since you were 7 years old.\nThe nerdy rule obsessed officer with a lack of confidence teamed with the devil may care skilled officer that seems to push the line. Along with the green naive person (literally here) that is always positive and the one that is a klutz with the opposite sex and likes dealing with minutiae.  That's lower decks.  \nIt is a breath of fresh air in comparison to the nihilistic dark broody and ponderous Discovery or Picard.",
      "date": "Aug 8, 2020",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "As someone who's never watched anything star trek I found this show to be entertaining enough. Its clearly trying too hard to be funny, and combining already done characters and tropes that have been proven popular. I could guess the story beats and reveals without much effort, but it wasn't the worst thing I have watched. The idea is an intriguing one and the characters are interesting enough. If the rest of the season stops trying to emulate popular cartoons, and leans on the established world I would say it would be a worthwhile experience.",
      "date": "Aug 8, 2020",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "Who was this for?\nRick and Morty fans ... Nope It wasn't funny. \nStar Trek fans ... Nope It wasn't intellectually Treky.\nThe characters were bland, unfunny and uninspiring. The Jokes feel like they were conceived in seconds and never questioned for their boring, crude unfunny nature. Wow a character is naked now ... that's the Joke, laugh please . \nI had to technological techniques to even view the show why... no international distributor was willing to pay and give it air time.",
      "date": "Aug 8, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "A more or less decent, yet unoriginal idea (Orville has a very similar premise, yet is a much better show) carried out in a lazy and careless way. \n\nAs someone who absolutely loved classic Star Trek and rather enjoyed Discovery even with its darker themes and casual disregard for canon, I definitely did not like the first episode of Lower Decks. \nIt did not look much like Star Trek when the trailer came out, but I was still going to give it a chance, had it been well made and funny.\nEpisode 1 was, unfortunately, neither of those things. \nMany of the jokes serve simply to emphasise the stupidity of the characters, with Boimler being bombarded with such \"comedy\", yet others not exempt from it either, from Mariner lacking the most basic knowledge and justifying it with the \"I am not a scientist\" cliche, to the complete inability of the senior (and all other) officers to get anything done.\nEveryone comes off as loud, extremely fast-talking and absolutely incompetent, without any particularly redeeming traits. \nThe humorous attempts at mocking Star Trek itself and the type of science fiction it represents fall flat and make little sense. \nThe preposterous naming of everything memorable from Star Trek at the end is unforgivably pointless. \n\nThe plot of Episode 1 was unwitty, predictable and rather dull, with very little redeeming qualities. \n\nVisually the canon and the classic Star Trek look are well observed, yet the nice-looking picture does not excuse the mess that is the rest of it. \n\nIt would be great if the show improved over time and became more of a thing to look at, yet for now, I absolutely do not recommend it. Not something fans of either Star Trek or comedy would enjoy.",
      "date": "Aug 8, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "This show isn't worth your time, just pass this up.\n\n\nThis is just a mock-up of Star Trek with a coating of Rick and Morty paint thrown on it so the \"It's a kid show,\" defense isn't going to hold any water. The premise is as thin as the paper they use to write this garbage script. Heck if CBS had to hide the like to dislike bar and lock all comments that should've been a sign for even one that it was trash! \n\nThe network itself had no faith in it.",
      "date": "Aug 8, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Utter garbage. Insulting to fans of Trek, it's difficult to tell who this was created for, and why they spent the money",
      "date": "Aug 8, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Trek trying to be \"Final Space\", and Family Guy AND Rick and Morty. It doesn't know what it wants to be, except everything Star Trek isn't.",
      "date": "Aug 8, 2020",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "Its fine for what it is, but why did you make this into star trek? This isnt what trek needs. Talking over one another isnt funny and very forgettable characters.",
      "date": "Aug 8, 2020",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "It's bad. It's *really* bad :-(. People who can't write comedy shouldn't try and write comedy. Especially for Star Trek, which habitually takes itself quite seriously.\n\nIt's a shame when the Fan-made Star Treks are *so* much better than the \"official\" Star Trek \nCBS comes out with.",
      "date": "Aug 8, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Sorry, can't get on board. Backgrounds & ships look spot on, but that's about all I can give it credit for. Writing is awful and it's not funny! This is NOT Star Trek.",
      "date": "Aug 8, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Lower Decks is uninspired, unoriginal, derivative, and unfunny. Its animated aesthetic screams \"Rick and Morty\" or possibly even \"Family Guy,\" and yet the title and forced inclusion of Star Trek iconography and Easter eggs are the only things to remind us that this is supposed to be a Star Trek show. I could almost feel the showrunner and writers screaming at me throughout the abominable first episode: \"This is Star Trek! THIS. IS. STAR. TREK! Okay? You're going to like it! AND you're going to laugh because it's funny and relevant, damnit!\" No, it isn't, and no, I didn't. This show is a slap in the face to those of us who love the franchise and appreciate a well-written and well-produced show―science fiction, animated comedy or otherwise. I doubt the crafty, crude, eccentric, and rapid-fire dialogue (as well as the slaptick) will ever be enough to save Lower Decks from obscurity.",
      "date": "Aug 7, 2020",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "A great addition to the franchise and it is hilarious too.",
      "date": "Aug 7, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Absolutely bombed.  Unlikable idiots.  Has nothing to do with Star Trek.  Terrible attempts at 'humor' that fell absolutely flat.  If they'd called it \"The Orville: Lower Decks\", this might have been at least somewhat true to source material, but as Star Trek?  No, just no.  There is nothing this show has in common with Star Trek aside from logos and names.",
      "date": "Aug 7, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Fun, refreshing, a much needed respite from the darkness of the live-action shows. Feels like the first time we see real people working and living in a TNG-era ship. I enjoyed it a lot.",
      "date": "Aug 7, 2020",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Who is this made for?  I have loved Star Trek for 20+ years, this is not for people who like Trek.  People who don't like Trek will not watch this.  This will not bring in any new people to the Star Trek franchise, and will only turn off move people who are looking for any good Trek at this point.  Maybe Trek is just dead for now.  ~C. Johnson",
      "date": "Aug 7, 2020",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Don't listen to the gaslighting toxic haters who angrily spammed this website, Lower Decks is brilliant! It's another big win for Alex Kurtzman and his talented & creative team at CBS.\n\nIf you love Star Trek (especially TNG), you'll love Lower Decks. If you love sci-fi comedy, you'll love Lower Decks.\n\nIf you love Star Trek and have a good sense of humor you will be absolutely OVER THE MOON for Lower Decks! It's nothing short of EXCELLENT. It's possibly even the best of the wonderful new generation of shows (so far) and that is saying a lot!",
      "date": "Aug 7, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Unfunny, crude, lazy references, and the trademark Kurtzman mediocrity.  Feels like they were going for Orville animated, but the biggest difference is that the Orville is funny and actually good.",
      "date": "Aug 7, 2020",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "I loved the characters, especially Mariner. Coming from Mike McMahan, with his previous work on Solar Opposites, I can expect a nice plot development!",
      "date": "Aug 7, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Not funny, just stupid.  Not true to Star Trek.",
      "date": "Aug 7, 2020",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "The phrase \"cringe\" is over used, but very much applicable for this show. So many of the \"jokes\" in this show were just plain cringe inducing.  Not only is this show a bad Stark Trek parody, it's a bad sci fi parody.  Plainly put, it's low effort.  I felt like I was watching a 90s sitcom at times because the episode was so boring and formulaic.  None of the characters are likeable, honestly it just made me want to watch the Orville.  Star Trek deserves way better.",
      "date": "Aug 7, 2020",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "A bad idea that proven equally bad in its execution. The Star Trek franchise concerns the human experience in space. We cared about almost all the characters we met in the various iterations of the show.  Well, except for Lower Decks. Suddenly the great great great grandchild of Morty from Rick and Morty seems to be in Starfleet and is joined by a bevy of equally annoying friends trying to turn Star Trek into a millennial  cartoon comedy. The first episode has the senior command staff throwing up on each other as they contact a zombie rage virus. It has all the outrageousness of Rick and  Morty but in a classic setting that is so wrong. I didn't find it funny. Not a titter. I didn't like the characters. I was grossed out by all the plotlines. I am a forgiving man and I will watch it again to see if there is any chance of character growth. But I sincerely doubt it. I am however looking forward to the upcoming Captain PIke series more than ever. Because that sounds like it might be the Trek the fans deserve.",
      "date": "Aug 7, 2020",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "Star Trek fans do NOT judge this show prematurely on its first trailer! For me ‘Lower Decks' after the great disappointment of ‘Discovery' and shear horror of ‘Picard' marks a return to a show that looks and feels like \"Star Trek\". It is a parody of course, but one clearly made by people who love and know Star Trek, a key feature of much of the humor. The animation is beautiful with the TNG design aesthetic, the simplicity of the art being deceptive because there is a lot of background detail that made repeat viewing engaging. The music is a great homage to TOS, TNG, and the films.\n\nIt's a fast pace show with rapid banter and zany plot developments – but it works because it is a half-hour cartoon comedy like ‘Futurama' or the ‘Simpsons'. If this was live action it be bad, but as a cartoon its cute. There is \"adult humor\", but so far, none of the eyeballs being ripped out of sockets and F-bombs of ‘Picard'. I think there is a lot of room for growth, with hopefully more serious and weighty plots – but so far ‘Lower Decks' for me is off to a good start. Unlike the dread that I felt before every new ‘Discovery' episode and the far, far, far worse ‘Picard' – I'm looking forward to the next episode of ‘Lower Decks'.\n\nThere will be some Star Trek fans who will hate ‘Lower Decks' like there are some fans who somehow love ‘Discovery' (ugh) and ‘Picard' (OMG!). But for fans who while taking Trek seriously could always find humor in the campiness and ludicrousness of some of the situations and plots of TOS, TNG, DS9, and VOY, I think it has an audience. I would love to see Trek again achieve the greatness in art and entertainment of ‘The Wrath of Khan', Search for Spock', and ‘The Voyage Home' – but for me ‘Lower Decks' is a return back to what I always enjoyed about Star Trek, the humor, camaraderie, adventure, and sense of wonder – in a zany cartoon form.",
      "date": "Aug 7, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Too awkward and doesn't feel original. The callbacks to previous star treks are the best moments, and to me that's the best indication that the show has no footing.",
      "date": "Aug 7, 2020",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Does anyone actually think this is funny? I think I chuckled once the whole episode and it was because of dumb this show is.\nWho is the target audience for this show? I honestly don't know of anyone who would like this. All the Star Trek reference feel forced maybe this show woild be better not in the Trek universe? If I wanted to watch a Star Trek parody I'd stick to The Orville.",
      "date": "Aug 7, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I didn't have high hopes, but still this managed to disappoint.  The critics \"Fresh\" rating is somewhat misleading.  If you look at the \"Top Critics'\" score, the reviews are only 29% positive, which probably is a better reflection on the quality of the show.  I've enjoyed Discovery and Picard, but this one definitely fell flat with me.",
      "date": "Aug 7, 2020",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "Better than expected",
      "date": "Aug 7, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Lame. Please let it end",
      "date": "Aug 7, 2020",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "I miss when Star Trek was actually Star Trek.",
      "date": "Aug 7, 2020",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Star Trek Lower Deck's first episode fails to bring a single laugh, but it has made Star Trek a joke.",
      "date": "Aug 7, 2020",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "I cracked a smile maybe once or twice in the first episode, but all of the jokes fell flat. Most of the characters do something that incredibly annoys me.\n\nWhat is the target demographic for this show? Not certain who this is supposed to appeal to.",
      "date": "Aug 7, 2020",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "Better than I expected. It still needs to get its bearings and the manic tone and rapidfire deliveries are going to irk some people. It's definitely a comfortable show that doesn't take itself too seriously though and maintains optimism where other new Trek offerings have fallen short.",
      "date": "Aug 7, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Not a family show (lots of naked men). Nothing like Star Trek. Don't know who this is for.",
      "date": "Aug 7, 2020",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "What did I just watch? I laughed when I shouldn't and I groaned when I should have laughed. Awful As a Child born in the 70s and a Trek fan from the beginnings, this is an insult to my intelligence.",
      "date": "Aug 6, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "i like the artstyle. very nice eye for details. i really would have loved it if it would not be as dumb as it is. Kurtzmen trek is is not for star trek fans. same with picard and discovery.\n\nHAIL THE ORVILLE",
      "date": "Aug 6, 2020",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "Great for Trekkies and casual Trek fans alike. Funny, lots of great in-jokes and trivia with a strong love of Star Trek at it's core. Think of it like Scrubs in Space.",
      "date": "Aug 6, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "This is so far humorous and entertaining, if not quite LOL funny just yet. I've only seen the premiere episode so far, and it is good enough so far for me to keep watching the show.",
      "date": "Aug 6, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Good TNG feeling. Outclasses all existing Trek show, and it is placed in original timeline. I like it.",
      "date": "Aug 6, 2020",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Very good and enjoyable",
      "date": "Aug 6, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Star Trek Lower Decks blew my expectations out of the water. You can tell it's put together by people who really love the franchise from the attention to details to the little references non trekkies are likely to miss. I love the character personalities in play here and that none of them fall strictly in to the tropes I honestly expected. The old Caitian nurse is easily my favorite character so far. \n\nOh, and most importantly, the comedy really works. The first gag didn't land for me so I was nervous, but every other joke and beat in the episode was great, punchy and well paced. None of the characters are overly goofy and the gags work well with the \"drama\". Watch it.",
      "date": "Aug 6, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I'm not really sure who this is made for, just seems like another of these reboot trek shows for an audience that's not there while insulting the existing fanbase in the process.\nIt's almost as if there's free money at CBS and they can't offload it into garbage shows fast enough. I'm past the point of no return in hope that the Star Trek franchise is not dead as it's been obliterated under Kurtzman, everything is so poorly written and of a schizophrenic nature, there doesn't appear to be a single science adviser in the writing room of any of their productions, including this.\n\nSo my first viewing of this will be my last, it's pure, unadulterated garbage determined to squeeze the last few cents out of a thoroughly destroyed franchise. It could all have been so different without Kurtzman.",
      "date": "Aug 6, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Disgraceful. Yet another series that simply isn't Star Trek. Alex Kurtzman has ruined this franchise. Shame on CBS.",
      "date": "Aug 6, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Not my cup of tea. I think this show doesn't know what it wants to be and it wasn't very funny.",
      "date": "Aug 6, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Really liked the humor, the tone and writing for the first episode. Also the references to other Star Trek series where perfect. Keep it up!",
      "date": "Aug 6, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    }
  ]
}