{
    "star-trek-picard": {
        "1": {
            "rating": 5,
            "review": " Simply the best! ",
            "time published": "20 Apr 2023"
        },
        "2": {
            "rating": 4,
            "review": "  Achtung: Ich bewerte hier ausschließlich die dritte und letzte Staffel von Picard.Für jemanden wie mich, der TNG, DS9, VOY und First Contact liebt bzw. auch damit aufgewachsen ist, war und ist die dritte Staffel von Picard ein wahres Fest.Wir hatten zwar bei TNG ein schönes Serienfinale, aber Insurrection und Nemesis haben mich nicht so überzeugt und vorallem Picard Staffel 1 & 2 haben mich wirklich sehr enttäuscht und gelangweilt.Emotional hat mich diese dritte Staffel aber so krass erwischt…  ",
            "time published": "21 Apr 2023"
        },
        "3": {
            "rating": 4,
            "review": "  Staffel 3, die endgültige Grenze. Dies sind die letzten Folgen des Serienversuchs Picard, seiner fortgesetzten Mission, nicht so fremde neue Welten zu erforschen, neues Privatleben und vertraute Zivilisationsfeinde zu finden und mutig dorthin zu gehen, wo wir alle schon so oft zuvor gewesen sind. Um in den Gezeiten der Sternenflotten Treiben die Flut zu nutzen, die zum Glück trägt. Versäumt man sie, so stoppt die Lebensreise auf seichten Sandbänken wie Staffel 1 und führt ins vermeintliche Unglück namens Staffel 2.…  ",
            "time published": "10 Jun 2023"
        },
        "4": {
            "rating": 4,
            "review": "  Like many others: I haven't seen this series finale at an IMAX theater. 'Cause there are non around. But; this finale is a true event nevertheless. And since Letterboxd offers me an option to log it that way ...No spoilers/details: Although the last episode is a bit rushed in bringing (almost) all story lines to a satisfying end, it is still an outstanding series finale. The best send-off for this legendary starship crew since 1994, and all thanks to…  ",
            "time published": "21 Apr 2023"
        },
        "5": {
            "rating": 4,
            "review": " ...they stuck the landing. The rancid taste of Star Trek: Nemesis and the abominable Seasons 1 and 2 of this show are gone. This was a fitting and beautiful farewell to the TNG Era of Star Trek. Star Trek Ranked2023 Ranked ",
            "time published": "20 Apr 2023"
        },
        "6": {
            "rating": 5,
            "review": "  This is a review of the entire third season of Star Trek: Picard, which plays like one long 8-hour movie. I will begin by noting that I am a huge Star Trek fan, and that Star Trek: The Next Generation was and still remains my favorite of all the Star Trek shows. I loved the wonderful stories, the characters, the world-building, and the special effects. The show gave us a great seven year run (well, truthfully, more like a great…  ",
            "time published": "20 May 2023"
        },
        "7": {
            "rating": 4,
            "review": " Let's just say season 3 of Picard was a limited series, never talk about the first 2 seasons, and celebrate Star Trek glory once again. ",
            "time published": "20 Apr 2023"
        },
        "8": {
            "rating": 4,
            "review": " Star Trek: Picard Season 3, Episode 1 - re:ViewStar Trek: Picard Season 3, Episodes 2, 3, and 4 - re:ViewStar Trek: Picard Season 3, Episodes 5, 6, and 7 - re:ViewStar Trek: Picard Season 3, Episodes 8, 9, and 10 - re:View ",
            "time published": "24 Apr 2023"
        },
        "9": {
            "rating": 4,
            "review": " Shameless nostalgia pandering, but I don't care. I DO NOT care. This reunion was never going to happen but yet it did and here it is and I loved nearly every single second of it. ",
            "time published": "24 Apr 2023"
        },
        "10": {
            "rating": 1,
            "review": "  People have lost their collective minds again.Everyone is so happy to see the crew and the ship again that they are glossing over what a turgid mess Episodes 9 and 10 really are.The pacing is awful and it suffers from all of the same problems that impacted the previous two season finales of Picard and the three seasons of Discovery I managed to sit through. Namely there is about 25 pounds of episode in a 1 pound bag.…  ",
            "time published": "21 Apr 2023"
        },
        "11": {
            "rating": 4,
            "review": "  Worf: And I will make it a threesome.Riker: Do you even hear yourself?I have to start off with a confession...I did not watch this in IMAX....although after suffering through an incredibly glitchy streaming experience with the Paramount+ app, I really wish I'd had the opportunity to see it in the theater, because this looked fantastic...at least when it wasn't dropping frames and audio, then inexplicably jumping back to the last commercial break.I've never been Star Trek: TNG's…  ",
            "time published": "03 Dec 2023"
        },
        "12": {
            "rating": 2,
            "review": "  Nur wenige Worte und ein Querschnitt in der Bewertung, durch drei Staffeln ‚Picard‘, die der eigenen Selbsteinordnung unterstützend dienen sollen:—Staffel 1: Interessante Versuchsanordnung, wenngleich nicht sonderlich inspiriert inszeniert; nette Verwebung aus neuen Ansätzen und gewohnten „Attitüden“ aus der Vorgänger-Serie ‚The Next Generation‘. (2 Sterne)—Staffel 2: Ärgerliche Eigenständigkeit, die im Laufe ihrer Erzählung völlig aus den Augen verliert, was sie eigentlich sein will und wohin sie steuert. Wird in der Zukunft - „unter Fans“ - vielleicht so eine Art…  ",
            "time published": "02 May 2023"
        }
    },
    "yellow-jackets": {
        "1": {
            "rating": 5,
            "review": " Yellowjackets Season 1-2 ",
            "time published": "09 Nov 2023"
        },
        "2": {
            "rating": 4,
            "review": " * usando para fazer a review da série * gente, mas que PORRA FOI ESSA EU PRECISO DE RESPOSTAS ",
            "time published": "19 May 2024"
        },
        "3": {
            "rating": 4,
            "review": " usando pra série (primeira temporada)menos meia estrela por conta dos erros de continuidadenao imaginei q eu ia gostar TANTO vsf to em choque ",
            "time published": "11 May 2024"
        },
        "4": {
            "rating": 5,
            "review": " A shauna comeu a jackie mas n do jeito que elas queriam se comer ",
            "time published": "15 Apr 2024"
        },
        "5": {}
    }
}