{
  "elsbeth": [
    {
      "review": "I actually really like the shows characters and the acting is very good. My issue comes down to the writing.  I am not really sure what I am watching.  I would lean toward murder/mystery but it isn't really.  There is a murder, but there is no mystery.  The audience knows who killed the victim and then waits around to see how Elsbeth figures it out.  I'm sure the writers think this is clever, but is it really?  It seems like a waste of a lot of talented people on writing that is, at best, mediocre.",
      "date": "May 12, 2024",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "I absolutely love this show. It's a quirky comedy crime series...reminds me of Monk. I miss those types of shows.",
      "date": "May 6, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I’m disappointed. I loved the character on Good Wife, and was looking fwd to the shows…but now realize it doesn’t work for me as a whole show. For me, I like to watch a cop show not knowing the who’s guilty. That’ ruined bec Elsbeth knows the guilty party by looking at them and does her quirky bit to annoy them into being caught. I say annoying because that’s how I feel when watching and why I turned off the episode abt the plastic surgeon. She wasn’t upset so it equaled quilty. ANNOYING.",
      "date": "Apr 27, 2024",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Replacing defence attorneys with cops was a terrible move. If the copaganda doesn't turn you off, the stuffy writing will. It's a real shame as I loved the Elsbeth character in the Good Wife/Fight.",
      "date": "Apr 23, 2024",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "I never saw this character in its precursor shows, such as the good wife, and others. It is a quirky Columbo meets   Poirot. There could be shows where the real author of a surprise, but it would be complicated for a show where the real mistery is what or who is she investigating in the NYPD, and that is revealed  slowly. We are only look at the Captain, but there are other characters that could emerge that she could be investigating. People who are focusing and critizing that the author of the episode's crime fail to see that the real mistery is what is she investigating, right now we think that he is only investigating the Captain, but the season is young. I like the show, and the dialog and the characters are well defined, well written, and the Elsbeth character is beautifully performed.",
      "date": "Apr 22, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "What a delightfully intriguing series! Elsbeth is such a wonderfully quirky and lovable character. I imagine her to be an adult version of Beverly Clearly’s Ramona, who has found a way to channel her mischievousness into a unique & successful professional calling.  Each episode delivers a cat & mouse challenge for Elsbeth to wrangle a perpetrator to justice, while protecting the wrongly accused. It is known from the onset who the guilty party is; the delight comes from the central character’s over the top personality, manner, fashion choices & deceptively innocent and enthusiastic approach to sleuthing.  The casting is excellent. The writing is simultaneously savvy & whacky.  I look forward to each episode for a delightful opportunity to experience intelligent and empathetic silliness.  Columbo step aside!",
      "date": "Apr 20, 2024",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Agatha Christie meets Peter Falk - Colombo+Murder on the Orient Express - except the answer is known before the first commercial.  What were they thinking?  I feel sorry for a talented cast struggling to bring a theme to this confused show.   Oh well, maybe season 2 - if there is a season 2 - will cure all ills.",
      "date": "Apr 19, 2024",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is where we are now in 2024 \"network\" TV! Terrible writing! The only exception might be 'So Help Me Todd', as that has actually been refreshing. Throw in that they can at least develop a character like, uh, oh, the incomparable Castle comes to mind.  I realize most network murder mystery shows over the years can be predictable; I mean how many Mentalist's, Angela's and Monk's can one have:) This show however, is so forced and obvious that it has become unwatchable; after only 5 episodes!  Why you ask? Hmm, is it knowing the killer at the beginning? Nope; been done before. Is it the amazing and inquisitive mind of Elsbeth? Definitely not! I can write her entire script 5 minutes in. Is it entertaining?? Marginal. I lasted 5 episodes, but I and the show quickly  ran out of intelligence, writing skills and characters I like! Piece out folks.",
      "date": "Apr 19, 2024",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Loved her on the Good Wife and was so excited when I saw there’s a whole show around her character! Also with Wendell Pierce! He takes every show up 10 notches. I love the female detective as her new bff. I hope they have Jane Krakowski‘s as a recurring character, they did some greattttt recurring “bad guys” on the Good Wife that were awesome. \n\nThis show is just so refreshing compared  to the many crime dramas and heavy shows out there. \n\nThank you for making this show! Please please have \na second season!!",
      "date": "Apr 18, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Loved her in The Good Wife, loved her in the The Good Fight and definitely love her in this show. It's just good, funny entertainment",
      "date": "Apr 16, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I have been hoping Elsbeth and am very happy that it does not disappoint.",
      "date": "Apr 15, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great show! Hoping it gets renewed!!!",
      "date": "Apr 15, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Wendell Pierce steals every scene he's in. Good show.",
      "date": "Apr 14, 2024",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "A newer worse version of Murder She Wrote, with a character ten times more annoying than Jessica Fletcher.  This show is so bad it's cringe worthy.",
      "date": "Apr 14, 2024",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I liked her character better when she was a lawyer.  The way this show is set up where you see the murder and then you watch her quirkily put the pieces together gets a little old.  Maybe if we also didn't know who the murderer was it would be more fun",
      "date": "Apr 13, 2024",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "love the show.she is like a female Columbo.but way more fun. Story line is great",
      "date": "Apr 12, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "**Elsbeth**: A Captivating Legal Drama with Carrie Preston at the Helm\"\n\n\nPrepare to be enthralled by the magnetic performance of Carrie Preston in the exhilarating new legal drama *Elsbeth*. Set against the backdrop of the cutthroat world of corporate law, this series not only delivers riveting courtroom drama but also explores the complexities of power, ambition, and morality with nuance and depth.\n\n\nPreston takes center stage as Elsbeth [Astute but unconventional attorney Elsbeth Tascioni utilizes her singular point of view to make unique observations and corner brilliant criminals alongside the NYPD.], a brilliant attorney whose unorthodox methods and razor-sharp intellect make her a force to be reckoned with in the legal arena. With her trademark charisma and impeccable timing, Preston breathes life into the character, infusing Elsbeth with a captivating blend of confidence, vulnerability, and moral ambiguity.\n\n\nBut it's not just Preston's performance that makes *Elsbeth* a must-watch. The show boasts a talented ensemble cast who each bring their own unique talents to the table. From [Wendell Pierce] to [Carra Patterson], every member of the cast delivers standout performances, elevating the series to new heights.\n\n\nAt its core, *Elsbeth* is a masterclass in storytelling. Each episode is a rollercoaster ride of suspense, intrigue, and ethical dilemmas that keeps viewers on the edge of their seats. From high-stakes courtroom battles to behind-the-scenes machinations, the show expertly navigates the complexities of the legal system while never losing sight of the human drama at its heart.\n\n\nVisually stunning and impeccably crafted, *Elsbeth* is a feast for the senses. The sleek and stylish production design transports viewers into the world of high-powered law firms and corporate boardrooms, while the crisp cinematography captures every subtle nuance and emotional beat of the story.\n\n\nIn summary, *Elsbeth* is a triumph of television storytelling that will leave audiences spellbound. With Carrie Preston leading the charge, this series is a tour de force of acting talent, gripping narrative, and thought-provoking themes. So don't miss out on the legal drama event of the year – tune in to *Elsbeth* and prepare to be captivated.\n\n \n\nGet ready to be hooked on the thrilling legal drama Elsbeth, a show that stands shoulder to shoulder with the best in the business, including Only Murders in the Building. Led by the incomparable Carrie Preston, Elsbeth delivers an immersive and captivating viewing experience that will leave audiences clamoring for more.",
      "date": "Apr 9, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Witty, smart and funny . . . a must see especially for those of us that approach things 'differently'!",
      "date": "Apr 6, 2024",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "Absolutely marvelous from Carrie Preston's performance to the scripts, locations and filming. It's a murder mystery with a wry sense of humor.",
      "date": "Apr 6, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show is awesome!!! Carrie Preston is the best. Watchting her on The Good Wife and The Good Fight I was always thinking why didn't she had her own show. Also the way Robert and Michelle King managed to put Elsbeth in a crime solving environment like Monk (TV Show) is fantastic!",
      "date": "Apr 5, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Well Done CBS....Never seen the GoodWife or GoodFight. Totally new to the character Elsbeth. Great performance, Great writing. I'm hooked.",
      "date": "Apr 5, 2024",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "I'm really hooked after episode 1! I'm bummed they took a whole month to release episode 2 but I'm so looking forward to watching it this Thursday :)",
      "date": "Apr 1, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I'm shocked how well this is rated.  This show is real dumb.  I guess if you're looking for a totally silly, virtually camp, version of a crime show then you'll like this.  Kinda Monk-esque, but even more ridiculous.",
      "date": "Apr 1, 2024",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "I love knowing the criminal right away and watching her figure it out, what a fun and refreshing twist. And she is fabulous! I look forward to watching her for years to come.",
      "date": "Mar 29, 2024",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "New to Elsbeth from previous other shows, loved it!",
      "date": "Mar 28, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Lot of viewers who are not familiar with Elsbetth from The Good Wife are unaware of her being on the Autism Spectrum,  and dismissed her behavior as 'over the top acting'. They could not be more wrong. It is a major part of her character,  and can explain so many of what they call 'annoying traits.  Being on the Spectrum myself and having THREE Autistic grandsons, and having enjoyed her previously on the Good Wife,  I was very happy to see her back on television, where she belongs. My entire family  LOVED the pilot and are awaiting the next episode!",
      "date": "Mar 28, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "An absolutely wonderful show, based on a well written, intelligent character.  It’s ridiculous that the premiere would air and then not show another episode for a month, though - it reminds me of streaming services that make the audience wait a year+ for new seasons.  I hope the audience doesn’t lose interest in the extended break - I know I’m getting tired of waiting.",
      "date": "Mar 18, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "As a Good Wife and Good Fight fan, I love the character Elsbeth and so excited to see she has gotten her own show. I wish they didn't do the pilot and then nothing until April, but I'm looking forward to it starting. The great thing is that you didn't have to watch those shows to enjoy watching Elsbeth. It's a stand alone.",
      "date": "Mar 18, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great show. Feels like a book you don't want to put down. Literally, asking: What's going to happen next around every corner, and main character who plays Elsbeth is superb. Thank you!",
      "date": "Mar 18, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I was tentative to try this but my wife loves the Good Wife and roped me into it.  It’s actually pretty fantastic.  The promos make it seem wackier than it is.  She’s funny but not annoying and there’s enough realism to keep you interested.",
      "date": "Mar 17, 2024",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Saw the first episode and enjoyed it.hope they don't go too dark with it.kinda reminds me of murder she wrote,serious but still with a light feel.my brain needs a break from all the seriousness.",
      "date": "Mar 15, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Weill, I never watched \"The Good Wife\" and don't intend to. But \"Elsbeth\" grabbed me from the first few minutes of this marvelous show.  Made me think....\"Columbo is BACK,\"  only this time Columbo is a quirky female, and she's wonderful.  I don't think the gap between its debut and its next episodes (almost a month!?!) is going to do the show any favors.  But I plan to stick with it.",
      "date": "Mar 15, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great!  Finally, after long time, entertaining show to watch. Makes me go to bed smiling.",
      "date": "Mar 13, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "\"Elsbeth\" is an absolute gem of a show! I just watched one episode, and I'm already hooked. The storyline is captivating, the characters are intriguing, and the production quality is top-notch. Can't wait to see what happens next!",
      "date": "Mar 7, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Brilliant!! Quirky and smart! Very entertaining! Watch it. You’ll be glad you did.",
      "date": "Mar 6, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Elsbeth was one of my favorite characters on the Kings' shows. So happy they gave her, and the amazing Preston, a showcase. The show itself did not disappoint. Elsbeth's personality was a bit tampered down than usual, but given she's the title character, I can understand why she can't go full kooky all the time like she's been in the other shows, where she has limited screen time.",
      "date": "Mar 4, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Honestly, Elsbeth was my favorite from The Good Wife universe so I watched with caution. Did not disappoint! Really enjoyed it and already feel like it can only get better!",
      "date": "Mar 3, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great pilot episode! I'm a big fan of the Kings, so I was excited to see this. It was upbeat, well acted and directed, and the writing was top notch. I'm looking forward to the rest of it!",
      "date": "Mar 2, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "How can the Elsbeth pilot be only TV-PG?\n\nThe opening is so much like an episode out of Dexter and that was TV-MA.\n\nThere should have been more warning about the graphic nature of this series or at least the opening.\n\nMe and my wife had been looking forward to Elsbeth. Thoughts of Monk, Colombo, and other shows came to mind thinking about a comedy-drama that was going to be delightful.\n\nBut that is certainly not what we got, while the charter Elsbeth may be delightful, the graphic beginning was way too much. It was like watching an episode of Dexter.\n\nWe will not be watching any episodes from here on out we just do not need the trauma inducing gore, even if it lasts only a few minutes.",
      "date": "Mar 2, 2024",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Awesome show. Witty, clever with a fantastic cast. Looking forward to the upcoming episodes",
      "date": "Mar 2, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Such a fun premise! Acting is great! Love the Elsbeth actress!! Enjoying this show! 🙌🏼 It reminds me a bit like “Murder She Wrote,” only with more humor!",
      "date": "Mar 2, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Wonderful! Everything I was looking for as a fan. Good writing and excellent performance. I can't wait for the next episode.",
      "date": "Mar 1, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Funny and smart.  She reminds me of Columbo.  A show you can watch with your family.",
      "date": "Mar 1, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Finally a crime show that’s not built on overdramatizing every scene! This show is funny and very much like the show MONK. And the acting is top tier! Give it a shot! You won’t be disappointed!",
      "date": "Mar 1, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Dumb…just dumb…CBS is spiraling outta control with these new shows…",
      "date": "Mar 1, 2024",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "The show was okay but I found the character to be annoying!\nNot on my top 10 TV list.",
      "date": "Mar 1, 2024",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "Fun, well paced and intelligent!",
      "date": "Mar 1, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Absolutely LOVE the show. I have been waiting for a new show to come out that I can actually get into. This is the one 😀.",
      "date": "Mar 1, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    }
  ]
}