{
  "star_trek_lower_decks": [
    {
      "review": "They expand on the amazing lore so much this season!\nThis is the direction Alex Kurtzman needs to take to \nkeep the fans motivated. \nLower Decks and Star Trek: Legacy NOW!",
      "date": "Apr 12, 2024",
      "rating": 5.0,
      "episode info": "Season 4"
    },
    {
      "review": "Talk about grabbing an entire franchise by the nards.......This show is what lifetime TREKKIES see in their dreams. THANK G....... MIKE that he was so brave and witty and complete with this absolute GEM of a STAR TREK program. PLEASE KEEP MAKING THIS FOREVER!",
      "date": "Jan 7, 2024",
      "rating": 5.0,
      "episode info": "Season 4"
    },
    {
      "review": "The writers have more or less given up on writing a story about characters that serve behind the scenes of your usual star trek series heroes. Instead it's just a series of memes and references (getting really self referential for jokes now, yeesh), and over the top silly and self indulgent plots for the sake of being silly and self indulgent using star trek references. Less of a show and more of a YouTube channel for casual sci-fi nerds.",
      "date": "Nov 30, 2023",
      "rating": 2.5,
      "episode info": "Season 4"
    },
    {
      "review": "The satirical yet loving trek series which is lower decks continues, with the glorious adventures of our favourite foursome. Continuing old stories and making some new ones, I never feel bored and oomg fir the next installment. Long may it prosper.",
      "date": "Nov 23, 2023",
      "rating": 5.0,
      "episode info": "Season 4"
    },
    {
      "review": "The first 3 Seasons where really good, this one lacked a bit at the plot. overall fine series tho.",
      "date": "Nov 18, 2023",
      "rating": 3.0,
      "episode info": "Season 4"
    },
    {
      "review": "To everyone saying \"this isn't Star Trek\" (*yawn*), yes, it's not TNG or DS9, but who wants a carbon copy of a 30yo show? I also think people forget about the inevitable filler episodes we had to endure back then, when production values were a bit less strong.\n\nLower decks remains a completely different beast whilst still celebrating everything that went before it and cramming a lot of great stuff into 10 episodes.\n\nYes, not all of the current shows are amazing (looking at you, Discovery), but I genuinely think Lower Decks keeps getting better and better. \n\nMore please!!",
      "date": "Nov 4, 2023",
      "rating": 5.0,
      "episode info": "Season 4"
    },
    {
      "review": "This week's episode heavily featured the Vendorians. A shapeshifting race of aliens first (and only) shown in an episode of Star Trek: The Animated Series from the 1970's. \n\nBut the Vendorians have played a part in my acceptance and eventual love of Lower Decks. \n\nTo say I was ambivalent about Nu-Trek is understating it. I HATE Discovery. And Picard (until the third season) was only marginally better. So I didn't have high hopes for Lower Decks. I watched the pilot episode and liked it. But it was nothing to write home about. Then I watched the second episode where Mariner and Boimler are looking for a Klingon diplomat in a \"Little Andoria\" neighborhood. They go into a bar and see these two Andorians beating up and old man Andorian. Boimler, being the gallant Starfleet type, intervenes. But then the old Andorian shapeshifts into its Vendorian form and escapes. (It was grifting the two other Andorians.)\n\nIt was such a fast and funny joke. But I was like instantly \"Wait! Was that one of those shapeshifting aliens from that TAS episode with Carter Winston?!?!\" (I didn't even know the name of the species it was such a deep cut)\n\nIt was at that moment I realized… everything was gonna be all right. Whatever happens, this is a show made by Star Trek fans, for Star Trek fans. \n\nThis is great Trek.",
      "date": "Oct 22, 2023",
      "rating": 5.0,
      "episode info": "Season 4"
    },
    {
      "review": "The best season yet, Lower Decks has really hit it's stride in telling new stories with classic Star Trek messages",
      "date": "Oct 20, 2023",
      "rating": 5.0,
      "episode info": "Season 4"
    },
    {
      "review": "This is a single review for all four seasons.  \"Lower Decks\" is a Spaceballs-type spoof cleverly rendered by the Star Trek universe itself.  The ability to look at one's self in the mirror and see someone worthy of self-parody is a genuine virtue.  Never take yourself too seriously is the rhyme and reason of \"Lower Decks.\"  Only the most 'sophisticated' Star Trek fans will miss this point.",
      "date": "Oct 8, 2023",
      "rating": 4.5,
      "episode info": "Season 4"
    },
    {
      "review": "Episode 5 was the worst so far. Too much language and a plot straight out of animal house. Needs more creative Star Trek and less silliness for the sake of silliness.",
      "date": "Sep 29, 2023",
      "rating": 2.5,
      "episode info": "Season 4"
    },
    {
      "review": "horrible show !! I didn't think it was funny? and I thought it was gonna be funny?",
      "date": "Sep 25, 2023",
      "rating": 2.0,
      "episode info": "Season 4"
    },
    {
      "review": "What happened to Star Trek over the last decade or so? Rewatch TNG and DS:9 and you will see how bad it is now!",
      "date": "Sep 23, 2023",
      "rating": 1.0,
      "episode info": "Season 4"
    },
    {
      "review": "Lower Decks consistently stays fresh while paying homage & sticking to Star Trek canon. The 4th season sees our 4 favorite ensigns get promoted to junior grade lieutenants & adds the Vulcan T'Lyn to the group who fits in seamlessly. I always watch every episode twice. It's probably the best current Star Trek  series which is saying a lot because Strange New Worlds is great & after 2 amazing seasons the last 2 seasons of Discovery were very disappointing.",
      "date": "Sep 21, 2023",
      "rating": 5.0,
      "episode info": "Season 4"
    },
    {
      "review": "This is looking awesome",
      "date": "Sep 17, 2023",
      "rating": 5.0,
      "episode info": "Season 4"
    },
    {
      "review": "After the A-M-A-Z-I-N-G crossover with Strange New Worlds, Season 4 of Lower Decks are really killing it. The season opener was really a love letter to all things Trek.  More please!",
      "date": "Sep 9, 2023",
      "rating": 5.0,
      "episode info": "Season 4"
    },
    {
      "review": "Only two episodes in and it's already great.",
      "date": "Sep 8, 2023",
      "rating": 4.0,
      "episode info": "Season 4"
    },
    {
      "review": "I'm a glutton for punishment.  Why do I watch hoping it will get better?  I should just stop.",
      "date": "Sep 8, 2023",
      "rating": 1.0,
      "episode info": "Season 4"
    },
    {
      "review": "Love this show and the newest season has a strong start. The only real criticism i've seen from others so far is that some fans haven't liked other shows on Paramount and the series that examined racial, sexuality, gender and religious issues since the 1960s has continued to do so.",
      "date": "Sep 7, 2023",
      "rating": 5.0,
      "episode info": "Season 4"
    },
    {
      "review": "It's still not Star Trek.\n\nThe writing still feels like it's more concerned with conjuring up references to previous material than doing anything new. The show is also abandoning its admittedly interesting premise of exploring lower decks of a starship under the guide of character development.",
      "date": "Sep 7, 2023",
      "rating": 2.0,
      "episode info": "Season 4"
    },
    {
      "review": "It's disheartening to see a show that was so amazingly queer just backpedal on LGBTQ+ representation. The main character (who was previously in a relationship with another girl) is kissing men now.",
      "date": "Sep 7, 2023",
      "rating": 1.0,
      "episode info": "Season 4"
    },
    {
      "review": "It's just not the same show, and I don't mean this as a positive at all.",
      "date": "Sep 7, 2023",
      "rating": 2.0,
      "episode info": "Season 4"
    }
  ]
}