{
  "yellowjackets": [
    {
      "review": "A show that seemingly starts off as a coming of age story of a girls soccer team which after an airplane crash takes a turn and progressively gets darker and darker.",
      "date": "May 7, 2024",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "I only watched 3 episodes. I didn't see anything likeable but I saw a lot that I don't like. Some of the characters are really unrealistic. Misty most of all. Her character is really phony. Most of the romantic relationships lack all credibility as well. Appalling 3 episodes.",
      "date": "Apr 19, 2024",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "The most enjoyable thing I have watched in yearsss. Watching felt nostalgic while leaving me on edge. Perfection.",
      "date": "Apr 19, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Just really, really lame. It starts out with a decent sense of intrigue and craft, but quickly descends into directionless nonsense. I'm all for telling a supernatural story, but it still needs to be believable, the characters need to make sense and the backstory needs to be consistent, this really feels like they're just making it up as it goes along, without any real care of what came before or how it ties together. \n\nAdd to that that it's meant to be based on an actual story with actual victims and motives, it moves from just feeling dumb to feeling exploitative and disrespectful. Sies.",
      "date": "Apr 9, 2024",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "This is one of my favorite shows of all time. When I watch it there’s never a dull moment. Yellowjackets consistently keeps me on the edge of my seat and has in part due to the incredibly talented main cast who’s older and younger versions of the characters are each giving unbelievably real and often gut-wrenching performances. Heartfelt and Heart-wrenching through and through.",
      "date": "Mar 26, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "One of the best, most creative shows currently on TV.",
      "date": "Mar 11, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "literally one of the best shows i've ever seen",
      "date": "Feb 11, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Season 1 was so fresh and interesting. Horror on TV trends to be schlocky and formulaic, but Yellowjackets has unusual twists and turns and kept me guessing. Loved it.",
      "date": "Jan 28, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I cannot believe I fell for marketing and trailers again. Far too surface level to be interesting. Poor pacing and storytelling. Horribly forced dialogue. Very basic, dumb as bricks characters. Shame because Episodes 1 & 2 had me on the edge of my seat, as it usually happens",
      "date": "Jan 17, 2024",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "10/10 must watch, such a fabulous cast. They all compliment each other so beautifully! Such a cool and dark concept! And some fun twists and turns. Really excited to see where it goes.",
      "date": "Jan 9, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Loved this, well except for all the guts. \nIt's like a hybrid of 'the craft' and 'lord of the flies'",
      "date": "Dec 29, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Extremely immature show. Would think it was made for kids if it weren't for all the forced gore. Ultra basic writing, cinematography, cliche tropes.",
      "date": "Dec 17, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "First off, teenage sex scenes are DISGUSTING.  there are so many sex scenes that I had to skip through them all, which was like 40% of most episodes. There was so many scenes that did not need to be part of the storyline. It was extremely slow moving and it took an entire season just to get zero answers about what was going on. I thought it would get interesting but I honestly skipped through so much boring, disgusting sexual content along with stories about them as adults that seemed like fuller content. I only watched this because I appreciate Juliette Lewis and Christina Ricci as actresses. This could have been so much better. I can't believe so many people liked this boring drab of a show.",
      "date": "Dec 2, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Rating: 7/10. 77/100",
      "date": "Nov 21, 2023",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "Season 1 really has everything you want in a mystery. It unfolded with perfect timing and the cast is fantastic and really compelling. The past and present actresses are really amazing. The story is creepy and eerie but the show still finds a way to be funny and sincere in showing teens trying to survive something crazy.",
      "date": "Nov 18, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Filled with thrills while blending several genre styles smoothly, Yellowjackets Season 1 lacks some of the visceral punch and well voven storytelling that this show needs, although it is still a mostly gripping and athmospherically tense season that is also technically stunning.",
      "date": "Nov 5, 2023",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "Den kan ses men er nok mest interessant for teenager, men ellers et godt bud på hvordan mange religioner er startet bland forstyrrende folk i nød der higer efter at der skal være en mening med alt der sker, godt og skidt, og så går det ellers over i en skal have magten og får andre til og slå ihjel i religionens navn, sådan forgår det jo stadig den dag i dag.",
      "date": "Oct 24, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "Definitely not your average horror story but it's definitely better. Like when there's a car accident but you can't look away. Your horrified but interested. Unlike most pilot episodes this one starts off hot like a rocket. 😉",
      "date": "Oct 21, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The mystery interwoven between two time periods with the same characters is unique and spellbinding.  The story unfolds with precise care to keep the audience wanting more.  Who is the girl in the ditch for God's sake?  Who is the Queen?  The ensemble in the past and the present are strong all around.  Particular standouts are Melanie Lynskey, Christina Ricci, and Sammi Hanratty.  I watched six or seven episodes in two nights and convinced my wife to watch the pilot.  She got hooked.  So I watched those episodes again with her and finished out the season at the same time Season Two premiered.  A very fun personal journey through the show thus far!  She and I are the same age as these women and the soundtrack which brings 90's alt rock hits out to match the context so wonderfully is top notch in our books as well!",
      "date": "Oct 17, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show is SO captivating. The characters, the mystery, The tension, I couldn't stop watching, I watched episode after episode. I love all the girls, especially Taissa, Van, Misty, and Natalie. Every character is so complicated, and their friendships and/or relationships with each other are even more complex. I love shows that center female characters and female relationships and their complexity, and this show does NOT dissapoint, every woman on this show has a story to tell, and I am seated for each one. I am rooting for every single one of these evil girls, and I can't wait to see what they do next. My only wish was that this show was on a more popular streaming service, so then more people would watch it. It deserves WAY more viewership.",
      "date": "Sep 25, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "My current favorite series, also in my overall top 3. I love horror and i usualy dont really find it scary but this series has bled into my intrusive thoughts. I love the visuals and characters and the casting for the adult versions are very acurite. The mystery behind everything is so intriguing and i love hearing other peoples theories on it.",
      "date": "Sep 15, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Original storytelling with continuous flashbacks that need some time to understand and fully appreciate the series, but when you begin to watch then you can't really stop. The young actors are amazing as well as the \"adults\", with the oustanding performances of Juliette Lewis and Christina Ricci.\nFor sure a MUST SEE.",
      "date": "Aug 29, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "If you want to go on a wild thrill ride, this show is for you.",
      "date": "Aug 22, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "So good!  Suspenseful and keeps you interested in wanting to hear more of the story!  \nReally good story!",
      "date": "Aug 21, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Amazing very Mind boggling",
      "date": "Aug 19, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Solid acting propels the series. The plot line is solid as well. Engrossing and I binged the first two seasons. Just hope the ending justifies the investment… we'll see.",
      "date": "Aug 12, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Love this show and really recommend it 😊",
      "date": "Aug 12, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The show begins in an interesting way, until you find along the way that there's nothing beyond the mystery. The characters are mostly stupid and/or flat. The show fails to deliver the situation they're living at (for example: they are months in the wood and claim they are starving, but no one is getting sick from this and you can see that no one is losing weight).\nOverall - wasted potential.",
      "date": "Aug 3, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "It has been so long that I can catch a show that just gets me excited to leave work and turn on the computer. This is mysterious, with a lot of twists, but you can still tell what is about to happen, it does not thinks the person watching is dumb and it looks real and raw. I love it",
      "date": "Aug 1, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The kinnda show you just want more and more.",
      "date": "Jul 27, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Addicting, such a good show.",
      "date": "Jul 26, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "As mudanças frequentes na linha do tempo são horríveis. Não entendo como essa série tem uma aprovação tão alta, pq geralmente minha opinião coincide com a crítica geral.",
      "date": "Jul 23, 2023",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "it got good parts. But overall it is really really stupid. Like the whole main plot is nonsense, the drama is nonsense and the characters are too stupid.\nAnd the season final.... one of the worst is seen ever. Just complete nonsense.",
      "date": "Jul 8, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Good season good show Left u wanting more",
      "date": "Jul 8, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Love this series the first episode you find yourself already addicted to watch the rest of the series. Love the cast.",
      "date": "Jun 26, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "S1: Fajny klimat, dobrze się ogląda. Ciekawe postacie. Fabuła dobrze poprowadzona, ale tajemnice albo szybko wychodzą na jaw, albo wyjaśnienie rozczarowuje",
      "date": "Jun 25, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "It's a great first season for a show with a lot of potential.",
      "date": "Jun 13, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Season 1 is very good. Season 2 is awful",
      "date": "Jun 13, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "This season was excellent. Laura Lee's entire plot was fantastic and brave, Jackie was incredibly well acted and her passing was beautifully tragic. The whole show showed a lot of potential, with the only giant issue being that the adults spoil the stakes.",
      "date": "Jun 5, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Solid bad tv. Alternately goofy, grotesque, and cringe.",
      "date": "May 28, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "The show is a slog to watch. Good actors yes, but just so \" mysterious\" to a point it's annoying. It's like where's the point and how can you get to it.",
      "date": "May 27, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "First part of season so spooky and gory poor pit girl (which is obviously mari) although skill issue for falling into pit of spikes and was eaten. Rest of season spooky and flashbacks best part of series most interesting and spooky, loved scene of cult antler queen is beautiful although don't know who that is maybe will be revealed in season 2 or 3 which is so long away lolz hopefully writer strikes end and season 3 woo be finished and starts filming quickly and will be out and I will enjoy the rest of the Gworlz time in the wilderness and hoe they became the cult and started eating people although already ate Jackie (poor girl didn't t deserve to be eaten although she could've very easily went inside the cabin and couldn't freeze to death she was an icon) although can't wait for mari to be eaten that hoe is so annoying can't wait for her to be eaten good writing and sets acting top notch can wait for rest of episodes thx for reading bye",
      "date": "May 22, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I was hoping it'd be better than it was. Reminded me of the wilds on Amazon. That was a better series. Too bad it got canceled! This is a poor substitute. Thought there would be more of a horror or supernatural element at one point but that too flatlined. Highly predictable and at times annoying. Wish it was better.",
      "date": "May 22, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show really had my attention but I was more intrigued with the supernatural part of it that they kept teasing throughout the show but that just never came to fruition much. It felt like it wanted to give it to us but just kept grinding its tires in the mud. The parts they did give us delving in to the super natural were very creepy and I really dug it. Outside of that, the character arcs were great and overall it was an excellent show with excellent writing. I was just really hoping for some more of that super natural stuff. Hopefully they dive into more of that in Season 2.",
      "date": "May 17, 2023",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "LOVED IT!!!!##💯 it's a mix of mystery and paranormal all rolled in to one oh and a little murder as well.",
      "date": "May 16, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Perfectamente trabajada. Una dirección de casting deslumbrante. Es entretenida y dinámica. No hay forma de aburrirse porque te sumerge en una constante situación de incertidumbre con giros en la trama que van de la mano con la narrativa sin verse forzados o excesivos. QUIERO MÁS.",
      "date": "May 15, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It was a great movie but I would not recommend it for kids the scene where aquaman molests scooby doo is quite graphic. Besides that it was fun and amazing i would recommend it for all ages we had a fun family movie night at our house. But I don't think i will every be able to unsee  aquaman molesting scooby doo nore will my kids. I don't understand why they would put that in the it is truly disturbing. FIVE STARS!",
      "date": "May 15, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The back and forth between the present and the past keeps me interested. But the reality is that present cast holds my attention much more than the youngsters.  I mean, let's be honest, they're playing shallow teenage jocks.  Other than showing us what happened to make them hunt one of their own, there ain't much to it. But Linskey, Lewis and Ricci got it going on.",
      "date": "May 13, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "obsessed! xxxxxxxxxxxxxxxx",
      "date": "May 13, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Vine buscando cobre y encontré oro. Buen ritmo, logra sostenerse de principio a fin sin decaer, personajes dañados que logran ser queribles y odiables por igual según la situación como debe ser. Igual todavía no me enganche ni me fascina pero después de la primer temporada quedo mas que interesado por ver como sigue.",
      "date": "May 10, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "really wanted to give this show a chance as I usually love any spiritual descendants of Lord of the Flies/Heart of Darkness- Yellowjackets is just boring, disjointed, constant time line shifts just aren't done correctly and ruins the flow of the episodes. Most of the characters have this unlikeable, unrelatable, shallow brutality to them that just gets exhausting to watch. Couldn't get past the second episode.",
      "date": "May 8, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "This show is sort of like of Cobra Kai… it's so dumb and ridiculous that it's good. But it's still SUPER dumb and ridiculous.",
      "date": "May 7, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "I look forward in watching this show. Excellent storyline. In the first few episode it's difficult to figure out who is who, but once you get into the groove, the show is easy to watch, and suspenseful it is.  Juliette Lewis is a sad pragmatic character who, for one, is very deep and entangled in her own psyche. Just saying that, most of the show is not only dramatic, but suspenseful and fun. Great writing, that keeps you coming straight to watch. If you binge the first season, you yearn to see more, having the week by week intrigue, wanting it to drop a new episode. Showtime did a fantastic job picking up this show, while Paramount Plus allows you to have a cheaper, but worthy chance to connect the two channels.  Thank you!!!",
      "date": "May 7, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Awesome acting and concept. Loved it.",
      "date": "May 7, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Fantastic series,  brilliant plot, good story line and keeps you in suspence. Also bit of a scare element which makesnit more interesting",
      "date": "May 4, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "AMAZING SHOW REALLY GOOD IF YOU LIKE CREEPY DARK SHOWS BUT IF NOT I WOULD NOT WATCH BECAUSE ITS PRETTY GORY",
      "date": "May 4, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I don't quite hate this, but I'm close. Everything is unlikeable.",
      "date": "May 4, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Too much drama. Story can't progress.",
      "date": "Apr 20, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great show already on episode 10 very good show too.",
      "date": "Apr 18, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Such a good film. Original spin on the plane crash/stranded genre, great acting, very female centred which is nice, and great LGBTQ+ representative which with everything happening now is more important than ever.",
      "date": "Apr 17, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The characters and events are too preposterously stupid and/or crazy that I stay constantly annoyed as I watch this mess.  If I had something else to watch I wouldn't have made it past the first episode.",
      "date": "Apr 16, 2023",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "This show is truly a masterpiece. It is the perfect balance between teenage drama and horror. The characters are amazing, as well as the casting, and the show adresses trauma flawlessly.  The soundtrack mixed with the jarring imagery is beautiful to watch. The plot never drags and always keeps the viewer engaged, and is so incredibly human. Yellowjackets is my favorite show of all time, and is a must-see.",
      "date": "Apr 16, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "What a crazy conflagration of exploitation pics and girl power action epics!  This is a crazy confection of The Lord of the Flies; Swiss Family Robinson; Lost, I Know What You Did Last Summer; Thirty Something; Little Women; The Facts of Life; The Craft and Harvest Home.  The plot is one of those Now and Then/ Before and After narratives where the story is split in half; between the girl versions of the characters; and their middle aged woman doppelgangers.  The story follows a high school girl's soccer team called the Yellow Jackets.  The trouble starts for the team when they are flying on a plane to a national conference.  During the flight their plane unfortunately crashes in some remote part of the Canadian Rockies. And the girls are abandoned and without means for communication; and have to resort to all sorts of horrifying means for survival; breaking all the Ten Commandments; even dabbling into witch craft and cannibalism to survive.  And unfortunately once the girls have summoned these dark forces; they continue to terrorize them throughout their lives; bringing all sorts of bad luck; murder and mayhem.  So we see the horrific Lord of the Flies island experience; and then we see their lives 25 years later; and how that horrific event continues to have it's devastating ripple effect/ Butterfly effect on the present. As stated before; this is a going for broke exploitation pic; so they throw in every shock trope under the sun; cannibalism; lesbianism; weird pagan ritualistic sacrifices; black mail and murder; summoning the spirits from beyond and the occult; stalking and abusively codependent relationships; ESP; and about a billion other verboten topics I'm forgetting.  It's also like an old fashioned nostalgia pic; a la American Graffiti or Grease; shoe-horning the late 90s into the stream; and as such we get a bevy of delightful Gen X grunge classics like \"Can't Fight the Seether\" or Seal's \"A View to a Kill\".  It's also great that they brought 90s child stars Juliette Lewis, Elijah Wood and Christina Ricci into the mix; it ads the perfect campy pop culture resonance that this piece needs.  Wood and Ricci, who played love interests in the 1997 dramatic classic Ice Storm (also a nostalgia piece); are back playing a couple again; hilariously!  (Ricci herself ironically starred in a similar now and then type nostalgia pic in 1996 called; appropriately enough, Now and Then; where she played the younger half of one of the characters displayed. Now she plays the older half in another nostalgia pic 25 years later; so everything comes full circle!!).  The cast and the storylines are all delicious.  It's got a similar flavor and feel to another big sci-fi fantasy exploitation soap opera show from 2010s True Blood series. Although the subject matter is very different, (vampires vs. a murderous volley ball team); the feeling you get from it; it's vibe; that of a super lurid campy and sci-fi exploitation pic which throws in everything but the kitchen sink in terms of fantasy tropes; and which appeals largely to queer audiences and women; that aura, that feeling; is exactly the same here.  The plot; which is basically in all it's permutations a psychological thriller; following various cat and mouse games that manifest itself between the characters, is extremely complex and ornate; you might even call it baroque!  And most of this is fun and works very well!  My only complaint is that there are SO many subplots here; that sometimes it does get a little confusing.  Still a great show though!  Loads of black humor and creepy and impressive sci Fi moments; and good old fashioned grand guignol type fun! Let the games begin ladies!",
      "date": "Apr 15, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "With equal part thriller and nostalgia, this clever premise takes you to the brink of \"knowing\" but always leaves you wondering and wanting more. Fantastic cast and great writing!",
      "date": "Apr 15, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "I'm a white female ex-grunger who graduated high school in 1996 so this literally feels exactly like it was made for me. Subtracting a star because I felt like in the 2nd to last episode the adult characters' behavior went from jaded and borderline to actually sociopathic, which felt out of character and all of a sudden made them super-unrelatable.",
      "date": "Apr 14, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is such a unique premise. I love the mystery of it all and cannot wait for them to dive into more of what happened.",
      "date": "Apr 13, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Nice series, the first season is very compelling, I'm looking forward to see the second season",
      "date": "Apr 9, 2023",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "This show is definitely crazy! That's what makes it so good! It has everything to make you cringe, scream, laugh, think and enjoy. It's absolutely not family friendly but I totally recommend.",
      "date": "Apr 8, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I tried but they introduced to too many characters in the first 2 episodes without giving people any reason to care. Watching the boring events of all their lives was tedious.",
      "date": "Apr 8, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Os pontos fortes da série são inegáveis. Os atores entregam performances impressionantes e trazem vida a personagens complexos e interessantes. A história envolvente cria uma atmosfera tensa que mantém os espectadores presos aos acontecimentos e mistérios que se desenrolam ao longo da temporada. No entanto, o desenvolvimento da trama pode parecer um pouco arrastado em alguns momentos, o que pode frustrar alguns espectadores que esperam um ritmo mais acelerado.\n\nEm suma, a primeira temporada do Yellowjackets é uma série com um potencial tremendo, repleta de atuações impressionantes e uma história envolvente. Apesar de alguns momentos de desenvolvimento enrolado, a série oferece uma jornada emocionante que deixa os espectadores ansiosos para descobrir o que acontecerá a seguir.",
      "date": "Apr 5, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Permanently altered something within me",
      "date": "Apr 1, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Binged it all in a day.  Wasn't planning on it but was too good",
      "date": "Apr 1, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Nope. Looks to be heading the same way as \"Lost\". Give this one a miss.",
      "date": "Mar 31, 2023",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "So much story, so little time. Annoying pace.",
      "date": "Mar 30, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "A lot of potential with a good plot but unfortunately s1 seems to snail along without any real twists.",
      "date": "Mar 29, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "While I found the plot and most of the preset day characters uninteresting, the mystery of the stranded Yellowjackets is enough to get me to come back for Season 2. Also, I could watch Misty be chaotic af all day. \n\nThe fact the showrunners felt the need to throw a sex or nude scene in every episode is seriously juvenile. If it serves the plot fine, but this just feels like they thought they'd lose the audience if they didnt show a boob every now and then.",
      "date": "Mar 28, 2023",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "Could have been good.  It is average.  The fantasy stuff in it is lame.  Be more interesting if they left that side out of it.",
      "date": "Mar 27, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great premise. Horrible delivery. The pilot got me really interested. I liked the actresses. But then it turned into typical mystery box televison except when we finally get some answers near the end of the season,  it was worse than I could have ever imagined.  Episode 9 was one of the worst episodes of television I have ever seen. It was so bad that I didn't even bother to watch episode 10. I did wind up reading what happens and I was glad I didn't bother.",
      "date": "Mar 26, 2023",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "Fooled me.  Avoided it for the longest time eventually trying the first episode and by the second was hooked. Normally hate time jumping but in this offerring it's both enjoyable and essential to the plot.  Wierd Lewis and wierder Ricci at their absolute best. Ricci especially now in her 40's, still cute as a button and still convincing as the character you can't afford to turn your back on.\nOK the plane taking off with a full tank of really old fuel and a dirt runway that just appeared too narrow for the wing span was wrong an abuse of poetic license.   However it exploded and we knew it would end badly anyway since we knew they weren't going to get rescued at that point. Sorry losing a good character but someone had to go. \nOn to season 2.",
      "date": "Mar 26, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "The best first season of a show I've seen in a long time.",
      "date": "Mar 25, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Such a great cast, and just such a great series.",
      "date": "Mar 25, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "fresh, appealing, youth, definitely an interesting tv product",
      "date": "Mar 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Without a doubt one of my favourite shows of 2020's. The story is very gripping and there is a sort of taboo-esque atmosphere which makes this mistery/drama very addictive. Even though the story is building for bigger moments than what we have seen, i feel like as viewers we are given enough new information and hints which can satisfy us without completely lifting the veil about what really happened, keeping the mistery alive.  The shots are so well made and full of little easter eggs that become apparent on further watches. The cast is brilliant and the casting of the younger/older versions is spot on.",
      "date": "Mar 23, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "OK, I'm halfway through season one - when is it going to get interesting?\nRight now I'm starting to get tired of the back and forth between the past and the present, the \"big mystery\" and everything in between.\n\nPS - Juliette Lewis looks like 40 miles of bad road - when did she get so old?",
      "date": "Mar 21, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "Essa série tem tudo que é preciso: boas atuações, personagens intrigantes, humor sádico... e também aquele gostinho de comeback. Fazia muito tempo que eu não via algo legal com a Juliette Lewis, por exemplo, mesmo que ela estivesse trabalhando constantemente. Não havia nada de destaque com ela atuando, digo. Ela que foi uma atriz que fez coisas muito bacanas no início de carreira, e que depois entrou em uma de escolher projetos meia-bocas em papeis secundários. O comeback dela, como protagonista e em uma série forte, é muito legal. Christina Ricci é fantástica no papel de uma sociopata, e Melanie Lynskey é uma excelente atriz, que trabalha sempre no alto padrão.",
      "date": "Mar 20, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "I tried to like this show but it's kinda bad first scene on s1 is some guy eating the girls V after that tried to watch more but just boring dk how this isn't cancelled yet",
      "date": "Mar 20, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Terrible show. It jumps around too much. I'm not a fan of shows thst do this. It's boring and just terrible.",
      "date": "Mar 19, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Storyline great! Amazing cast! Excellent acting by all",
      "date": "Mar 19, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This was a pleasant surprise ! The story line is interesting and it brings back the 90s which I love !",
      "date": "Mar 18, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "One of the best shows currently! The concept is so original and engaging, love the contrasts in them young/older. Some amazing cinematic shots, and obviously the suspense of it all is so thrilling. I found myself binging this very quickly, and feeling like finishing a chapter in a great thriller book, so curious on what will happen next.",
      "date": "Mar 11, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Love it. The characters are all fantastic and the storyline is gripping.",
      "date": "Feb 26, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Absolutely unreal! My only complaint is that I wanted more!!!!! Can't wait for season 2!",
      "date": "Feb 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show had so much potential. I love a good survival story, especially when it explores the dark side of what human beings often have to do in a desperate situation. Lord of the Flies is one of my favorite books of all time, and Yellowjackets has a Lord of the Flies feel to it...at times. \nWhen it is not being Lord of the Flies, with teenagers stranded in the wilderness quickly reaching their breaking points, the rest of the show feels like Desperate Housewives or Pretty Little Liars with an older cast. This is the part of the show I had zero interest in. \nAlso, there is absolutely no one in this show to root for, and at some point, we the audience are asked to \"pick sides\", so to speak. I wanted everyone to die. I would have much preferred if the show presented me with some characters I liked, and, through increasingly desperate circumstances, they start to slowly lose their humanity. Instead, we are presented with a bunch of teen dirtbags off the bat. \nToo bad. The critics talk about this show like it is the best thing they have seen in a while. I want to watch the season of Yellowjackets they saw, because it was not the show that me and my husband watched.",
      "date": "Feb 21, 2023",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "Yellowjackets is a show that defies easy categorization. It's certainly a mystery, but it's also a survival story with a dash of supernatural horror. These elements combine to lend Yellowjackets its engaging and palpably tense atmosphere. Of course this unsettling energy can be found in the premise of the show. A private plane carrying a regional champion girl's high school soccer team to nationals crashes in a remote wilderness near the Canadian border. What results is the story told in two distinct pieces: the first story is what occurs in the aftermath of the plane crash where the second story involves what became of the girls who made it through their shared traumatic experience now that they're in their mid forties. Casting young women in their late teens alongside women in their forties as the same characters is a bold move, but the casting is fantastic. Among such a large cast one might expect to find weaknesses, but everyone really holds their own. There are unsurprising standouts like leads Melanie Lynskey, Christina Ricci, and Tawny Cypress but the teenage actresses were even more impressive especially given their character's larger emotional range juxtaposed with the relative age of these actresses. We've seen Jasmin Savoy Brown dazzle before, but the Sophies Thatcher and Nélisse, as well as Samantha Hanratty were a pleasant surprise. The premise is so grand that it relies especially on the strength of the acting to pull it off believably, and there's little doubt that these actors are capable. Outside of the noteworthy acting, the writing and general pacing of Yellowjackets is commendable. Its story flow reminds one of the days of Lost, not just for the plane crash similarity but from the narrative decision to jump back and forth through time as well as the mysteries that abound in the aftermath of the crash. The mystery is where Yellowjackets leverages most of its tension. What did these women do all those years ago that has forced them to come together to conceal the ugly truth? They're friends, sure, but we never get the impression that the 40-something versions of these women really like each other. Rather they're a family forged from trauma for better, but mostly worse. Slowly it's revealed that someone is blackmailing the Yellowjackets, presumably for the unspeakable things they had to do to survive. But what were those things? Who suffered and why? These are questions that Yellowjackets gleefully and expertly teases us with from episode to episode. The finale spurs a little cause for concern as the show's need to extend into a second season threatens the carefully constructed and deeply disturbing atmosphere that has been crafted in season one. But assuming the showrunners have a good plan the finale's implications could prove quite engaging. Yellowjackets wears a lot of hats. It asks us to examine trauma, especially shared trauma, but it also asks us about the value of bonding during said trauma and how others react to known trauma. It asks us to question the limits of survival, belief, betrayal and so much more. But it never seems to get bogged down in any one aspect, instead choosing to cleverly fold these elements into an alluring mystery that captivates the viewer and unfolds near perfectly over its excellent ten episode run.",
      "date": "Feb 10, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Great acting but lots of plot holes and a relatively boring show. I don't understand the hype unless it's just praised due to the obvious casting",
      "date": "Feb 7, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Love this modern take on Lord of the Flies. Funny, heartbreaking, thrilling, clever and the acting and production values are commendable. Looking forward to the second season.",
      "date": "Feb 1, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "one of the very best shows I've watched in years.",
      "date": "Jan 20, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I don't get all of the critical hype. It was entertaining enough to keep me coming back till the end, but it never really took off for me. I think it had potential, but it simply fell short in too many places. There were just too many things I didn't believe, too many loose ends. For example: the opening scene was an interesting enough hook to get things going, yet it never came back around to let us in on what we had seen, why it had happened, and who it had happened to. The finale, which everything was building toward, was ultimately unremarkable. Christina Ricci was fantastic.",
      "date": "Jan 15, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "Lost meets Dark. The cast and acting is great. It is difficult to discuss this series without spoiling any part of the mystery. Overall, it was pretty good and I will watch the second season, but ultimately the 'big event' was a bit underwhelming.",
      "date": "Jan 8, 2023",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "Arguably the best show of the year! The characters are fully realized and brilliantly portrayed. The writers navigate the time difference really well so neither setting feels like a waiting room for the other. It is suspensful and intriguing without relying on cheap thrills -- every action, however unexpected, makes sense for the character who did it. HIGHLY RECCOMEND IT.",
      "date": "Jan 6, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I'm a huge tv snob, and this show is amazing. I love the freshness of the story, not just another show being rehashed with different names. All of the actors are spot on in their roles. You won't regret",
      "date": "Jan 3, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "One of the best shows I watched in 2022, and seriously under rated in the mass media. \n\nYellowjackets gives you everything you need to be entertained in one show. It has suspense, relationship drama, comedy, darkness, friendships, nostalgia, twists and so much more. \n\nThe casting, acting and writing are all excellent. You're taken on a journey with the characters that keeps you guessing at every turn without being frustrated. Whilst every character has clear human flaws they manage to stay likeable and you root for them even in the most surprising of situations. \n\n5/5, highly recommend!",
      "date": "Jan 2, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It's great, it really is. It's awfully creepy, disturbing and offers two interesting timelines between the present days with deeply broken characters followed by their past, and the 90's which is a survival story. You can have your favorite timelines, but both of them are pretty good on their own and as a complement to each other.\nIt's sometimes over the top, but it is part of how the show can be so hooking. The twists keep coming, and we are eager to know exactly what happened. The first season ends with more questions than answer, but it sure works to make me wait to the next season!",
      "date": "Dec 27, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "For all the Fantastic reviews. I had to give this show a watch. Having only two episodes left i feel like it is going nowhere. Alot of back and forth. Really silly at times. Some things don't make much sense on why the characters act the way they do. Hope it all comes together on the last two episodes if not then sadly I'll be confused why it got season 2.",
      "date": "Dec 20, 2022",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is my favourite show since Lost. I cannot wait until the next series. Great characters set against a backdrop of genuine uncertainty and mystery. You just can't predict what's going to happen next! Brilliant.",
      "date": "Dec 10, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Good show, the grown ups/ present time bits a bit to low paced and a lot less interesting than the other story line. But its still pretty good.",
      "date": "Nov 13, 2022",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "You wanna save the corn nuts?!",
      "date": "Oct 25, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Addictive, incredible cast.",
      "date": "Oct 13, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Phenomenal CAST AND CREW ONCE AGAIN THESE YOUNG ACTORS BECOMING THEIR CHARACTERS.  COMPLETED BINGE ONE DAY!! MUST WATCH. THE THRILL AND ACTION AND DARKNESS OF THE SHOW IS MOUTH OPENING WITH THE TWIST AND TURNS....",
      "date": "Oct 5, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I really did like the show...but 100% critic reviews, thats absurd.     It discredits this entire platform.    When i see a big discrepency between audience and critics , I think of 3 possible reasons.    They are idiots , they are paid off , or both.",
      "date": "Oct 5, 2022",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "Def a must watch! You can't look away or miss a scene, it's that good! Yellowjackets has everything you need in a good show, great cast, mystery, drama, suspense and my absolute fave horror/gore! Set in a survivalist/coming of age story with this girls ⚽️ team the time jumps are so well weaved that the story doesn't get lost in the back & forth. We do know that in reality there wlda been more than just 2 wlw tho ;)",
      "date": "Sep 18, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Show is amazing! Perfectly cast, and the story line always has me clicking the next episode even when I know I have other things I need to get done! xD",
      "date": "Sep 15, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Christina Ricci's Misty was by and far the highlight of this first season.",
      "date": "Sep 10, 2022",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "It was only ok. It did pick up a little at the end.",
      "date": "Sep 3, 2022",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "Half of the show is good, the other half meandering and boring.",
      "date": "Sep 2, 2022",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "Creepy creepy very good movie. Some very disturbing parts of the story. Christina Ricci was outstanding in this role and was the stand out character in the movie for me but really everybody was good.",
      "date": "Sep 1, 2022",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "This was one of the only shows I can remember since early Game of Thrones that I was on edge waiting to see what happens next at the end of every episode. It is great, the only problem is that the culty weird stuff was distracting from the actual story. I'm worried that the second season is going to double down on those storylines that weren't as strong, but I could be wrong.",
      "date": "Sep 1, 2022",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "0 sense rubbish, good to scare teenage girls, but that's all. The story could be good, but it's played very poorly, the characters are rubbish, the acting is poor along with the scripts. I've regret ever pressing the play button.",
      "date": "Aug 31, 2022",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "What a great series, I really enjoy it. RECOMMEND IT!",
      "date": "Aug 26, 2022",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Survival story of a group of athletes who remain at the mercy of nature for more than a year. Two timelines told to perfection, full of mystery and a rare, but addictive suspense. The closure is shiny, spun for a new temp.",
      "date": "Aug 26, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show is a pleasantly surprising great tv show.",
      "date": "Aug 24, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Its hard to Rate this season since the series as a whole is supposed to be the telling of LORD of the FLIES. \nAnd The pilot (that won the HCA award for directing)\nWhich is very dynamic Is not an example for the slow pacing for the rest of the season \n+ episode 3 being a complete snooz!\n——\nAll that being said -after i finished binging it Overall its a good tv show.\nMainly because of one thing\nThey take the time to tell the story so it will make sense to you which in a way is the complete opposite of the last season of games of thrones.",
      "date": "Aug 17, 2022",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "One of my favourite shows in 2021. Gripping and entertaining in equal measures, with one of the best casts I've seen in years.",
      "date": "Aug 15, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I wasn't sure at first but I gotta say, I was quickly turned obsessed. I love the cast, the story grabs you. Eagerly been awaiting S2.",
      "date": "Aug 3, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Ugh... Forced. Not real. Checking boxes for no reason. Not watchable for my taste...",
      "date": "Jul 30, 2022",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Started off interesting. Devolved into a confusing and contrived mess.",
      "date": "Jul 27, 2022",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Bought this on Blu-ray blindly based on all the hype. 100% is a better rating than even The WIre or Breaking Bad have on RT. 2 episodes in and I have to demote it to background viewing.  Nothing interesting seems to be happening.  Plus this show has several irritating hallmarks of bad TV that you have to kind of just ignore to even get started with it.  Firstly, it has the bane of streaming TV, letterboxing.  This is not a movie, it's a TV show that will only ever be seen on 16x9 TVs.  So it's a big cheat to cut off the top and bottom of the picture.  I think they do it to reduce the file size and save a few pennies on the streaming.  But the money they save doesn't justify the uglification of the image for the viewer.  There's certainly no aesthetic value to widening the horizontal at the expense of the vertical in any of these cropped shows.  Secondly, 2 or 3 times per episode there's some annoying and impertinent song that intrudes over the soundtrack for an unnecessary montage.  You have to mute and turn on the subtitles until the extraneous song ends and the episode resumes normal action.  So if you can get past these irritants, it's still possible to have a good show, but where is it? \nAbout the only thing intriguing so far is Juliette Lewis's character, but only because she's just echoing some of her better work in films like Natural Born Killers. I enjoyed LOST but a show like that is only good while it's running, there's no way to end it satisfactorily.  Now we have dozens of shows like that and it looks like this one is another.  We just don't need another show where the mystery gets so deep it can never be resolved. When I see a show like this scoring 100% on Rotten Tomatoes, it makes me think the new golden age of television has ended and we're now entering the new dark ages of television.",
      "date": "Jul 24, 2022",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Such an unexpected hit!!!! Everything about this show is a masterpiece. The pacing is amazing as it doesn't feel too fast or too slow. The mysteries are intriguing enough to keep you watching and the genre-bending is done flawlessly. The creepy and horror undertones are also just enough to give you goosebumps but increase as the show progresses. And finally the talented ensemble. The casting department struck gold with this show. Every single actor brings something amazing to the table which elevates the show to the next level.",
      "date": "Jul 5, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Good cast and story idea but ruined by poor writing that is dragging it kicking and screaming into a second series for no good reason. I understand that people need a salary but already this is 8 episodes too long!!!",
      "date": "Jun 6, 2022",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Mixing teenage drama with psychological thriller and an obscure plot makes this show a must-watch!",
      "date": "May 30, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "A good idea ruined by dreadful writing and direction. Where is the writing talent? It seems to have found a home in Britain and Europe.",
      "date": "May 25, 2022",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Such a dark poignant series. Could not stop thinking about it after watching. So many varied characters and depth. Brilliant writing made phenomenal by the acting. Such a great female driven show.",
      "date": "May 10, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "LOVE this show. I want more.",
      "date": "May 10, 2022",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "A surprisingly fantastic show - it's horror trappings hide an intriguing mystery, elements of the supernatural that are well portrayed, and an interesting sociological study along with the inclusion of compelling queer narratives (and LGBTQ+ actors).",
      "date": "May 9, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Even better than the buzzzzz.....",
      "date": "Apr 27, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Enjoyed almost every moment of it. Great characters and writing. Loved Christina Ricci's performance.",
      "date": "Apr 11, 2022",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Loved it! Great characters and story developed at perfect pace - great suspense and not a let down!",
      "date": "Apr 8, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The storyline is incredibly unique and can be attractive to really anyone, other than children. There are all these subtle moments that are foreshadowing something big or is a testament to the trauma the characters will endure through this harrowing experience and beyond. You really want to know what is really happening, what actually happened and what will happen. And it is really a cinematic education on different types of disturbing behavior and the human psyche. It is a psychological thriller at its core and engrossing. I do wish, actually, the 90's attire was even more authentic as the hair styles, shoe choices, and clothing don't match the period at all, but it is a small detail.",
      "date": "Apr 8, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It's so bad, disjointed, bad acting.. the idea was so good to :(",
      "date": "Apr 6, 2022",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Ese 100% esta mas que merecido, serie increible, me gusta como van llevando la trama y desarrollando a los personajes mostrando en simultaneo su presente y su pasado y las cosas turbias que en este ocurrieron durante el accidente que las marcaron.",
      "date": "Mar 30, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I'm obsessed with this show! Can't wait for season 2!",
      "date": "Mar 29, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Absolutely a must see for all mystery drama fans and those who liked LOST :) present, flashbacks, dots slowly connecting, mysterious element.. you've go to love it, Showtime knows how to amuse us :)",
      "date": "Mar 19, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Wasn't sure at first but really loved this and looking forward to S2. Great casting and storyline.",
      "date": "Mar 13, 2022",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Very fun show to watch, have to suspend some belief, but its always very interesting and fun to watch. Can't wait for the second season, don't ruin it.",
      "date": "Mar 8, 2022",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "This show should have leaned into its campy aspects wayyyy sooner. Episodes 1-6 are honestly pretty boring because while there are some over the top scenes the show also tries to stay somewhat serious. The problem with that is that you still ask valid questions like \"why wouldnt anybody find them?\", \"how exactly are some severe wounds just healing?\", \"a near endless supply of bullets, really?\", \"why did they not try to create signals that could be seen from the sky?\"... This show only works if you throw logic out the window and embrace the camp. Thats where it shines. \n\nWhile the actresses who play the adult versions of the characters are obviously doing an amazing job their screentime could have been cut in half. Since the show decides to not answer a whole lot of question at the end you really feel those relationship drama moments - and not in a good way. \n\nHaving different opinions about shows is normal but I am honestly concerned about the 100% rating. I could see this going in the right direction in season 2 but celebrating season 1 like some sort of perfect show? Meh.",
      "date": "Mar 7, 2022",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "Finally a new binge worthy, theory generating thriller!",
      "date": "Mar 6, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The four couples rock",
      "date": "Mar 2, 2022",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Annoying, nothing happens. The first episode makes false promises that are not delivered.",
      "date": "Feb 25, 2022",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Just not on-board with this. Between the incessant needle drops and the boring adult drama this show becomes a slog.",
      "date": "Feb 18, 2022",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "While it starts out slow (barring the obviously tumultuous and foreboding first episode), Yellowjackets dedicates plenty of time to building up its characters and isn't heavy-handed with gruesome deaths. Instead, it steadily edges further and further into psychological horror, turning what feels at first like a teen drama into a genuinely gripping battle for survival. The parallels between past and present plotlines tie together plot points but leave enough room for guesswork on the audience's part, and while the first season leaves a lot of unanswered questions, every episode had me eager to see more.\n\nYellowjackets is at its strongest in moments of suspense, constantly leaving you uncertain as to who its heroes and villains really are. Christina Ricci puts in a particularly brilliant turn as Misty Quigley, cheerful yet creepy hanger-on to the core cast of girls. The show is excellently diverse, with LGBTQ and PoC characters galore; most of whom are given the screentime to discuss their minority status without being reduced to it.\n\nThe cinematography is generally solid, besides one or two slightly wonky uses of special effects. Horror imagery is used sparingly, but to great effect. Major props go to the sound team for the wonderfully eerie audio effects and great use of licensed music. Throwaway dialogue, visual framing, and background props are all used to foreshadow various events, both overtly and more subtly. It's the kind of show that liberally encourages fan theories, treading carefully with character deaths and shock reveals rather than handing them out en masse a la Game of Thrones.\n\nAll in all, I'm furious at the idea of waiting another year for another season of Yellowjackets. Its young cast (for the 1996 section of the ongoing plot) are believable if not always likable, while their present-day counterparts are well-cast and allow room for some pleasingly dark humour reminiscent of NBC's Good Girls. It's been some time since a show grabbed me as much as this did, and I can't wait for more.",
      "date": "Feb 15, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Yellowjackets can't find the right tone between camp dramedy and mystery thriller, failing to engage the viewers into its secrets and incredibly slow storyline.",
      "date": "Feb 14, 2022",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is not exactly an easy show to review which might be part of the problem. Trying to compare it to other shows would be a mistake. It is alot like \"Lord of The Flies\" and \"Alive\" but with teenage girls. However that is just a simple explanation. Basically a successful girls soccer team crash lands in the remote wilderness and are forced to learn how to survive. 25 years later the trauma the survivors face is still haunting them. Part survival epic, part psychological horror and part coming-of-age drama. Its about not dealing with your past and what happens years later when it comes back to haunt you.",
      "date": "Feb 12, 2022",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Granted I only watched 1 episode but geez, I can't believe anyone can get past that. Dialog is corny - \"Yellowjackets, on me!\", acting is meh, casting is meh. I can see my teenage daughter liking it but not anyone over the age of 18.",
      "date": "Feb 11, 2022",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "The tone is perfect. The ability to balance so many characters and have it be interesting is stunning. Also, it's great to see these amazing female characters who actually feel like people.",
      "date": "Feb 9, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great show, can't wait for season 2!  Juliette Lewis and Christina Ricci steal every scene they are in",
      "date": "Feb 8, 2022",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "I high key hated this show starting with ep 9. \n\nMy verdict:\nRetooled young adult source material (past) meets winking-while-dismembering-loved-ones (present) desperate housewives in an ultimately soulless exercise in connecting plot points. \n\n Juliette Lewis is mesmerising and a major actor of the generation, Melanie Lyskie's performance starts off as refreshingly intoxicating but after her character  kills Adam and there's no reaction or delayed impact, that NUKED the entire story for me. Up until that moment there still was this credit of trust that the flippancy with which the horrifying events in the past were treated will come to be balanced by the impact in the present. But their collective behaviour in the aftermath of Shauna stabbing the person she had just claimed she was in love with, that \ntrivialised the trauma and turned the characters into people who just go about life killing and dismembering and you start wondering why they haven't been doing just that these last 25 years, really, when it's always been so readily available and required so little provocation.  This is where the show begins to feel like a clever-ish farce, a slight upgrade from the 2004 desperate housewives, with a touch of Ratched.\n\nI also read that Christina Ricci refused to play 'more relatable' and it seems to have affected the others, too,  as toward the end of the show they seem to be competing for the most sociopathic performance of the year. They all turn morose, all speaking in the same dark ironic tone so ill-suited to their age. \n\nMany have compared this to LOST and I'm not a fan because it's hoaky but LOST was also earnest and had lots of heart. This is a world that knows no heart and no colours other than dissociated and mean.",
      "date": "Feb 8, 2022",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "I'm dumbfounded by all the rave critical reviews. There are so many plot holes that it's almost impossible to suspend disbelief. Like, you're not even going to drop a slight hint as to why there was no rescue attempt? Or why any attempt was unsuccessful? Even though there is both a cabin and a working airplane within walking distance of the crash site? Makes no sense. Also, the dialog is pretty groan worthy pretty often. Feels like it was written not just for high schoolers, but by high schoolers.",
      "date": "Feb 8, 2022",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "Very watchable and strong performances all around.  At times it feels like too many moving parts (Lord of Flies + Mystery / Crime + Drama + Flashbacks + Comedy).   But overall enjoyable.",
      "date": "Feb 7, 2022",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Binged season 1 this week. Have to admit there was so much going on that I found no plot anchor in the non-linear mishmash of 1996 vs the present. Is this a nightmarish survival tale? A crime story? A supernatural creepfest? An essay on friendship, shared trauma and the meaning of life? As it turns out, the answer is all of the above and then some. The sum of the first seven episodes did not strike me as greater than the myriad moving parts but the sheer style and stellar performances from the ensemble, youthful and adult, kept me watching. The final three episodes were the payoff and why I will be a Yellowjacket diehard for the remainder of its run. Brilliant storytelling. Brilliant acting. The dark forces shuffling about in the shadows of our mundane, everyday lives and within us ourselves are the real stars of this show. Season 2 should be a great ride. Can't wait.",
      "date": "Feb 7, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I had high hopes for this show, but found it slow and far-fetched. I mainly watched to help satisfy a very compelling beginning, only to never have it resolved! Very disappointing.",
      "date": "Feb 6, 2022",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "Juliette Lewis and Cristina Ricci, what a perfect combination! Cristina Ricci is at her best, hilarious!!! Absolutely loved it. Can't wait for season 2.",
      "date": "Feb 5, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Obsessed!! Melanie Lynskey is my spirit animal but they're all great, great, great.",
      "date": "Feb 4, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It has (brief) moments of being legitimately good and you wonder if a better cast and writing (the dialog is particularly weak) could have yielded something great.  Overall it's a poor retelling of Lord Of The Flies meets Mean Girls that simply falls flat. The timeline after the crash progresses at a varying pace without any mention of how long they've been stranded (use a journal entry, duh). Some episodes cover a few hours while others appear to be months. As other users have mentioned, parts of the plot are too absurd to overlook and spoil the entire narrative like a long abandoned vehicle working, limitless ammo (written in the script) and miraculous wound healing among many other problems.\n\nThere are some good performances from exactly who you'd expect, Ricci and Lynskey, but the rest of the cast wasn't ready for a production of this magnitude. I'm not sure a killer cast could have saved it though-- the writing is absolutely atrocious.\n\nThe critics are full of it on this one. 100% really REALLY? No wonder no one believes their lies anymore. There are seasons of television classics like The Sopranos, The Wire and The Office that score 85% or lower.\n\ntl;dr\nYellowjackets is at best 33/100 and deserves a watch only after you've been scrolling for 10 mins asking yourself \"what else is there?\"",
      "date": "Feb 4, 2022",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "Entertaining to the point that the absurd aspects can be overlooked.",
      "date": "Jan 31, 2022",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Annoying high school girls...",
      "date": "Jan 31, 2022",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "It's good but a little weird. It cliff hangs you on the ending and too many unanswered questions.",
      "date": "Jan 31, 2022",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Those that say nothing happens can't have watched the series. One of the best and most intricate shows ever made. Pristine acting, I mean Juliette Lewis and Cristina Ricci are actual movie stars. The soundtrack is also amazing, I just can't wait till season 2! For once the critics are right!",
      "date": "Jan 30, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "After such high critic reviews, I was somewhat disappointed. It is very slow in parts. I did finish. Many unanswered questions, which seems forced purposely by the writers to assure second season interest. It was just ok.",
      "date": "Jan 30, 2022",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "It's definitely not all it's cracked up to be.  What really happens? Almost nothing.  Go ahead and watch if you want, but I warned you",
      "date": "Jan 30, 2022",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Sisterhood of the Traveling Pants, meets Lord of the Flies with a heavy dose of X-Files. There's something for everyone in this series as long as you're not too squeamish. Don't be afraid to watch  season one more than once so you have a fighting chance to to figure whats coming at us in season two.",
      "date": "Jan 30, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "NO SPOILER REVIEW\n\nImagine a mix of Lost and Big Little Lies, if you like that idea, Yellowjackets is for you. \n\nThe show is really well paced and keeps you interested - the acting is fantastic across the board especially from the \"main\" four female adult leads. \n\nThe show looks and sounds fantastic. \n\nMy only criticism is that the show raises more questions than it answers at such a ratio that it makes me wonder if the creators know where they are going - we all found out with Lost that the hype and the build up ended up being too much for the creators to keep up with and we end up feeling let down. This show could run and run, and I worry that we will have a repeat of Lost in that sense.",
      "date": "Jan 29, 2022",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "It was like 13 reasons why met Lost in the forest of the Blair witch project!\n\nIn short,\nAwesome casting and acting, amazing music, coming-out of age drama with a thriller-demonic-cult twist! Awesome!",
      "date": "Jan 28, 2022",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "What a waste of 10 hours of your life watching something that promises so much and delivers so little, just another very average murder story..................................Don't bother, I certainly hope they won't waste money on series two.",
      "date": "Jan 28, 2022",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "Slow start. Then started unfolding like a stephen king novel but it loses steam quickly. Ridiculous dialogue,  characters not consistent, trying too hard to be a mystery with no one to root for or care about. \nTerrible ending. Will not be back for Season2. Way over hyped",
      "date": "Jan 28, 2022",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "My only issue is how much it's going to be dragged out but otherwise very engaging - very good!",
      "date": "Jan 28, 2022",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "By far the most interesting new show I have watched. The acting is amazing. The writing is good but I am interested to see where it goes with future seasons. It does leave a lot open but there is absolutely some closure as well.",
      "date": "Jan 27, 2022",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Excellent. Dark, funny and extremely well acted.",
      "date": "Jan 27, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It is the show of the moment, it combines drama and suspense, it is raw and it keeps you on the edge of your seat.",
      "date": "Jan 26, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I'm getting some Lost vibes, but I'm sure I'm wrong. Other than that, amazing show.",
      "date": "Jan 26, 2022",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Started great and got a bit off track.  I don't think Hollywood does fantasy stuff well and should have kept it to more real life.  Now it is going down the fantastical route and could ruin the show.",
      "date": "Jan 25, 2022",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "The most intriguing original series of the season.",
      "date": "Jan 24, 2022",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Terrific television series. I watched the trailer and it didn't appeal. However, after reading all the reviews I gave it a go and it's absolutely brilliant (6 episodes in),",
      "date": "Jan 24, 2022",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Without knowing anything about this show, I had fairly low expectations. Little did I know - I would soon be hooked into the plot, the characters, and desperately waiting for the new episodes!",
      "date": "Jan 24, 2022",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "The show was okay. I was a little disappointed as I had heard very good reviews, but honestly the first episodes reveal all there is to know. I kept on waiting to be more in shock. I really felt that they wanted to do another season so they kept a lot of secrets for whats coming. Most of the mystery elements that were raised were pushed to season 2. I really hate it when shows do that. In my opinion it demonstrates that the plot is not strong enough, OR that the creators want to do more content in order to keep on making money. Would work as a miniseries. Its a shame because I felt like it had potential.",
      "date": "Jan 24, 2022",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "I absolutely live for shows/movies that seem to suddenly become popular out of nowhere and that completely take you by surprise. Those that make you think, \"What am I even watching and why can't I stop?\". Yellowjackets totally fits the bill! I was immediately invested, loved it and can't wait for another season.",
      "date": "Jan 23, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Anticlimactic. Drawn out so they can produce a second season.",
      "date": "Jan 22, 2022",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I was very hesitant because I thought it wasn't for me. Turns out it's the most interesting show I've ever seen.",
      "date": "Jan 21, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show never gets me on the edge of the chair. It is full with anti-climaxes.",
      "date": "Jan 21, 2022",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "I will say it i am more of a action crime viewer in my tastes . So kinda impatient with dramas . The show has a interesting storyline that at times bored me. It's a good a show but it's not a great show . The shoes  i really enjoy  i watch pretty rapidly.  This one didn't have that appeal to me, maybe it was to many characters and flashing back and forth from high school to modern day. I think i might of enjoyed it more if they ran the first part of what happened with the yelbow jackets and than went to modern day on how it effected them still , This just feels cluttered to me.  I don't think I would watch a second season.  It has a good cast.  Production values are great. Story cluttered and slow at times . Flash backs are at least half the show so it sorta limited my enjoyment.  It is needed for some back story but I likely would of rather seen season 1 be the back story and season 2 modern day . This just felt like a grind to me too many times. Guess I'm out of the loop here because it appears many really enjoyed this in a big way, I just wasn't in that camp.",
      "date": "Jan 20, 2022",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "A must see. The back and forth between the 90s and present time is so well done. It keeps you on your toes with its intense story and top tier acting.",
      "date": "Jan 20, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Started fine, but as soon as I realized how ridiculous it was that an entire girl's soccer team crashed somewhere in North America and nobody seems to be looking for them or the plane? Not likely. Editing between timelines was confusing at times and diminished the flow of the narrative quite often. The big reveal, often hinted at, as to the specific traumatic event that happened while they were missing, was again denied in the last episode. The attempt  to muster up intrigue and interest in a season 2 was frustrating after watching 10 episodes and we're still in the dark. I've had enough and won't tune in anymore. All in all, a silly and empty headed series.",
      "date": "Jan 20, 2022",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "The first two episodes of this series showed promise, and then it turned into a WB project that would've been targeted to tweens if it weren't for added gore and older character storyline. The glowing critical reviews for this show remind me of when the reviewers for Cyberpunk 2077 were heaping on the praise and then it became pretty obvious that the critics didn't digest the whole thing before publishing. \n\nSome of Yellowjacket's critics are talking about how this show is great at putting a spotlight on trauma. Meanwhile I watched it wondering why most of the characters aren't believable in their responses to trauma. They feel one dimensional. Big conversations are forced and have no nuance.  I feel bad for some of the actors that have to act out the poor writing (overreact to mundane things, and then underreact to things that would be a big deal). \n\nThat said, I enjoyed the scenes where either the young or older Misty character interacts with anyone. Coach was cool, and so was Natalie. I enjoyed the \"reporter.\" \n\nBut all-in-all, I was pretty disappointed after reading the hype around a spooky 90s girl soccer team \"Alive\" meets \"Lord of the Flies\". \n\nWith better dialogue and believable human reactions to the deaths, trauma, survival, etc. this show could've been next level. I keep erasing spoilers that were unintentionally comedic so I'm going to stop. Yikes.",
      "date": "Jan 20, 2022",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Yellowjackets are social hunters. Unpredictable carnivores that will resort to cannibalism to survive. They're also teenagers. I really love the premise of Yellowjackets. A high school girls soccer team is stranded for a year and a half after their plane crashes. As adults, they try to distance themselves from a truth that could endanger their families, careers and reputations. Seemingly willing to do anything to prevent the knowledge  of what really happened in the wilderness from ever reaching the public.",
      "date": "Jan 20, 2022",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "This is the latest series everyone is expected to go ga-ga over and it's 100% mediocre. Which is not to say it's bad because it's not. It's simply not very good. Or compelling. Or interesting. \nChristia Ricci steals the show in this… no contest. Juliette Lewis delivers a solid performance and proves she's never not been relevant as an actress. I'm fact, all the stars turn in food performances. It's the writing and plot that don't go anywhere. Even at the end of the entire series, the audience is left wondering if anything of any real interest happened while they were stranded. So far (and these aren't really spoilers because there is literally nothing to spoil in this entire season) we know they drank mushroom tea and had some innocent high school sex and waved around a knife. Ooohhh! Thrilling!! And then a girl froze to death. Oh, my! What action! What a harrowing development! Contain yourselves while you wait 10 full hours/episodes to find out that literally nothing of interest happened when they were stranded. \nAside from that, there are some passing moments of interest but again,  nothing compelling and nothing that makes you want to see another season. But again! We're a culture in decline, we're a world locked down and desperate for something…anything…and I guess our standards have gotten so low that we don't even care anymore If what we surround ourselves with is good or bad or even mediocre. We just watch series like this because we have nothing better to do and then we go on social media and pretend that we can't believe how amazing this is because all of our friends think it's cool. \nThe theme song and intro are honestly one of the better parts of each episode. \nI'm so uncool for acknowledging how tragically mediocre this series is and I'm fine with that. But Christina Ricci and Juliette made even the mediocrity feel like it was bearable. \nHollywood: please give these incredibly talented women better roles in better projects. If they can carry this series (and they do) they can carry anything.",
      "date": "Jan 19, 2022",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "Didn't realize it wasn't a limited series until after I finished. Too many questions left unanswered. I enjoyed it, but the payoff wasn't there. Hopefully season 2 will fill in the blanks.",
      "date": "Jan 18, 2022",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "My biggest problem with the series is that a planeload of high school teenagers crashes & no one is looking for them?",
      "date": "Jan 18, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It's been years since a show drew me in this much. Great mystery box show that doesn't try to trick or shock the audience too much. Some reveals seem anti-climactic or unsatisfactory at first, but they really just serve the story and the characters much better, and will only help the show's longevity. Lots of great 90s nostalgia thrown in for good vibes as well. Super fun, well-acted, well-written, and stylishly cool.",
      "date": "Jan 18, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I had a great time with this even though it's brutal",
      "date": "Jan 18, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I'll make this short. Where are the people who know the plane crashed looking for them non stop. This seems implausible. A whole plane with kids and their families and authorities are no where to be seen for apparently 19 months? A mention of an exhaustive search seems in order. Why aren't these seemlngly smart young people trying to be seen through whatever means necessary? Flares, fires, gunshots in the air? No planes fly by, no helicopters no search parties by professionals. No mention of anything. Plus a lake full of fish and they are starving. Really?",
      "date": "Jan 18, 2022",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Omg so good the characters are so rich and complex.",
      "date": "Jan 18, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It had a strong first couple of episodes and a strong promise of what was to come. Unfortunately the show ended up getting more and more mellow dramatic and traded its thrilling storytelling for something akin to dawsons creek.",
      "date": "Jan 18, 2022",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "a bear lays down and let's a woman stab it. All you need to know",
      "date": "Jan 18, 2022",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Great concept, great execution. Had me on the edge of my seat each week.",
      "date": "Jan 18, 2022",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "This show has everything — scares, thrills, great acting, great mysteries, occult musings. I love it! Can't wait for season 2.",
      "date": "Jan 17, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is the show I've been waiting for! Many compare it to the wilds but unlike the wilds this won't throw away the girls after a season to focus on boys.",
      "date": "Jan 17, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Unpredictable and intriguing! One of the most unique and engrossing shows I've watched in ages. Also features an amazing soundtrack and great characters. Absolutely worth watching!",
      "date": "Jan 17, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show is the most hardcore original  show we've had in years!",
      "date": "Jan 17, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I'm at episode 7 and so far I love this show. As a late 90s kid the soundtrack and casting is brilliant. It's very much a memory lane experience for me. The story line is nice, the pace could be a bit faster. Over all it's very entertaining with a lot of drama going on between the characters.",
      "date": "Jan 17, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Overall I really liked this first season. But a) I really hope they don't drag this over too many seasons and b) they rein it in with the Lost similarities. And I'm not talking about the influences both shows clearly share (e. g. Lord of the Flies etc.), but throughout the season there are several plot points basically directly taken from Lost. Let's file this under \"hommage\" for now, but it is a bit much already. Anyway, nice spin on the stranded somewhere/survival genre. Eager to see where they go from here.",
      "date": "Jan 17, 2022",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "So rotten! What mystery? It's pretty much obvious from D1. The story is really terrible, and it forces way too many drama and random paranormal stuff down your throat",
      "date": "Jan 17, 2022",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Suspenseful, plot twisting, enjoyable!",
      "date": "Jan 16, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Arguably the most talked about new show of 2021, Yellowjackets quickly presented itself as an intriguing genre-mesh with leagues to deliver in both style and ideas! While hardly the first show to feature two timelines in the narrative (one set in the 90's focusing on a group of high schoolers stranded after a plane crash, and the other during the present and centered on the survivors), the show still feels more organic in its storytelling than most, even when it gets more outlandish. Horror elements are scattered throughout the 10 episodes, but it's hard to shrug them off as not being thematically concise, as they gel with the show's themes regarding childhood trauma as well as the tense but tongue-in-cheek tone. Yellowjackets is unapologetically a show that also is to try to toy with nostalgia from a certain age set, with its alt-rock soundtrack communicating on the 90's attitude, something perfectly captured in the show's opening credits with its eerie use of VHS-quality footage and musicians Craig Wedren and Anna Waronker's equally invigorating and harrowing song 'No Return'. The casting also reflects this, with 90's it girls like Juliette Lewis and Christina Ricci, with the latter giving a brilliant inverse of her typecast, playing a character that's affable in her quirkiness but also potentially evil and/or insane! Pulpy, tense, fun, and with consistently high quality in terms of writing and filmmaking,  Yellowjackets might very well be your next tv obsession, and the unexpected finale really opens up doors for next season!",
      "date": "Jan 16, 2022",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "I haven't loved a show this much in years\nI absolutely adore the cast, its just perfect\nI wouldn't change a thing",
      "date": "Jan 16, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "One of my favorite new shows! It's like LOST meets Lord of the Flies, I can't get enough!",
      "date": "Jan 16, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Deliciously builds up to an incredibly great climax in the finale. The performances are amazing, it's hilarious, chilling, fucked up, twisted, addicting, and I just want season 2 yesterday.",
      "date": "Jan 16, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Love love love it! Cannot wait for season 2 and if Christina Ricci doesn't win an award……. Well I'll be pretty annoyed!!!!",
      "date": "Jan 16, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Yes please. More. This is freaking amazing and the actresses all have fantastic chemistry.\n\nI hear 5 seasons is the intended run?\n\nI'm in.",
      "date": "Jan 16, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Disturbingly wonderful.  20 years out of high school in the 90's and I'm still triggered by some of the nostalgia and even semi-warped social standards of even a handful of decades ago.   Even with the the big name female actresses on board I came away most impressed with the teenage(likely 20 something's) and \"comparatively\" less known New Zealander Melanie Lynskey who are the most impressive roles.  Mental illness, everyday domestic dissonances, substance use, and sexual situations are all mixed in doses and on levels that never seem over done or abused gratuitously for showtime/HBO viewership pandering.",
      "date": "Jan 15, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Excellent show and well worth the watch. A rare 5 stars from me.",
      "date": "Jan 15, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "A macabre survival thriller with a superbly chosen 90's soundtrack (with a kick-ass intro song), subtle hints of paranormal elements, excellent flashback-to-present directing and surreal visuals. Plus(!), Juliette Lewis, Christina Ricci, Melanie Lynskey, and Tawny Cypress head the brilliantly acted female cast (the 20's somethings playing teens are great too)...what more do you need???",
      "date": "Jan 15, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Please take note of all the toxic idiotic men leaving negative reviews on a seriously incredibly irresistible show. The mystery from the first scene is enough to leave you asking for more. This is beyond a female Lord of the Flies, it invites you to the survivors lives 25 years later. Who survived? Who got eaten? What happened when they got home? EVERYTHING is well thought out, the cast and writing are phenomenal. Please let this be your sign to watch this show.",
      "date": "Jan 15, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Loving this show and can't wait for this Sunday's finale. So many questions, so much mystery, and a great soundtrack. The performances by both the teens and adults in this show are amazing. I've always been a Christina Ricci fan and I think this is some of her best work. If you're not watching this show you should be.",
      "date": "Jan 13, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I love this show! Probably the most fun I had since GOT season 1-5 theorizing what's gonna happen next. The actors are all stellar especially Christina Ricci, who is clearly having a blast with her role. Also shout out to the young Nat actress, she really nailed Juliet Lewis's mannerisms and how she talks. But a warning for folks who are sensitive to gore. Horror fans will definitely dig.",
      "date": "Jan 13, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I have no idea what other show these reviewers watched but I highly recommend you avoid this one.\nThe trailer shows such promise. A large group of kids crash land on a remote island and fight to survive, what's not to love? Unfortunately, it's as if they tried to create a modern version of Lord of The Flies, but with no story worth following. \nToo many flashbacks to young highschool days and highscool kiddy drama ruined it for me. All the typical highschool tropes and stereotypes can be found in this show.",
      "date": "Jan 13, 2022",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Great show!  Totally surprising.  The casting is brilliant.  The suspense and story plot are terrific.  Great weekly show!  Looking forward to Season 2!",
      "date": "Jan 12, 2022",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show catfishes you… leads you to believe it's going great but really it's just cheezwhiz!",
      "date": "Jan 12, 2022",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "This is ridiculous show.  I tried to like this show, I really did but I shouldn't have to try to like a show.  Aside from being ridiculous, Hollywood just doesn't give a crap if they make a good product anymore.  Little kids will like it and say it's amazingly amazing and it's literally cast literally amazing.  The show is dumb dumb dumb dumb dumb dumb dumb dumb.",
      "date": "Jan 11, 2022",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "At times it clicks but then it gets chunky with bad writing, acting, and editing…. Wanted it to be better then it turned out",
      "date": "Jan 11, 2022",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "Yet another show where the audience on 'Rotten  Tomatoes' feels pretty let down yet if you believe  the scoring of critics (and I like many others think it is far too generous) the drama is apparently perfect! Well it certainly does not deserve anything like 100% (the current  meaningless critical rating.  The show is a mess, stranded between genres  with a dearth of any characters you could ever begin to like. And the comparison to 'Lost' , 'Lord of the Flies' or even 'The Wilds' shows just how lacking it is.",
      "date": "Jan 10, 2022",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Gross for the sake of being gross makes for a stupid show",
      "date": "Jan 10, 2022",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Rubbish and boringly. You will think its a slow burning show but you relise its almost the end of the season with nothing to show for a season. This is your typical school kids in dilemmas. The horror side of it is dull I spent more time looking at my phone than trying to engage with this rubbish. Best thing about the show is the intro.",
      "date": "Jan 10, 2022",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I don't have enough good things to say about this show. Beyond thrilling! The acting is incredible.",
      "date": "Jan 10, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Shows like this don't come around often enough. You'll know by the end of the first episode if it's for you, and if it is it does not disappoint. Morbid curiosity will keep you glued to the screen.",
      "date": "Jan 9, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "What sounds like it could be Lost, is actually more like a 1990s horror film tied with modern drama reflective of our current tumult. The storytelling shifts between the two time periods to reveal the dark and light sides of characters, while giving insight to \"what really happened\"; the question peripheral characters keep asking.",
      "date": "Jan 9, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Amazing, surprisingly good.",
      "date": "Jan 8, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "(As of episode 8)\nOne of the best series of 2021, crossing to 2022: it brings to the table the charm of survival dramas, the whodunnit tropes and magical interpretations from both the young girls and their adult counterparts.\nThe start is really strong but I can definitely say that this series grows on you: the weekly release is super needed, the suspense wouldn't be as much. love it, I hope the next seasons have still as much to say",
      "date": "Jan 8, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Best show I've seen in years. Stellar cast. Melanie Lynskey and Christina Ricci in particular are great. And most of the younger actors are great too! So interesting and compelling, good soundtrack. Can't rate highly enough.",
      "date": "Jan 6, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Best new show I've seen in years. Ricci is amazing, as is the rest of the cast. Can't wait to see where this continues to go!",
      "date": "Jan 6, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Sorry it's not very good. No offense but it's really kind of dumb. The characters are all over the place and super over dramatic. You like absolutely no one in it. The music and sounds are terrible and Story line is cheese. I've watched every episode waiting and wanting  to like it. I would say to you not to waste your time like I did. I really think the critics were monetized in some way. That the only way I could understand the Fresh Score.",
      "date": "Jan 5, 2022",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I tried, I really did because I'm a huge Ricci fan. Watched 3 episodes even though 1 and 2 were both boring and confusing. It does not get better and I still don't know what's going on. It's very.. um, ADHD. I just can't follow any of the storylines they throw at us. I also don't care. Overall, not a good show. Skip it.",
      "date": "Jan 5, 2022",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Meandering, nonsensical, annoying.  Almost done with the season and still unsure if there is a central mystery.  Clunky acting, clunky themes.  Loved the idea of a female Lord of the Flies/Alive.  But instead of giving you a survival tale, they dole out small flashbacks.  Like everything these days, its more about identity than survival.",
      "date": "Jan 4, 2022",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I have no idea why this show revolves around a girls football team when it is blatantly obvious that, not only can none of them play, but they don't seem to know the rules either. I only gave it a try as I'm fond of a few of the cast members but the writing was so cringeworthy I didn't make it to the end of episode 1.",
      "date": "Jan 4, 2022",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "This series had me sitting on the edge of my seat.  Great writing and acting.  Cannot wait for the next season.",
      "date": "Jan 4, 2022",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "every time the plot doesn't know where to go, some blood or some weirdness appears. the mysteries are silly and everything is too superficial and far-fetched.",
      "date": "Jan 3, 2022",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "I have never been this into a TV show.",
      "date": "Jan 1, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Best new show of the year. Casting and character development is amazing. Christina Ricci is perfect.",
      "date": "Dec 29, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Riverdale lost in the woods after a plane crash on a 90's soundtrack. As you can guess, this is just ridiculous.",
      "date": "Dec 29, 2021",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Plane crashes in the mountains of northern Ontario🤣lol, Where would that be?!?",
      "date": "Dec 28, 2021",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I haven't been this into a show in awhile. 90s soundtrack. Juliette Lewis playing Juliette Lewis like only she can. Christina Ricci being the epitome of Munchausen. Must see",
      "date": "Dec 28, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I absolutely LOVE this show and I love not being able to binge it. I haven't been this hooked on a show in awhile.",
      "date": "Dec 28, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Definitely one of the best series of the moment.\nIt has mistery / suspense / drama with a dream cast of fantastic actresses.\nObviously Christina Ricci and Juliette Lewis are the famous ones and are no doubt pretty good actors, but the rest of the cast is at their same high level.\nTwo discoveries for me:\nElla Purnell (as Jackie);\nand specially Sophie Thatcher (as teen Natalie) who I find extremely sexy and captivating.",
      "date": "Dec 27, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The casting is phenomenal.",
      "date": "Dec 27, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "All suspense and no substance. I don't believe the positive reviews are genuine. If \"Top Critics\" are just influencers then RT has no legitimacy.",
      "date": "Dec 27, 2021",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "I love this series. It is illuminating and refreshing to see a story centered on teenage girls who were the king shit in HS and the ones sent of to do battle in a warlike struggle for survival. The plot really has me wondering what will happen.",
      "date": "Dec 27, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Yellowjackets is kind of like 'Lord of the Flies' with a girls' soccer team that gets stranded in the Canadian wilderness after their plane crashed in the 90's. The show has a seamless dual timeline taking place between what happened to the survivors after their plane crashed in '96 and what's currently happening to them in the present. There are exciting twists with interesting and complex characters and I can't wait to see what happens next in the series. To top it off, it also has a killer 90's soundtrack.",
      "date": "Dec 26, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great show, at first I gave it 1 star but I had to change it to 5. \n\nIf at first it seems boring give it a chance and you may be surprised.",
      "date": "Dec 26, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I can't wait to see where this goes.  Stellar acting and suspense",
      "date": "Dec 26, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The storyline is predictable and honestly it is harder and harder to watch each week because it is dragging and lacking creativity.",
      "date": "Dec 24, 2021",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "my favorite show of the entire year. great acting, plot, pacing! I haven't been as addicted to a series in a long time.",
      "date": "Dec 23, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Very weak story line taken directly from the soccer team crash in 1972 Uruaguay then add a WAY-too-healthy dose of supposed teen over-dramatization.  The writing/script is totally unbelievable and nonsensicle, decent acting, an inability to tie all the storylines together and you wind up with a boring yet redundant hot mess.  Could have been good, should have been good, wound up very poorly done.  Just another example of expensive marketing and horror/gore in lieu of actual quality.",
      "date": "Dec 22, 2021",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "This is kinda popcorn porn.  Something really sleezy about it.  Sort of teases porn, cannibalism, and dark magic.  Delivers on none (so far.)  Feel like a shower every time I suffer through an episode, sort of like a soft porn that never delivers.",
      "date": "Dec 21, 2021",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Nice little mystery unravelling so far, great performances by the cast. Story burnt a little slow at the start but now starting to pick up the pace rapidly, but even the earlier episodes had enough going on in them that i wanted to see the next immediately, definitely give this a shot, could be a huge hit if they stick the landing.",
      "date": "Dec 21, 2021",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "I'm really enjoying this show so far. Love the characters, love the storyline",
      "date": "Dec 20, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The dialog between these people is so awful. \n\nSo terrible that one character, a 30-plus-ish man's dramatic line is \"okay, like, so totally, totally horrible\". That's a quote. \n\nWhat a waste. \n\nThe worst take-away for me is when I'm told, as a plot point, Christina Ricci is \"the ugly one\".",
      "date": "Dec 19, 2021",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "After 5 episodes, all I can say is that it's the best television series I've seen in years ! Simply great 👍👍",
      "date": "Dec 17, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "S01E01 shew us so much information ,it seems that I have the clear portrait of the story ,so I  am just confusing ,how the story will go on ?Can't being wait to follow up .",
      "date": "Dec 16, 2021",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "Only one episode in but its got my attention.",
      "date": "Dec 15, 2021",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "I love it it gets five stars",
      "date": "Dec 15, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I loveeeeeeeeeeee everything about it thus far.",
      "date": "Dec 14, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Someone better eat somebody soon or I'm giving up on this show.",
      "date": "Dec 13, 2021",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Much like the intro sequence, Yellowjackets is frenetic, scattered and slightly difficult to grasp at times. The show switches timelines without remorse. There's a mystery afoot, and it's a very mysterious mystery. If only the show ever got around actually doing more with it in the first half the season. You'll find random carvings on trees in the past timeline, and a little boy straight out of The 6th Sense who is flaking out in front of his mothers in the present timeline. Mothers who seemingly have better things to do than pay attention to their creepy child. It also appears like everyone the survivors run into in the present day are trying to dig into their past, setting up yet another question: Why are they being targeted and harassed? Reporters, Donors, Lovers...all want a piece of their truth. \n\nIn some ways the show reminds me of Apple TV's Invasion. There's something going on, but the camera is pointed straight at the characters the whole time. Luckily this show, while uneven, has the groundwork to really fill out as the season ends. I hope they can stick the landing.",
      "date": "Dec 13, 2021",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "I wanted to like this show so much. It had so much promise: Lord of Flies meets teenage girls of the 90's.  Okay, not an original storyline, but so what? Classics are classics, because they are great stories. And, the cast is packed with accomplished character- \nactors who are well known for their portrayal of psychotic types.  However, this re-take couldn't be more boring. It gets one star because the opening scene was compelling and grabbed my interest. After that, I've been waiting for something—ANYTHING—to happen, but nothing does. The premise of the whole show is that something happened in the woods where the plane crashed which has  had a lasting, negative effect on the women in this story, but it takes way too long to make any connection.  It is clear that each woman has psychological problems now because of \"what happened,\" but they never get to the what. The plot drags on and on, flashing back and forth between the 90s and present day, with each boring scene making the statement: this woman is a psychological mess of depression & anxiety with a dash of psychosis, due to her time in the woods with the other girls. The story also eludes to some sort of other-worldly/occult influence over the group,, which basically had me SMH and thinking, \"what?\" On top of a plot that goes nowhere, the characters (both young and old) are entirely unlikable. They are collectively annoying, depressing and immoral. And, somehow, each character's brand of immorality is thoroughly boring. It is difficult to make any connection to the girls in the forest or their adult counterparts. The characterization is lacking in that way too little attention has been payed to bringing the audience into the girls' experience.  So far, this show has been a big disappointment. I simply cannot understand what some people like about it.",
      "date": "Dec 13, 2021",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Damn that was boring. The slowest TV series I watched this month. It's like customer service.",
      "date": "Dec 12, 2021",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Love this show.  Gripping throughout.",
      "date": "Dec 11, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Left me wanting more!",
      "date": "Dec 11, 2021",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "haven't seen anything this good in a long time",
      "date": "Dec 8, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show is all female cast of Lord of the Files only did that to even be up for any awards. I watched about 20mins of Pilot and it was sad. Only 2 well known members of the kids cast the adult are all has been. I never liked showtime shows but this is over produced bad writing. This show is full of wrongs like girls soccer really i live on east coast was in school in 90s girls soccer was not that big it was track and field, field hocky,lacrosse. The writer looked at top girls sports 2021 pop got soccer. This show flip flops all over time the pilot should be a start to what is happening but it is so all over place you cant even get into show. Lets talk now about the critcs on rotten tomatoes they must have been paid being no way it could get a perfect score read watcher reviews and you will see that this show it total garbage. I give it 5 👎and zero  🍅 .....",
      "date": "Dec 7, 2021",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Pretty, pretty, pretty good!...",
      "date": "Dec 6, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Just not believable and I am used to suspending disbelief for a good story.   All the different character arcs and flashbacks are tiresome.  The characters aren't very likeable.   Lord of the Flies for girls with pedestrian imaginings of who they become years later.   Just because we have run out of good stuff to watch due to covid shutdowns doesn't mean we should invest our time with this convoluted drivel or try to care about what happens to these fictional survivors.",
      "date": "Dec 5, 2021",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "Absolutely Awful just awful     God help us",
      "date": "Dec 5, 2021",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Part \"Lost\", part \"Lord of the Flies\" (distaff division), \"Yellowjackets\" follows a girls' high school soccer team that crash-lands in a densely-wooded area on their way to a far-off tournament.  The action shifts back and forth in time (again, just as in \"Lost\"), with the grown-up versions of the girls in the present, and their younger, less mature, frightened selves living (and trying their damnedest to survive) in the past.  Much has been made already (I've seen three episodes so far) of the deep, dark secrets the survivors are concealing; what, exactly, DID happen in those woods? WAS cannibalism involved? (It's certainly been teased.) And how were they able to make it out of there alive, anyway? Good questions all, and whatever promise the series has--and it's got a lot--undoubtedly lies in the Big Reveals that are right around the corner; anticipating those moments should keep fans glued to their TVs for weeks to come.  If there's a problem with \"Yellowjackets\", though, it's the size of the cast; the girls themselves, the troubled, unsmiling, secretive women they become, all the peripheral characters--there's a lot.  But the acting is fine, the relationships believable, and the crash sequence itself--which has been repeated more than once--may steer you away from air travel for good.  Well...there's always Amtrak.",
      "date": "Dec 5, 2021",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is the best TV I've seen this year.  So creepy, mysterious, and dark.",
      "date": "Dec 5, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "What is the lass from the Washington Post on about, it hasn't an original gramme of originality in its DNA ?! It is, most definitely, a direct ( feminine) rip off of William Golding's classic. Teen tosh !",
      "date": "Dec 2, 2021",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "It has been so long since a series took a classic story line and twisted it so intriguingly that I can't wait for the next episode! Stay mysterious and original! Loving the mystery!",
      "date": "Dec 2, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It jumps back and forth between timelines for seemingly no reason. By the end of the 3rd episode just about 180 minutes in and I couldn't care less about the adult story and no real premise has been set at the past. How can a story about plane crash survivors be so slow, boring, inaccurate and uninteresting?",
      "date": "Dec 2, 2021",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "Getting a Lord of the Flies vibe. First 3 episodes are good so far.",
      "date": "Nov 30, 2021",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "I'm confused as to how this show has good ratings. I was hoping for more but it's just barely ok.",
      "date": "Nov 29, 2021",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "The show is not very good. It's not the most original or exciting plot but I guess nowdays writers need to use plots from old movies and mix them together. The second to the last episode was especially lame however. I'm sorry but shrooms do not make you a psychotic murderer. It may give you great hallucinations and the giggles but not homicidal impulses... And if you were to sleep outside and it starts to snow, you would wake up from being too cold, not freeze to death. There are many more issues with the plot but these were some of the glaring ones.",
      "date": "Nov 26, 2021",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "There are some riveting moments, but after two episodes, there still is not a compelling plot to follow—taking too long to launch.",
      "date": "Nov 24, 2021",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "If the first two episodes are any indication of what this series will evolve into, we are in for quite the ride.",
      "date": "Nov 24, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great opening episode, I'm in!",
      "date": "Nov 23, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Going into the pilot, I was already aware that this story wasn't too original. I was thinking \"Lord of the Flies\" with females, but okay. The pilot was uber cheese whiz. So, if you enjoy boring pace, silly teen urban music, cliché archetypes and the like, go right ahead and watch. If not and if you want something far more sinister and thought provoking with great cinematography -- go to Amazon and watch \"Fortitude,\" an awesome 3 season series.",
      "date": "Nov 22, 2021",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "Great cast, great premise, looks like it will be terrifying after the first episode.",
      "date": "Nov 19, 2021",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "A tad boring except for the endings when they get a little closer to what happened when they were stranded (though seems like cannibalism). Overall it's just interesting enough to keep at it and unravel the rest.",
      "date": "Nov 17, 2021",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "First episode really draws you in.  Intense, captivating, great cast.  Can't wait to see what happens next.",
      "date": "Nov 16, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Imagine a cross between Alive (the movie about a Rugby team that crashes and the survivors eat each other) and Lord of the Flies. That's where they got the idea. Sure of it.",
      "date": "Nov 16, 2021",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "I was really captivated by the pilot. It sets the stage for what should be a really compelling series. It's nearly entirely female driven, great cast, and relies on past/present narratives woven together. The pilot ends with a real bang. I do wish Showtime had released 2 or even 4 episodes up front, to help the audience get hooked. The show teases where it is going in the future, and it is going to get very, very dark. It's almost like Lord of the Flies,  but all female, in the dead of winter in the Canadian Rockies. The present narrative also sets the stage for a lot of intrigue. Some are comparing it to Lost, but I think this series will remain more grounded in reality, and because it isn't network, it is not constrained the way Lost was in terms of adult content.",
      "date": "Nov 15, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Perfect! No complaints at all. The pace was brilliant, the characters felt right, that late 90s teenage girl vibe was perfect and somehow managed to get so believably dark.",
      "date": "Nov 15, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "These girls hit a home run and it's great to see some old faces from back in the day looking beautiful as ever!",
      "date": "Nov 14, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    }
  ]
}