{
  "avatar_the_last_airbender": [
    {
      "review": "Great season for a great show. Not very action packed but sets up the rest of the show very well and overall give you a great connection to characters. Last few episodes are amazing though",
      "date": "May 14, 2024",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "For me is the best start of season in a series. Avatar: The Last Airbender touches on a very serious theme and that's what makes the series for all ages. Children and Adults should have to watch this series because os a exceptional.",
      "date": "May 10, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Una verdadera obra maestra, la empezé a ver en 2024 y sin lugar a duda es una de las mejores series de la historia. La evolución de los personajes la historia y la acción es un 10",
      "date": "Apr 29, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It’s the best animated series of all time.\n\nThe character development, the design, the references, the deep messages and the critic to our society are absolutely mind blowing.",
      "date": "Apr 27, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Right from the start the show hooks you with it's fantastic story and characters.",
      "date": "Apr 19, 2024",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Perfect in every aspect of each episode",
      "date": "Apr 17, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is the best series oat with the only series to have 10/10 for me throughout the whole series",
      "date": "Apr 15, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It's the beginning of greatest tv show ever made my favorite character is definitely Avatar Aang throughout the show its an emotional season too the writing is just fantastic book one water is just incredible",
      "date": "Apr 14, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "A compelling and beautiful beginning to the greatest tv show I have ever seen. It may sound hyperbolic to say that about a kid’s show but I was blown away. I was 22 when I watched this the first time and the story had me crying on multiple occasions. Words don’t express the magnitude of the beauty of this show.",
      "date": "Apr 10, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show crafts a world that every fantasy creator wishes they had. The world building is exceptional which creates great scenarios for the amazingly well written characters. They find a way to make every battle use the tools the character's have in new ways. Every episode is memorable and worth watching.",
      "date": "Apr 7, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "A fantastic introduction to one of the greatest cartoons of all time",
      "date": "Mar 21, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The animation style, the character arcs, the finale are all top tier. It's a little slow moving through the first few episodes but once the pace picks up it doesn't stop.",
      "date": "Mar 6, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Really good Show. Good rythm, good story, good characters and personalities.",
      "date": "Mar 3, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It's just the best.",
      "date": "Mar 2, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The best animated series ever made. Simple as that!",
      "date": "Mar 2, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is a perfect show, the pinnacle of all you could ever hope to achieve in a show. I thought it would take a little trudging through to actually get into, but right from the get go this show is amazing.",
      "date": "Mar 2, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "One of my favorite shows of all time",
      "date": "Feb 28, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It's exciting, it subtle, it's beautiful. There's nothing bad to say about this show.",
      "date": "Feb 26, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The greatest show ever made.",
      "date": "Feb 26, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "100x better than any adaptation",
      "date": "Feb 25, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Best tv series ever, no adaptation will ever come close to this masterpiece.",
      "date": "Feb 24, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Just amazing story telling. From start to finish. Just a perfect show for kids and adults.",
      "date": "Feb 24, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "19 years later, Book 1 still holds up so well - and it’s the weakest of the 3 seasons! Aside from that Great Divide episode, there’s very little to be criticized about the original first season of ATLA. I guess the plot of some episodes moves a bit too quick, but they only had 20 minutes to work with back in the 2000s. I’m just nitpicking at this point.\n\nScore: 9/10",
      "date": "Feb 24, 2024",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Some of the opening episodes are only okay. The tone and plots are much more of a kid focus while the later seasons are written to be more family focused. The second half of the season deals with bigger and more serious issues.",
      "date": "Feb 23, 2024",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is a timeless masterpiece and a great example of world building and fantastical storytelling. \n\nI dare say, the world building is better than Star Wars, Game of Thrones, and even the Lord of the Rings. And I'm not exaggerating. That's how good the original Avatar The Last Airbender world-building is.",
      "date": "Feb 23, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It's a perfect show. People need to recognize that they're not going to improve upon it by making it again, so they're not going to make any money off of it. If they want to make money, invest it in allowing the original creators to make more new ideas.",
      "date": "Feb 23, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Came here after the adaptation because it reminded me how great the original was. You just cannot create something better. Especially not if you take depth away. I want my Sokka arrogant, my Katara angry and my Aang childish in season 1.",
      "date": "Feb 22, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Very good show set in an amazing universe. The characters are well written with a fair amount of enjoyable humour sprinkled throughout.",
      "date": "Feb 20, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The start to the greatest show of all time",
      "date": "Feb 19, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "A great beginning to an amazing show!",
      "date": "Feb 19, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The start of an amazing and entertaining adventure of epic proportions to what I'm sure is one of the best animated shows of all time, cant wait to watch more",
      "date": "Feb 17, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "When people used to roam the world in search of their purpose, but they do it Pokemon style, but with super powers. And then, they also go on a mission to murder the angry fire-lord. What's with all of these 2000's shows where children have to save the day by murdering people?",
      "date": "Feb 7, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great show. Literally fire🔥🔥🔥. My child hood.",
      "date": "Jan 4, 2024",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "SHut UP AND WATCH THIS. \nthis is the begin of the tv show that changed my life.",
      "date": "Jan 3, 2024",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Greatest animation series ever. Many interesting characters, captivating story, lot's of differents locations. Dynamic, fluid action scenes. An overall adventure feeling. Highly rewatchable.",
      "date": "Dec 28, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Season 1 is little bit simpler and less deep than season 2 and season 3. However they had to start it someway, and I believe they the best they could.",
      "date": "Dec 26, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "When I was 12, this show came out and I was completely captivated by it. Nickelodeon, known for wacky shows like SpongeBob, Rocko's Modern Life, and sitcoms like Drake and Josh, took a massive step forward with this anime-inspired animated series that delved into deep philosophical themes, genocide, and war.\n\nWhile the concept of elemental power in media isn't new, the show's approach to integrating each element into its own nation, reflecting the psyches and philosophies of the respective element, is truly remarkable.\n\nThe characters are expertly written and performed, with Zuko being my favorite. His incredible progression from villain to antihero to hero is perfectly captured. Aang is a good character, although a bit too much of a goody-two-shoes at times. Katara, Sokka, and Toph are equally appealing characters.\n\nThe show's brilliance lies in its perfect pacing. While there are occasional filler episodes, each one (except The Great Divide) serves a purpose and adds layers to the intriguing story and its world.\n\nIt's impressive how the show incorporates heavy topics while maintaining a silly sense of humor. It's frustrating when people dismiss it as just a 'kids show'. The series can be enjoyed by anyone, regardless of age. It doesn't pander and handles the heavy subject matter in a mature way.\n\nAfter The Legend of Korra, Nickelodeon didn't seem to follow in the footsteps of Avatar, which was disappointing. Kids need more shows like this, to be honest.",
      "date": "Dec 26, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "a masterpiece in every sense of the word!",
      "date": "Dec 8, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Absolutely amazing TV show. Made me laugh multiple times, Aang is so funny. If you haven't watched this before you're missing out.",
      "date": "Nov 24, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Super Polecam jedno z najlepszych anime jakie wydzialem",
      "date": "Nov 22, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "One of my all time favorite tv shows (of all time!). The storytelling, characters, their development and the scenes and music is a masterpiece and the full series is simply complete.",
      "date": "Nov 11, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great start: sweet, funny, great cast, and an underlying deeper development on war and peace.",
      "date": "Nov 7, 2023",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "8/10\n(P:8 C:10 B:8 A:7 D:7 O:8 F:9 )",
      "date": "Oct 26, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Omg wow that's amazing 🤩",
      "date": "Sep 28, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Avatar is if perfection was put into a series",
      "date": "Sep 28, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is so fantastic",
      "date": "Sep 19, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I'm not going to do separate reviews on every season. Of all the movies and series I've seen , ATLA is the one I have the fewest complaints about (if any at all). Brilliant story, clever world building that is respectful to the existing world cultures and an extremely satisfying ending. What I really love about the series is it's incredibly diverse set of characters: people of unstained character, those who are pure at heart, although struggling in the ways they act, ones who are on the right side, but achieve their goals by unforgivable means, people who act wrongly, but due to heartbreaking backstories, and finally characters which are simply evil. All in all, one of the greatest masterpieces of all time",
      "date": "Sep 18, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is a masterpiece",
      "date": "Sep 11, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is a masterpiece",
      "date": "Sep 6, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is a masterpiece",
      "date": "Sep 6, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Brilliant animated series. 10/10",
      "date": "Sep 2, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is just perfect and amazing",
      "date": "Aug 20, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is the best show ever made. It's emotional, exciting, romantic, and action packed! The plot is so good and everything about it is top tier gold!",
      "date": "Aug 15, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "A fantastic start to the show with a great story and a great season finale. Some episodes felt like filler and some jokes imature but I can't wait to keep watching it.",
      "date": "Aug 2, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "This show is at least top 5 television shows ever made. The character development of Zuko, Aang, Katara, and even Appa was mindblowing. You won't regret binging these series.",
      "date": "Jul 31, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show is absolutely amazing",
      "date": "Jul 29, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It's fine, the first episodes are very boring but the rest is pretty good. The finale carries the whole season though",
      "date": "Jul 27, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Deep philosophical themes packaged in a cute animation with well-rounded characters and plenty of laughs. What's not to love?",
      "date": "Jul 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It was an amazing experience watching this season I think all the characters have an interesting story. The plot is very interesting. The season finale showed much character development. The animation through the first couple episodes wasn't the best but it got better in the middle of the season. Character designs were absolutely stunning.",
      "date": "Jul 19, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This Nickelodeon show had no right being this good.",
      "date": "Jul 11, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I'd give this season 6 stars if I could.",
      "date": "Jul 8, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I can't say enough about this series. It starts as a kid show, but quickly becomes so much more.",
      "date": "Jul 2, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Increible serie, atemporal. gran desarrollo de personajes, creación de universo y en general mi favorita",
      "date": "Jun 5, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It's amazing, I doubt the Live Action will live up to the OG animation, let's see.",
      "date": "May 28, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Show overall is perfection. The first season is definitely the weakest in terms of pacing and plot but builds up the world well.",
      "date": "May 24, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Absolutely incredible series. Definitely in the run for greatest show of all time",
      "date": "Apr 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Season 1 of Avatar is an amazing start to one of the greatest shows ever. \"The Storm\" and \"The Blue Spirit\" episodes really highlight the shows greatness.",
      "date": "Apr 20, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Greatest tv series I have ever watched and rewatched. I watched it as a kid growing up and enjoyed it a lot. Then during my teenage years, I rewatched it with my sister and my parents. Lately, I rewatched it at university with my Uni friends. Each time I appreciated a completely different aspect of the show. It is utter perfection in world-building, character development and the telling of a good story. All can appreciate the show regardless of age or gender or race. It is the epitome of storytelling.",
      "date": "Apr 10, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Aang is the last Airbender on planet earth. After 100 years of being frozen in an iceberg, two kids find him and bring him back to life.\n\nFrom that point on the journey of the three friends begins.\n\nThey travel through the world, so Aang can relearn the elements again.\n\nOn their journey they face many ups and downs, but they need to keep going, because Aang is still very young, but with him being the Avatar the fate of the world lays in his hands.\n\nAvatar is definitely a masterpiece for me.\n\nIt's just fun to accompany Aang and his friends on their journey, watching the group grow together and seeing Aang realize his responsibility as the avatar.\n\nA clear recommendation for anyone looking for a feel-good series!",
      "date": "Apr 9, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is one of my favorite shows from my childhood",
      "date": "Apr 5, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I love the way it portrays the characters and humanizes even those who are in the wrong. I cannot name a single poorly-developed character. I could go on and on about how I admire it's philosophical and spiritual foundation. It encourages the pursuit of learning and living by truth, and it teaches that all life is sacred. I love how it takes the highlights of cultures and histories around the world and brings them together in a unified story of understanding. At the plot's climax, it teaches the importance of justice through non-violence. Throughout the story it shows the blessings of working hard enough to become a master while still maintaining a child-like spirit.",
      "date": "Mar 11, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "ATLA is one of, if not the greatest animated show of all time",
      "date": "Mar 1, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Una de las mejores series de todas, con una trama que engancha y suficiente comedia para no aburrirse, los personajes están bien eateries y cada uno tiene una personalidad única que se va desarrollando a lo largo de todas las temporadas, sin duda en mi top 3 de series.",
      "date": "Feb 21, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Aang and the gang are a great cast of characters and you will grow love and enjoy every moment they are on screen one way to describe it would be that they feel Real.\nAction: also great they used the power of animation to its max beautiful fight scenes and Bending art styles.  \nWonderful world building: The world is huge and feels real and at the same time it feels unreal the way all the nations are established to us on how they work and how people who live the Live.\nStory: Great stories' and great executions the beloved Prince Zuko ark is one of my favorite though it is hard to chose as they are all very well wrighten and executed in the Show. \n11/10 100% Guaranteed to Enjoy this Show",
      "date": "Feb 20, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I loved this so much it made me hit the griddy",
      "date": "Feb 10, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Still my favorite animated show ever",
      "date": "Feb 1, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Not absolutely flawless but a great story that sets up the incredible stories and characters perfectly.",
      "date": "Jan 22, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "A masterpiece of media",
      "date": "Jan 17, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Absolute masterpiece and one of the greatest shows of all time.",
      "date": "Jan 13, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "greatest series of all time",
      "date": "Jan 12, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "An amazing first season to one of the greatest animated shows ever. Slightly slow as its the first season so it has to set up the world but amazing.",
      "date": "Jan 9, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Childhood nostalgia perfection",
      "date": "Jan 4, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I grew up watchin this on nickelodeon 10/10 ^^",
      "date": "Dec 4, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It is a amazing series and i really recommend it, they story and characters are amazing",
      "date": "Nov 19, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The weakest stepson of ATLA, but all the worldbuilding is needed to make the other seasons to be what they are",
      "date": "Oct 12, 2022",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Libro Uno: Agua.\nCon esta temporada empieza el viaje de Aang, una historia la cual amaras, desearas y no podrás dejar de verla. No puedo decir nada mas que ya se haya dicho, esta serie es hermosa, tiene una historia perfecta, personajes carismáticos, buena animación, etc.",
      "date": "Oct 1, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I would give this zero stars if I could, but Rotten Tomatoes won't let me. This has got to be the dumbest show in existence. I would rather sit in a room and bang my head against a wall repeatedly while watching Teletubbies. How are you supposed to take this show seriously when the main character is a bald kid with an arrow on his head so that he doesn't forget where his eyes are? He's an \"AiRbEnDeR.\" What does that even mean? He can bend air? If I reach out, and ball my hands into fists, am I technically holding air? If so, then I can move my hands, and bend the air. WOW! Amazing how that works. The villains are a nation of fire people, and yet they have a BOAT? If you can control fire, WHY DO YOU WANT TO BE NEAR WATER? And why does a hurricane defeat the fire nation? WIND FUELS FIRE! -10/10",
      "date": "Sep 4, 2022",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "The first season of AVATAR: THE LAST AIRBENDER starts off on a high note, with lots of excitement and humor to go along with it. However, when the second half kicks in, it becomes an intense roller coaster ride that will keep everyone on the edge of their seat.",
      "date": "Aug 22, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Season Score: 84% |Ratings by Episode | {EP1: 7.5/10, EP2: 9/10, EP3: 10/10, EP4: 7.5/10, EP5: 8/10, EP6: 9/10, EP7: 8/10, EP8: 9/10, EP9: 8/10, EP10: 6.5/10, EP11: 9/10, EP12: 7.5/10, EP13: 10/10, EP14: 8.5/10, EP15: 7.5/10, EP16: 10/10, EP17: 8.5/10, EP18: 8/10, EP19: 8.5/10, EP20: 8.5/10}/ 20 Episodes = 84%",
      "date": "Aug 18, 2022",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Probably one of the best series of all time.",
      "date": "Aug 13, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "this covers the whole show. without a doubt one of the best and most influential animated, and dare i say, overall series of all time. 10/10",
      "date": "Aug 2, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Book Water is the beginning of one of the best TV shows in history. A must watch!",
      "date": "Jul 17, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great and enjoyable show. Its a bit slower that some of the later seasons but still remains quite enjoyable nonetheless",
      "date": "Jul 1, 2022",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Avatar the last Airbender is not only the best nickelodeon ever made. But it's one of the best TV Series ever made 10/10",
      "date": "Jun 18, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Amazing, funny, kind, heartwarming",
      "date": "Jun 2, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is my opinion for the best show ever.",
      "date": "Jun 1, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It is known to everyone that the first season of this wonderful series, is considered the black sheep because of the homer that is more aimed at children, the animation obviously received less investment than all the other seasons, the pacing which is very slow and cumbersome compared to the other two seasons but !!! This season has some things that no season has, it has a wonderful world development, and knowing characters that will help make connections, it has this feeling like before you go to high school and ninth grade this is the class to laugh and enjoy nonsense before entering the more serious and tough world and of course this season has the Episodes 12 and 13 for these reasons and many more reasons in my opinion this wonderful series deserves 5 stars every season",
      "date": "May 19, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The character development by season 3 is phenomenal.",
      "date": "May 18, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Avatar the last blender",
      "date": "May 5, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Book 1 sets up the rest of the series perfectly. The format is also incredible, individual episodes deal with character development and tie into the season finale and then into the series finale. In other words, watch it already bozo!",
      "date": "Apr 19, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "absolutely perfect in every please watch",
      "date": "Mar 16, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Such an amazing show, this season is a great set up for what is to come, this is my third time watching the show and my appreciation for the writing grows every time. This series balances depth and humor perfectly and the character arcs and dynamics are impeccable! Watch the show with a friend, it's so much fun to laugh and discuss together!",
      "date": "Feb 27, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "A wonderful blend of worldbuilding and character progression. This show is amazing no matter what age you are when you watch it. If you need any proof of the beauty of this show just watch The Storm.",
      "date": "Jan 11, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The beginning of a masterpiece. Avatar has an engaging world and interesting characters and history. It is nice to see such a largescale story play out with a very real sense of progression – especially in a kids show. The show is still in its early days though and while there are quite a few episodes in here that are truly great there are also some that add very little.",
      "date": "Jan 3, 2022",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Avatar is one of the few series that pushes past the tendency of first season silliness, and should be seen very clearly for having a complete arc for the cast, antagonists and even the wider world. Still, some early episodes are less-than-stellar despite being enjoyable for most fans.",
      "date": "Jan 2, 2022",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "While it may be the weakest of all three books, Book 1: Water has some of the greatest not only avatar episodes, but greatest nickelodeon episodes in general. With greats such as The Southern Air Temple, The Storm, Siege of the North etc. Avatar: The Last Airbender is a must watch for any fan of fantasy.",
      "date": "Dec 17, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "If you never saw the show, THEN WHY ARE YOU WASTING YOUR TIME READING A REVIEW?!?!?!!? GET NETFLIX AND WATCH IT RIGHT NOW!!!!!!!!!!!!!",
      "date": "Nov 29, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "5.7/10 — \"Mediocre\"/\"Passable\"",
      "date": "Nov 20, 2021",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "Book 1: Water, Avatar's first season, is an incredible introduction to the show. \nIs it flawless? No. I do think this season has some of Avatar's weakest episodes, and the earlier episodes did struggle finding that balance between the action, the comedy, and the drama, but at the same, that's to be expected of the first couple episodes of any TV show.\nMost of the episodes were highlighted by their fun and easily likable characters, creative action set pieces, and incredible worldbuilding.\nIt's definitely not my favorite season of Avatar, but as a first season to a TV show, it's definitely one of the better ones. And it only goes uphill from here! Onto Book 2: Earth!",
      "date": "Nov 14, 2021",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show does a good job of presenting a very mature setting in a way that's appropriate for children while simultaneously not feeling \"kiddy.\"  There are a few stumbles along the way (notably The Great Divide), but it's quite good.",
      "date": "Oct 21, 2021",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "\"Avatar The Last Airbender\" is a stylized show that delves in much more than what you might think on its surface, with breathtaking visuals, immaculate characters, imaginative worldbuilding, incredible storytelling and innovative animation at its forefront brings this indelible first season a status of some of the best animation television still talked about to this day.",
      "date": "Oct 1, 2021",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "AMAZING, BEST SHOW TO EVER EXIST",
      "date": "Sep 13, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The greatest cartoon made in the west, a classic that shaped my childhood.",
      "date": "Sep 11, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The best animated show ever made.",
      "date": "Sep 1, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "82/100 soo good, impressive",
      "date": "Aug 17, 2021",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "One of the best-animated shows of all time.",
      "date": "Jul 19, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Ok so….this is clearly the best series to come out of Nickelodeon ever, but that doesn't mean that it saves it from being the weakest of the three seasons by a pretty big margin. It all really boils down to one thing, which I will talk about in a sec. First all the great stuff about this series: basically everything except the big problem. The problem being when the show goes for episodic adventures and not an over arcing story. The episodic adventures are fine, but it's a little frightening how much better the over arcing story is. Biggest example is episodes 9-11 for me, with them barely being watchable. The worse of this group being the great divide. Also, the characters that they meet during the episodic adventures are way more annoying than in in the other two seasons. Going back to those three episodes, the biggest culprit of this is Jet. Oh My God do I hate Jet! To be fair, the other two seasons I think also have this problem, just not as drastic. If you can look past those things (which I did for the most part), I could argue that this is the greatest American cartoon series ever made. Again, easily the best Nickelodeon series ever made. Go on Netflix and see for yourself!",
      "date": "Jun 21, 2021",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Unlike the pace of it's live-action adaptation which was slow, the pace is fast, the action sequences are epic, and the storytelling is groundbreaking, although I should also probably say that about the earthbending! Haha get it?! cuz earth also means ground, and I said groundbreaking. Anyways, this is an excellent series so far. Even some of the humor is hilarious",
      "date": "May 29, 2021",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "7.0. Avatar is certainly made for kids, with its predictable plot and lackluster emotional moments, yet it still manages to have a story filled with friendship, action, and journey. While it certainly doesn't recreate the wheel in any shape whatsoever, it combines the western world of cartoons with the Asian world of anime to create a story with its own identity.",
      "date": "May 26, 2021",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "THIS SHOW IS SO GOOD. Easily my favorite show of all time, Season one is definitely the worst one, but that doesn't mean anything, still amazing.",
      "date": "May 23, 2021",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "It's everything you could want in a show.",
      "date": "May 9, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I love this show, it's in my opinion that this is thee single best animated series ever made or at least in the top 3. Book 1 Water is the weakest of the three seasons, but is by no means a bad season to the show just the weakest. The world and lore is absolutely fascinating, between the world building and characters this show is absolute gold! The only set back for this season was the the limitations to the animation due to the time it was released and because of the smaller budget season 1 had. Other than that it has great characters, action, lore, and symbolism, it's an important series for the history and future of animation.",
      "date": "May 7, 2021",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "the closest thing to perfection on this planet.",
      "date": "Apr 20, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The world building is great, cast nailed their roles.",
      "date": "Mar 17, 2021",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "May not be as fun as the rest of the show, but you do have a fun time. After watching book 1 water, I felt like having a drink because the title in it has water. Because that's what season 1 is called.",
      "date": "Mar 12, 2021",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "In my opinion, this was the worst season of a great show. However it's enjoyable in its own right.",
      "date": "Mar 7, 2021",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Personally, I felt that this show had a very basic plotline with very bland characters who have brief development throughout the series (other than Zuko of course).   However, Zuko's character development isn't enough to redeem this boringly long season with dragging episodes.",
      "date": "Mar 5, 2021",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "I don't want to spoil anything just watch it!\nI first watched it in my tweens it still holds up now in my adulthood.",
      "date": "Feb 6, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The best show of all time. Do yourself a favour and watch it.",
      "date": "Jan 31, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Another one of my childhood tv shows.",
      "date": "Jan 23, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Simply one of the best if not thee best animated works ive ever seen.",
      "date": "Jan 14, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Not as good as seasons 2 and 3 but a great start to one of my favorite shows!",
      "date": "Jan 13, 2021",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "BEST SHOW EVER! This is quite honestly one of the best crafted shows in existence. The characters are convincing, the struggle feels real, and Sokka is the best. Even without Toph in the group yet (another priceless character), the group still feels whole while also remaining open enough to allow additional members later. The villains are not cardboard and have layers along with all the other main characters. The humor is iconic. The writing was phenomenal. This is hands down my all time favorite show. :{)",
      "date": "Jan 13, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "There are some episodes that are filler and skippable.\nBut as a whole, pretty cool!!",
      "date": "Jan 6, 2021",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Whoever gave this show anything less than 5 stars has absolutely zero taste and their opinion should be automatically invalidated. This may be the greatest animated series of all time. Period. My only regret is that I discovered it relatively recently. People have been telling me for years how great this show is, and the show still surpassed every expectation. Plus, Dave Filoni was a key force in season 1!!! Of course he was. Best show ever!!!!!!!",
      "date": "Jan 1, 2021",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Though there may be a few iffy parts in the individual chapters here and there, I know no one who has a single bad reaction for this show. Great work, Nickelodeon, you did good.",
      "date": "Dec 16, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "AVATAR: THE LAST AIRBENDER is fun, cute and dynamic. The characters, story and action are all these things with an over-arching plot through the entire series. There's even quite a bit about friendship and the importance of responsibility.",
      "date": "Dec 9, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "A nostalgic favorite for me, and not surprisingly holds up incredibly well, this goes with all seasons.",
      "date": "Nov 29, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great introduction to the characters and their stories. The show slowly integrates more themes and plot points to become wonderfully integrated.",
      "date": "Nov 26, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Avatar Last Airbender is about a gary stu. It is pointless for him to master the four elements. In the  avatar state Aang can create a hurricane and wipe out the Fire Nation.",
      "date": "Nov 23, 2020",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "This has got to be one of the greatest shows I've seen as a long time. I remember watching it here and there as a young teen, but this series is so much greater re- watching it as an adult. \n\nIt's very rare when I find a show where I like nearly all of the characters, and every episode makes me see certain social issues in a whole new light or when a character has the ability to completely surprise me.\n\nThis is why Appa is the greatest character on the show - I'm kidding. It's definitely Zuko.",
      "date": "Nov 18, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Avatar Avatar Avatar. When I was a little kid I saw the series and I really liked it but 6 years passed and it was still in the media so I started to sit down and start watching the series and wow it is simply amazing it is for both kids and adults and teens. And you simply after the series want to be grounded or air or water and it's unbelievable everything I say is true for season 1 2 and 3 as well\n\n\n\nThis is amazing",
      "date": "Nov 16, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Fantastic on every level: The characters are well written, the action sequences look great, the worldbuilding is fresh and unique, and the musical score is fantastic! This is easily one of the greatest TV shows to have ever been created.",
      "date": "Nov 9, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Avatar: The Last Airbender Season 1 takes creativity to a whole new level, proving that anime can be extremely entertaining.",
      "date": "Nov 7, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Amazing in my top 3 favourite TV show! I love this!",
      "date": "Nov 6, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "timeless classic, season 1 was kinda slow but it gets better.",
      "date": "Oct 29, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Heck of a first season. What an amazing show. Definitely worth multiple re-watches.",
      "date": "Oct 27, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "A must watch for the entire family.",
      "date": "Oct 13, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "its great, its well written , great animation",
      "date": "Oct 13, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I am very sorry to not give this 5 stars, but this season just is not quite as good as the other two. Granted, it is amazing and I instantly fell in love with it. The fact that anybody compares seasons 1 and 4 of Korra to this is kind of ridiculous to me. Let's begin by getting the weak elements out of the way. First of all, the humor is at its weakest overall in this season. There are obviously plenty of funny moments, but I didn't laugh as much as in other seasons. Another thing is that Katara and Sokka are not really great in this season. Katara is sometimes irrational and even obnoxious and Sokka is not as good a comic relief or a character as in the later seasons. This season also has the weakest episode selection of the three. Episodes like Jet, The Waterbending Scroll, The Great Divide, and The Fortuneteller are some of my least favorites just to name a few. A few too many of these episodes are not much better than passable. That said, everything else is amazing. The Storm is my favorite episode of either Avatar show and many other episodes are great. The animation is beautiful, the emotional moments are strong, and the pacing is top notch. In Avatar, the characters have always been the most important aspect. Here, Aang is very well-developed and entertaining. However, it is Zuko and Iroh who carry this season. I think Zuko's character arc is the greatest in animation, and this season does a great job starting it. However, Iroh will always be my favorite character. He is funny, kind, wise, and just plain awesome. Iroh and Zuko have by far the best dynamic of any two characters in the show. When they are on the screen, you know things are good. Zhao is also a very human villain who never overstays his welcome. The action is well-choreographed and focuses on cool bending and fun slapstick over kicks and flips like in Korra. The worldbuilding is also excellent. Overall, this season is a funny, emotional, action-packed journey with memorable characters and magic that makes up for any minor flaw with these elements. This is simply amazing and must be watched. However, the other two books are definitely better.",
      "date": "Oct 4, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "i found this to be a solid first season.  you are introduced to many parts of the world and get to see all of the benders in action.  i found the episodic nature a little iffy, but it was still funny, charming, and awesome!",
      "date": "Sep 27, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "best ever!!!! you need to see",
      "date": "Sep 13, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I can see why this show have a lot of fans. It's a good cartoon series. I like the concept and the world-building of Avatar, they are very fascinating for me... And the characters are very interesting too! I hope to see character developments in the next two books!\n\nOverall, it's good but I hope book 2 will be a lot more exciting!",
      "date": "Sep 3, 2020",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Equal parts fun and complex, Avatar: The Last Airbender only needed a first season to prove that it is one of Nickelodeon's strongest properties. Its rich lore across Asian backgrounds will draw you in enough to get you through the filler episodes.",
      "date": "Sep 2, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Although it is the weakest season or book of the trilogy, Avatar spends its first season doing plenty of well crafted world building and lays its foundation for the future seasons to succeed. It also takes its time introducing lots of side characters while giving main characters dedicated episodes throughout making each character have depth though the main protagonist is arguably the weakest character throughout the run of the show. All and all this season would be impressive if the latter seasons weren't so much grander and epic.",
      "date": "Sep 1, 2020",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Beautiful animation, breathtaking visuals, delightful humor, likable and developed characters, and an engaging storyline, \"Avatar: the Last Airbender\" is probably one of the greatest shows (for kids and adults) of all time, this first season is a perfect introduction to the show, and a tease for things to come in the next two.",
      "date": "Aug 27, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The begging to one of the greatest animated shows to come out of Nickelodeon.",
      "date": "Aug 26, 2020",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "you watch it or the first time or 100th time it is the best",
      "date": "Aug 23, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "My favourite tv show of all times! A must-see for all ages. Everything about it is great! A true masterpiece!",
      "date": "Aug 18, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The story was good and I watched it like a hundref times now. And as I grew older the story became much more clearer for me to understand. I'm giving this 4 stars because overall, I don't like the characters' attitudes. In some, they're acting so childish when it comes to problems they have to face. Look, I know that they figure out themselves when they get into arguments and stuff, but mkst of the time they act as children fighting, doing whatever to take revenge and take advantage of bad things even if they're the good guys. And most of the time, Katara just busts out her deceased mother EVERY. DAMN. ARGUMENT. Whatever argument it is, it always comes with her mother even if the argument isn't about family issues. I mean it's hard to lose someone you love, but musn't she let go of thaf? \nAnd one more thing, in Book 3 Chapter   that they had a play about the main characters. The big question is how could the scriptwriter of some kind of a research team researched so much detail about their journey? Ain't got any ideas?",
      "date": "Aug 13, 2020",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "\"SIMPLEMENTE MARAVILLOSA\"\nFue difícil para mi explicar con palabras lo mucho que adoro esta serie, cada una de sus 3 partes es un agregado mas de su grandeza, hace años cuando era un niño la experimente por primera vez solo absorbiendo todo con los ojos de un niño que se dejaba a pantallar por cualquier cosa, pero hoy que le re visito, muchísimos años después, después de haber terminado, después de sus cómics, después de esa horrible pesadilla de pelicula y después de su continuación con Korra,puedo darme cuenta de la gran obra atemporal que es y el portento narrativo que tiene, ya de grande la vi con ojos diferentes y pude maravillarse otra vez y con mas intensidad, hay tantas cosas que quisiera comentar, pero a diferencia de otros reviews que he hecho no quiero que me gane el lengua técnico, porque solo quiero dejarme llevar por lo que volver a ver a Aang y compañía en su aventura me hizo sentir.\nEmpecemos por lo increíblemente original que en su esencia, la leyenda de Aang es, es increíble que una producción americana que simula y se inspira en el arte del anime de territorio asiático, no le pida absolutamente nada a esa corriente, ya que en todo el tiempo que he experimentado viendo animes, creo que me quedo con muchas cosas que he vivido en esta serie, quiero hablar ahora del villano en turno, el antagonista y verdadera leyenda, el príncipe Zuko, como describir a Zuko, el no es solo un villano en busca de poder, ni el príncipe que malhumorado que nos quieren presentar al principio, si no que de verdad es un alma afligida que con el paso del tiempo vemos sus motivos y su evolución como ninguna otra de la serie, al explorar a Zuko, vemos que no solo la guerra afecto al mundo fuera de la nación del fuego, sino , que a los mas allegados también y el con su tío Iroh tendrán de los momentos mas inspiradores y conmovedores de toda la serie.\nAang, Soka y Katara unidos por el destino, se irán descubriendo a ellos mismos, con sus propios motivos y razones tan reales que te quedas absorbido en la ola de drama que ellos tienen que presentar y junto con Appa, momo y la grandisima música de fondo volando hacia el horizonte te dejara hipnotizado y queriendo mas, es inútil como dije al principio tratar de explicar la grandeza de esta obra, solo experimentarla y saber que aun cuando todo parece que se desmorona, en el viaje con estos protagonistas sientes estar al lado de grandes amigos.",
      "date": "Aug 12, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This season was definitely more for kids, but as kids shows go it was one of the best I've ever seen. The development of plot and characters over time was impressive. I didn't really like the episodes with their side adventures, but it was still really good, especially near the end.",
      "date": "Jul 29, 2020",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "absolutely amazing character development and plot paceing absolutely one of my favourite shows of all time",
      "date": "Jul 28, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Absolutely Phenomenal Series",
      "date": "Jul 2, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "A masterpiece of the animation, the complete season works very well, the characters are so iconic also this season is a great introduction to the story and to the world of Avatar.",
      "date": "Jul 1, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "A beautiful masterpiece in the arts of cartoon shows. Avatar: The Last Airbender has memorable moments, lots of laugh-along humor, and plenty of great episodes that can pass the time if watched entirely. Trust me--you wouldn't want to miss an episode of this show.",
      "date": "Jun 25, 2020",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "This tv show had the best character development and amazing story line!!! they need to make more stories about the avatars and season 4 of Aang the avatar",
      "date": "Jun 22, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Absolutely AMAZING series! Exciting storyline and great character development based on a beautiful culture. ❤️",
      "date": "Jun 21, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I absolutely love this tv show, it's literally a part of my childhood. The characters and story line is fantastic and the comedy is great. Everyone should watch this fantastic show!!",
      "date": "Jun 18, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is one of my favorite cartoon ever. It's funny and action packed and it has so much suspense and cliffhangers. I've watched this series about five times already and its still entertaining.",
      "date": "Jun 17, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The whole family loves it.",
      "date": "Jun 16, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "one of the best shows of all time from start to finish amazing way to start the story incredible characters, interesting story, and amazing animation definitely a much watch for everyone",
      "date": "Jun 12, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Avatar is about a boy named Aang who is to bring balance to the world. Aang is the only one to contain all the four elements. Throughout all the seasons he is on an adventure with new friends and enemies to defeat the firelord who threatens the world with a huge war to become its ruler. My opinion about the avatar is that I really like it as it is one of my childhood movies. I would recommend it to anyone who loves animated series with an adventure with good cliffhangers and confusions that eventually will be solved near the end of the seasons.",
      "date": "Jun 12, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "People must see the first season of this revolutionary TV show. It is filled with amazing characters, wonderful action and incredible animation. Plus, it really did a good job introducing American kids to Asian and Inuit cultures.",
      "date": "Jun 12, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "what can be said this has character arc dept this tackles,  genocide. death  of parents empowerment this has it all and it inspires you and it not  for kids its for adult as well",
      "date": "Jun 8, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Where to even start. Excellent character development, mesmerizing action sequences, smooth pacing, and clean, expansive lore, this is textbook good storytelling. I'd watched a half a hundred YouTube essays on what makes this series so magical, and now I understand why. It's the convergence of joy, intelligence, and wonder that helps a piece of art transcend its medium. This series can speak to anyone without speaking over anyone.",
      "date": "Jun 8, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Best animated series ever created",
      "date": "Jun 5, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "A wonderful start to an amazing show. Aang is one of the best characters ever put on TV. This is also the best work of Nickelodeon, as they finally managed to make something exceptional. Besides SpongeBob. The storytelling was different but outstanding. The character designs are perfect for comedic effect, but they are also very distinct. The animation style is absolutely lovely. The different scores they use for characters are all amazing.",
      "date": "Jun 3, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "An excellent a show, it has a great story, i have seen the 3 seasons about 8 times.",
      "date": "May 30, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Every episode was super solid and entertaining. All characters are fully realized and have deep intriguing stories with flaws. A pot of the themes are quite mature, especially for a children's show.\nWorld building is done perfectly, character building was done perfectly, plot building was done perfectly.",
      "date": "May 30, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The world that they crafted is as deep as any show I've ever watched. This show maintains the same great level throughout, and somehow manages to get better and better until the end",
      "date": "May 28, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Such a good show. Fun, addicting, emotional and powerful in all kind of ways. Great first season witch showed us how the friends intertwined with the story.",
      "date": "May 28, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I rewatched this show that I remembered and loved from my childhood and found myself to be surprised by the amount of perfection this show has. Avatar: The Last Airbender has an incredible plot within all three of its seasons, beautifully played recursive themes, and perhaps the most perfectly executed examples of character development, especially through Zuko. Avatar is a series meant for all audiences.",
      "date": "May 27, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "An instant classic that will warm the hearts of children and grown-ups alike, its captivating narrative and unforgettable characters demand constant revisiting - and it never ceases to wonder.",
      "date": "May 25, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Avatar: The Last Airbender does what few children's shows have done before: deliver what was promised.",
      "date": "May 24, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Best show ever created as of yet",
      "date": "May 23, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Ever since Netflix brought back the show to stream, I had to relive my childhood. If you hadn't seen this show, please do so.",
      "date": "May 23, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Possibly one of the greatest animated shows of all time.",
      "date": "May 22, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Season one of Avatar: The Last Airbender brings an interesting fantasy to the table-and coupled with great character development, is an absolute 'Must See'.",
      "date": "May 21, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Still finding its voice, but S1 of Avatar benefits from great characters, animation, and excellent voice acting.",
      "date": "May 21, 2020",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show is incredible. Honestly, enough said",
      "date": "May 18, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It is my personal tradition to see this every single year, and it never ceases to amaze me. There's something new to unravel or details to notice and love. This show made me who I am, and I'm grateful i get to share this experience with youger generations in my family by introducing them to this masterpiece.",
      "date": "May 17, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I grew up watching this show. It is amazing, and the level of detail and thought put into everything, even the architecture and scripts, is amazing, and really contributes to the flawlessness of this show.",
      "date": "May 7, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "A \"heroes journey\" wrapped in a  \"good versus evil\" told as a \"coming of age\" tale. An incredible story for a children's show. The directing, humor, themes, characters, music, culture, all of it.",
      "date": "May 6, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Avatar the last airbender is one of the greatest tv shows ever, the season 1 is really good, the writing of all the characters are fenomenal, Aang is a super compeling character with a great backstory, and finally I wanna talk about my favorite character in the whole series; the prince Zuko, That is one of the reasons why I love this tv show so much because it takes its time to be with ou heroes and it takes its time to  be with the villans, I think my favorite episode in the first season is probably the blue spirit one because for one episode you think \"wow Maybe the villan and the hero can be friends, maybe they could work together\" another thing that I wanna to talk about is the animation, at the really begining of the show I thought that the animatoin was gonna be pretty basic, cut then the episode three hapenned and we watch the agni kai, there I realise that the animation was amazing, I will give Avatar: the last airbender season 1 a 9 out of 10 ( or a 8 out of 10 I don't know)",
      "date": "Apr 28, 2020",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "If you didn't enjoy this than you have no soul.",
      "date": "Apr 26, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is one of the best shows I have ever seen.  This show has great characters, great animatiion, great everything.",
      "date": "Apr 10, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This season begins a fantastic journey that will be appreciated for ages. The universal messages in this show apply to people from every walk of life and this is a show that anyone can appreciate.",
      "date": "Apr 2, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It is the best one of the nicktoons.....I can also say that it is better than the OPM and the DBZ series but it is not about the power levels...it is about the smartness and the bravery....it shows that having these two things, will make a huge difference from what you were before and after.....this is the life lesson too....",
      "date": "Mar 21, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Brilliant show with a brilliant soul. Magical and moving and lots of fun!",
      "date": "Mar 20, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "a magnificence remarkable  story telling and balanced as all things should be",
      "date": "Mar 14, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The shows premiere season meets all of the expectations and lives up to the hype with its animation, story, and characters.",
      "date": "Mar 13, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "on my fourth viewing and I doubt it will be my list viewing.",
      "date": "Feb 17, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Wow! An absolute masterpiece in story telling an animation!",
      "date": "Jan 22, 2020",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Beautiful and full of life. The cast of characters is incredibly likeable and the show's quality improves throughout the season. It seems to be the least memorable of the three seasons, however the other seasons set an extremely high standard to match. Well worth the watch and establishes the world very well. The finale is among the best episodes of Avatar, and is a sign of the quality to come in the later seasons.",
      "date": "Jan 10, 2020",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Amazing entrance to a journey",
      "date": "Dec 29, 2019",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Avatar: The Last Airbender is a TV series that I loved as a kid and continue to love as an adult. For me, that is a test that no other animated series has passed.",
      "date": "Dec 21, 2019",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "One of the few \"perfect\" shows. I'd even say one of the only shows without filler episodes. This is a must-see for anyone who hasn't seen it and is also the only 5 star I will ever give a TV show. The action, comedy, drama, and worldbuilding all balance perfectly and definitely deserves all the attention it can get.",
      "date": "Dec 4, 2019",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show start off very strong!  It presents a fantasy world for anyone to just get completely lost in.  Almost instantly you fall in lost with the characters.  This show is a most-see for any fans of the YA fantasy adventure genre!\n\nI love this series.  It is one of the best ever made.  The writing is incredible, being both episodic and part of a larger story.  The music is phenomenal and often brings goosebumps.  The animation really illustrates the choreography of the martial arts and different forms of \"bending\".\n\nAnd it only gets better from here!",
      "date": "Sep 9, 2019",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Amazing! Absolutely fantastic. One of the best shows I have ever seen. Funny, driven, and moving. An engaging story line and even better characters!!",
      "date": "Sep 6, 2019",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is by far the greatest show of all time. Flawless character arcs and captivating animations!",
      "date": "Aug 17, 2019",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The least good of the three seasons, which doesn't mean much for a perfect series.",
      "date": "Jul 22, 2019",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Obviously, Avatar The Last Airbender is a masterpiece through out the entire show, but Season 1 is a Introduction (quote from 24 Frames of Nick on YouTube).",
      "date": "Jul 19, 2019",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Just such a great show. I continue to keep watching the show even after watching the entire thing because it's just perfectly made. The fight scenes are always great, and some of the character arcs are fantastic. Not to mention how these animated characters feel like real people. Show interest in one another, trying to go through change and move on from certain things. I found myself teary eyed when it came to Ua's death and AANG STRAIGHT UP DYING IN SEASON TWO. And the ending of the entire show really has this powerful message as instead of killing the fire lord, Aang takes away his bending to ensure he can't hurt anyone else again. And while there are serious moments, there is plenty of space for funny moments (mostly from Sokka). This show is 20/5 and I very much recommend it.",
      "date": "Jul 15, 2019",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Deep and entertaining, Avatar, The Last Airbender's mature narrative proves and expands the boundaries of animated storytelling.",
      "date": "May 23, 2019",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I love the story line, animation, and how the characters change over time",
      "date": "May 12, 2019",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The finest series in the world. It deserves the 100% rating.",
      "date": "Apr 12, 2019",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Classic animated series that holds as one of the best ever produced, thanks to a superb vocal cast and rich storytelling.  The cast is top notch, with the main characters evolving richly over three seasons, along with some great guest voices, from Jason Isaacs to Mark Hamill.  Behind the camera, creators Michael Dante DiMartino and Bryan Konietzko craft a rich world and story, with wonderful nods to Chinese culture and martial arts (for example, each bending style is based on a real kung fu style).  While the story is a little cartoony at first, it soon evolves into a true epic of Aang fulfilling his destiny with the help of his friends, while other characters are at initially enemies go through unexpected paths (Prince Zuko's story arc is arguably just as important as Aang's).  Simple put, one of the finest cartoons ever made, and a must watch for anyone.",
      "date": "Mar 23, 2019",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Sure, it's a children's cartoon, but its solid mythology, universal themes and clever balance between humour and action should appeal to viewers of all ages - especially if they have patience, and respect the medium",
      "date": "Feb 16, 2019",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "The creators of this show have painstakingly built a world that, once invested in, you never want to leave. The setting is rich in lore and vast in scope - encompassing the length and breath of an entire fantasy world. The action blends martial arts and elemental magic seamlessly, while the morals incorporate also lessons of mindfulness and friendship. As for the story - time and time again I remember this show and a pang of sadness hits me as I am reminded of the journey that I took with Aang, Katara and Sokka, and how, by finishing the series, my time with them is at an end. \nWhen searching for new things to watch online, I often use phrases like 'animated series as good as avatar' - but as yet I've found none. This is my favourite TV series of all time, and I know there are many out there who agree with me!",
      "date": "Dec 23, 2018",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "it is a amazing show!!!!",
      "date": "Nov 11, 2018",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The big part in this book 1 is the introduction to Aang Katara and Sokka, the way DiMartino and Konietzko introduce them is fun and understandable at the same time. This makes a really good first impression to this movie. Till the finale, this is not disappointing and fun. I give 93% to this season, good job!",
      "date": "Oct 21, 2018",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The first chapter in one of the greatest TV show ever!",
      "date": "Oct 12, 2018",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Avatar takes you to a fabulous journey of self spiritual discovery, with a mix of adventure, witty comedy, extraordinary martial arts action and complex character developments. The series succeeds in getting you fully entangled in its drama, presenting you with an amazingly captivating plot.\nYou become an instant fan once you finish watching it!You become an instant fan once you finish watching it!",
      "date": "Sep 20, 2018",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "One of the best shows i ever watched. Still constantly re-watch them all thought out the years...^-^ Can't wait for the Netflix series to happen...Just hope it's not like live movie they made. lol",
      "date": "Sep 19, 2018",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The best animated series ever. Great pacing, great artwork, well timed humour and drama to keep everyone of all ages hooked. This is a must watch recommendation!",
      "date": "Sep 11, 2018",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The characters are great, the story is deep and is just great.",
      "date": "May 31, 2018",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The first season was quite boring, and I almost stopped watching it twice. Luckilly, I kept going, because the next two seasons are perfect.",
      "date": "Feb 23, 2018",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "While the weakest of the three seasons due to the time it takes to \"get the ball rolling\" per-say, this is still an amazing season that sets up so much lore, character traits, and breathtaking moments. An amazing setup for an amazing series.\n\nI love the characters they establish, I love the semi focus on the spirits in this season (no one forgets the visuals in that finale!). It's just so well crafted and clever and great.",
      "date": "Dec 26, 2017",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "very nice kickoff to a great show!!",
      "date": "Aug 25, 2017",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "The first season of Airbender successfully introduces us to a spectacular and fully realized world, full of interesting characters and narrative heft. If not for what comes after, Season 1 would gain the adulation it absolutely deserves.",
      "date": "Jul 18, 2017",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "The American television series that was commercially successful and acclaimed for its outstanding animation and plot. I've finally watched the whole thing from beginning to end and I can now say it's one of the best and most epic animated TV shows of all time. In a war-torn world of elemental magic, a young boy reawakens to undertake a dangerous mystic quest to fulfill his destiny as the Avatar, and bring peace to the world. Touching on mature themes like war, genocide and imperialism, it is also a series with a defined structure, full of compelling and well-developed characters and a funny sense of humor and good morals. Each episode is a great adventure in its own right, usually concluded with stunning action sequences!!",
      "date": "Jul 6, 2017",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "ATLA is what animated shows should aspire to be.  Possibly the greatest and most universal and relateable series I have ever seen.  I have watched this show time and time against and I can't say I am enjoying it any less.  If anything I am noticing new themes and underlying references than I did before.\n\nSeason one starts off slow and sets the scene for the greatness to come.",
      "date": "Mar 11, 2017",
      "rating": 5.0,
      "episode info": "Season 1"
    }
  ]
}