{
  "1923": [
    {
      "review": "While I agree with others that the treatment of the boarding school clergy and the Irish is cartoonishly evil - Sheridan's flair for the dramatic always has its mustache twirling bad guys.  He could dial it back a bit here though. The real stumble is how thin and stretched the story is.  I really felt the length of the second half of the season even if I enjoyed the acting and some of the period details.  This could be remedied with an impactful season 2.  Fingers crossed.",
      "date": "Apr 25, 2024",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "After watching Yellowstone and 1883 I was a little dissapointed with this series. Despite the briliant cast it just didn't feel like the storyline was going anywhere. However, the performances of Harrison Ford, Helen Mirren and Timothy Dalton still make this series very watchable. Just feels like the series lacked a proper ending.",
      "date": "Apr 2, 2024",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "The story moved slowly and I found myself fast forwarding through it.  The dialogue was ok, but much of it was reminiscing about older times and marveling about how things were changing.  None of this made the movie move along, though, so I found myself tuning out and hitting the FF button.  Some of the scenes were good (lions and hyenas) and some were simply contrived, like the overturned boat saga.  I am a huge fan of 1883, and I think that is one of the best depictions of the Oregon Trail ever done.  However, 1923 is not anywhere near that level of writing.  The season ended abruptly with no resolution (unless you count the killing of the nuns and priests - but even that story is unfinished).   Wait until season 2 to be released maybe, before starting season 1.",
      "date": "Mar 18, 2024",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "The residential school part was ridiculous and over the top, almost violence porn. Yes a lot of them were bad. But this borders on cartoonish supervillany. Too melodramatic. And “Canada was worse” apparently. Sounds like Sheridan got fooled by the “mass grave” fake news from 2020. Four years later not a single body found. The Irish/Scottish in general are either sadistic, inept, weak or criminal in his shows and its very one dimensional and predictable.",
      "date": "Mar 16, 2024",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Slow. I don't like how it bounces from 1 characters story to the next. Yellowstone better. If there is no S2, then this left us hanging.",
      "date": "Feb 17, 2024",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Another fantastic show from Sheridan, and I can't wait to see what the next season holds. Great acting, as expected, from a cast as stacked as this one.",
      "date": "Feb 10, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Epic historical drama that has been long missed.",
      "date": "Feb 9, 2024",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Everything is spot on in this series!  Taylor Sheridan is responsible for a lack of sleep, as I had to watch just one more episode.  I think there were parts towards the end involving Spencer that were a bit much.  But I cannot wait for the next season!",
      "date": "Jan 21, 2024",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "All the stories were brilliant and engaging.",
      "date": "Jan 10, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It was good until the last two episodes except the storyline about the indigenous girl running away from the priests that was really good throughout.\nThe love story with the couple from Africa was brutal in its over the top corniness and the actress while gorgeous was iritating.\nThe Yellowstone ranch story is also over the top sanctimonious entitled drivel.\nHow the \"critics\" could give this 90% is ridiculous.",
      "date": "Dec 19, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "1923 lacks the raw emotions of 1883 or the depth of Yellowstone. Having said that, its not bad. I have only seen season one, so the story line may not yet be developed. At the moment, the plot seems a bit obvious and somewhat heavy handed. As a bridge between 1883 and Yellowstone it may work",
      "date": "Dec 5, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "This lazy, meandering series presents too little each episode and stretches the story so thin that it is best watched with your finger on the fast forward button. I really wanted to enjoy this show, and it is possible that the second season will make it all worth it, but I have my doubts. They make a whole season out of what probably should have been covered in three episodes. It was like reading a novel by an author who is paid by the word.",
      "date": "Dec 2, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "🍀5.9/10\n\n\nReally great sets but really disappointing and feels like it takes too long and leads to nothing just for the lazy excuse for a season 2. Although it does contain great sequences, and really good acting it just misses the mark by an inch. It's also weird cause I find myself enjoying this more than 1883 but I get more annoyed with this so not to far off.\nGrade B-",
      "date": "Nov 17, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "Just awful, didn't finish watching.",
      "date": "Nov 12, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Really liked the acting and story lines in 1883. This one not so much even with the big names. The storyline with Spencer and Alex was very good. The violence was hard to watch. Also very confusing trying to understand who everyone was. I had to find the Dutton family tree online. Writer did a terrible job explaining who was who. Would have liked it if they covered all generations instead of skipping so far ahead. And how about concluding story lines? Worst ending!",
      "date": "Nov 6, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "If you liked 1883, you will love 1923. Only complaint is the season was too short at 8 episodes.",
      "date": "Nov 4, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I loved it. I think Taylor Sheridan hit it out of the ballpark once again. A lot of the low scoring reviewers seem to be hung up or put off by the extreme and uncomfortable violence in the plot line about Native American children forcibly sent to heinously abusive boarding schools to become \"Americanized.\" Yes, these scenes are heinously violent and highly unsettling to watch. They should be. And that is why we should watch them. They are a balanced and straightforward depiction of historical fact. Pick up a history book. Or better yet, read the first hand accounts by native Americans who were held there as children. As for the rest of the show… not uncomfortable or unsettling. Just a delight.",
      "date": "Oct 31, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "We just finished 1923 Season 1 -- very impressed.  The actor who plays Spencer Dutton could be the next Tom Sellick or Gerard Butler -- very commanding presence.  Every member of the cast seems right for their role, and the cinematography should earn an Emmy for sure.  Africa scenes were amazing, shot in three countries, but so was Bozeman Montana in 1923, and the killing fields of France in 1918. Unlike the stupid superhero movies, they are getting their money's worth on visual effects.",
      "date": "Oct 18, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I generally like the show, but Harrison Ford's acting just isn't doing it for me... It just feels like Harrison Ford reading the script. The overseas element during this time period is VERY fascinating. love the Safari in Africa scenes.",
      "date": "Oct 13, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "I am interested in what will happen in season 2.  I feel that it is a good setup for season 2.",
      "date": "Oct 9, 2023",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "The best of the Yellowstone series!",
      "date": "Oct 3, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Started so horribly violent in the first episode that I turned it off after the awful torture scene in the school with Teonna, the Nun and the priest.\nI decided to give it another go and am glad I did because overall the series is excellent. \nThere is definitely a number of scenes that are violent and horrible and not for the faint hearted but I did love the overall storyline. \nIt was a good pace and lots of exciting moments especially with the Spencer/Alex storyline.\nSo if you can make it past that awful scene in the first episode, the rest of the series is worth investing in.",
      "date": "Sep 29, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Most guys I know don't get into romance in movies. We tolerate it. Perhaps focusing on the attractiveness of the female participant, or simply fast-forwarding through the romance scenes. But the Spencer/Alex relationship is so fresh and believable that I got into it and it became the part I cared about the most. These two seem truly in love, and right for each other. The lengths they will go to be together ensures that another harrowing adventure is right around the corner.",
      "date": "Sep 7, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Way too violent. Just about every over the top. A very disappointing series not to be recommended to anyone",
      "date": "Sep 1, 2023",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "This is the first ever show I watched from the Yellowstone universe and honestly was just interested about how Harrison Ford is going to perform... he wasn't bad.\nBut these 8 episodes have been a little boring for me.\nWay less action than I expected but I also kinda liked the slowness and the calm sometimes.\nIn general pretty decent series, gonna watch season 2 definitly but overall this isn't a banger.",
      "date": "Aug 16, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is not the same stuff as 1883.  I guess as we get closer to the present the prequel series are going to get as lame as the main show.  Like many others, I was excited to see two big stars come onto this one, but they don't add anything special at all, like when you have a famous star do the voicework in an animated movie but their voice isn't distinctive so it could be anybody.  But Harrison and Helen can't be blamed to much, the writers didn't give them anything at all to work with.  The writing is totally lazy here and, as if by way of compensation, the violence is amped up to stomach-churning levels.  If we can't make you care about out characters with writing and acting, then lets kick their butts and brutalize them until we wake up your empathy.  But it doesn't quite work that way.  Also, the numerous villains are all stereotypical.  The actors playing them have a certain gravitas, but what they do is idiotic.  The first season dribbles away without much ever happening, apart from the endless sadistic brutality of priests, nuns, police, a shepherd and a miner.  None of whom have any inner life that can make you understand how they came to act the way they do.  It's just in the script for them to be brutes and so they are. Probably the outline for this series was about the same length as 1883 but they decided to pad it out to two seasons instead of telling the story succinctly in one limited series.  Might have been much better then.",
      "date": "Aug 14, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "This show is better than Yellowstone, most of the one stars are from delusional religious people who don't like the way the Catholic Church is portrayed in this show, even though it's totally accurate. The same people who are fine with violence can't handle a sex scene. 1923 is a masterpiece.",
      "date": "Aug 14, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Wow, did not see this one coming at all. Typically when a show takes off as \"Yellowstone did\", there are numerous attempts to recreate the magic an it seldom succeeds. This, however, does and does very well. The dual story line is very interesting, easily followed, and suprisingly action packed at times. Great job with this one and it might even convince me to try 1883.",
      "date": "Aug 8, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Boring. Full of clichés. Robert Redford's been the far better Great White Hunter. Why are the whores staying with that crazy man. Is Harrison Ford really such a bad actor? And isn't Taylor Sheridan completely overrated?",
      "date": "Aug 7, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "I love love love this show! I still don't see how the critics got it right but the users are wrong. So worth your time and doesn't get much better than this for entertainment! Can't wait for season 2!",
      "date": "Aug 6, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Terrible writing. Its pathetically shallow. Storyline is painfully predictable. And for the love of Pete whoever the accent coach is for the narrator has never spent a single day in the south...its horribly cheesy. This series is  a cheap combination of Legends of the fall, Out of Africa, Ghost in the Darkness, the beach scene is from Tom Cruise Knight and Day.  Writers are on strike at the moment but the studios don't want to pay....I wonder why? Taylor Sheridan should be embarrassed that his name is attached to this.",
      "date": "Aug 5, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Spoiled for me by the ludicrous approach to African wildlife. Perpetuates the myth that the wild is packed with creatures that can't wait to attack human beings. An elephant abruptly attacks a  parked car for no reason at all.Lions literally queue to climb a tree to eat people. The only answer is to keep shooting…",
      "date": "Jul 28, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "1883 was a great story. 1923 a couple of episodes in makes me feel like i am watching an amped up soap opera from the 80s. \n\nI would hate to be watching this as a family with children. Years ago you could only see sexual material like this in a dirty theater that most likely had very sticky chairs. \n\nSome of the main story was good. \nIt felt like the \"new\" star wars. Too much added & turned us off. Less is more, as in 1883. Don't know if we would watch if season 2 came out. Might have to wash my hair.",
      "date": "Jul 19, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Mr. Sheridan's rip into the Catholic faith can only be described as hateful.  Mistreatment of indigenous people by the government and the church could have been a credible story line, but it went WAY too far.   \n\nInterestingly, in \"Tulsa king\", another Sheridan show, Catholic images are prevalent in the background during a heinous murder scene for no discernable reason.  But for this obvious smear campaign, I might have stuck it out hoping the writing got better.  Given the not at all subtle church bashing, I'm not giving the show another chance.  \n\nWatch 1883.  Watch the first 4 seasons of Yellowstone.  Then do yourself a favor. Just stop.",
      "date": "Jul 17, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Terrible storyline - uneven pacing with nonsensical plot twists and soppy rance. If you enjoyed 1883 don't expect anywhere near the same level of story or continuity. Half the story lines are just filled with over the top torture scenes to boot. Give it a miss.",
      "date": "Jul 15, 2023",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "Another hit by Taylor Sheridan. The cast were picked terrificly especially Harrison Ford, Helen Mirren, and the actor who played Spencer. I can't wait to see more. Many twists and turns that I did not expect.",
      "date": "Jul 9, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Solid acting, solid writing, solid plot, solid action and solid directing this is a must see!",
      "date": "Jul 5, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Loved it . Absolutely stunning cinematic experience. The cast is perfect. Timothy Dalton as a villain is next level. Spencer dutton and how they made the tension  of him coming back all while learning about him and Alex. Myself and all my friends love this series the most. It's awesome. Can't wait for season 2 !",
      "date": "Jul 4, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It was the most terrible series and had nothing to do with Montana,Yellowstone or ranching. It was more about lion hunting in Africa and priests in Montana, who BTW were awful to the Native Americans. Also didn't even end in a conclusion. Don't bother watching.",
      "date": "Jul 3, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "I had great expectation, being an absolute fan of Yellowstone, and the casting being what it is, plus I thought the story more compelling than 1883 which, to the contrary of 1923, was very well played by all characters, from the well known to the more obscure.\nAlas, and despite the ever great acting skills of Dame Helen Mirren, this show is a fluke, Harrisson Ford is playing little time as an alibi, and is showing his old age.\nIt looks like he (Ford) doesn't know when it's time to quit, I mean as an action movie or TV show characters which in my opinion was in 2017, just after the sequel of one of the greatest ever movie, Blade Runner 2049.\nNo wonder I won't even bother watching the last Indiana Jones installment, and I don't only mean theatrically, but even for free on TV streaming, so much this movie isn't appealing at all.\nOn the other hand, for now Sylvester Stallone   at 76, is still doing the Job in Tulsa King, another great show from Taylor Sheridan…hopefully he will know better to quit this kind of part by the time he reaches 80…we'll see.",
      "date": "Jul 1, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "There is so much cheap opera in it, and decisive motives from modern politics. In 1923 all the world was cruel, not just Catholic nuns and priest, or interracial mixings discriminating laws. So much fueling hate elements. \nAt the same time, the movie line that stays on Yellowstone farm, that's still golden.",
      "date": "Jun 24, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "I stumbled across this show, just looking for something randomly to watch. The first episode did not really catch my attention. Several weeks later I picked it up again and around the second episode I really started to enjoy the show. There is some thing very sweet and powerful about the relationship. Harrison Ford plays with his wife in the movie. I enjoyed some of the dialogue about aging, etc. as well as the interaction between the two of them.",
      "date": "Jun 5, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Very enjoyable and well worth watching, good story and good acting",
      "date": "May 28, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Still a fan of Taylor Sheridan's storytelling... started 1923 and kept wanting to immediately continue to the next episode.  Harrison Ford & Helen Mirren's portrayals pulled me in. The history of the Dutton family remains compelling. The Indian boarding school scenes are compelling and emotionally taxing to watch. Enjoyed the themes of family, love, & the land. How power so easily corrupts absolutely.. power of government, institutions & individuals. \nLooking forward to season 2.",
      "date": "May 25, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great cinema, production level is a 10.  Acting is excellent story interesting, believable and coherent. I can't wait for season two.",
      "date": "May 19, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The focus on Africa was just boring and pointless.",
      "date": "May 17, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "At first, I was excited to see what had happened to the Duttons from 1883 (loved it) to this next chapter, 1923.  Still can't quite figure out the family tree here.  I must have missed something in the narrative at the beginning. Started out strong with great performances by all the cast.  By the third episode, I was beginning to rethink everything.  By the time we watched the fourth, fifth and remaining episodes I was sick of Spenser's \"look\" (wounded), Alexandra's non-stop talking (which we couldn't understand) and the endless sexual/soft porn scenes - I'm thinking \"doesn't she have any other clothes\" plus the endless \"trouble\" they in which they found themselves.  One scene (on the ship) and I thought \"shades of the Titanic\"!  Let's then throw in a bunch of S & M stuff with two prostitutes (who could've left that damn house), a greedy land grabber and a huge dose of \"racism\" where the foreman's wife is brutally taken from her family and a \"deputy\" calls her kids \"mongrols\".   The only believable scenes were the ones from the \"Indian Training Schools\" with Teonna and what she and Joe endured.  That I believe.  Would I recommend this series to people?  Maybe.  People have to watch it for themselves.  These words are my opinion.   The other issue I have is where this house is located:  on top of a hill with no outdoor signs of a privy, no landscaping, where are the barns/horses/equipment located?  Sorry, but wouldn't watch again.",
      "date": "May 16, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "Taylor Sheridan delivers again, picking a monumental period in history. This entire season is set in an amazing era when the ancient world fell away and the roller coaster ride toward modernity began. We can see the seeds of the world today being sown, and of course, the writers take pains to inject wisdom and warnings about the state of affairs today, especially freedom of thought, speech and the pursuit of happiness. The Dutton family is aptly tough as nails, a clear carry over from the struggles of 1883 and carry forward to the ongoing saga of Yellowstone.  \nSalute to Taylor's courage to explore the painful history of North America after the physical genocide of natives, namely their cultural genocide through church schools, associated humiliation, and many unmarked graves. This issue has barely been addressed in popular media. More historical wrongs are unearthed every year, so this issue needs to be highlighted and reconciled. \nThe Kenya storyline is sweeping and romantic, taking me back to the glory of Out of Africa. Having spent my childhood there, I was enamoured by the accuracy and authenticity of the storyline. The great pains taken to reproduce Africa of the period were truly impressive. The romance between Spencer and Alexandra is for ages and makes one feel alive, and immersed in destiny. \nThe calibre of the acting is just top class, especially from Ford, Mirren and Dalton. What gravitas and finesse. It is clear this tale is a multi-season arc of survival and greed, of revenge and ambition. Can't wait to see it unfold.",
      "date": "May 11, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "OMG. Loved Yellowstone. Enjoyed 1883. 1923 dives to depths of badly written and acted rubbish. I'm sorry... this is awful :-)",
      "date": "May 9, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Harrison Ford came to prominence in a space western. If he retires on this US western I'd say the man has picked great material to lend his skills to.",
      "date": "May 8, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Altho Mirren is one of my favorite actresses of all time, I couldn't get thru the first episode. I guess I was spoiled by Yellowstone, but I'm not a Western movie or show fan. Period pieces are hard to make, of which movies like Tombstone are fun, but this one isn't animated or interesting to watch, even with lead characters like Mirren or Ford.",
      "date": "May 7, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Actors are awesome, specifically main ones. Love the dramatic storyline of the safari journey home.",
      "date": "May 7, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I had to skip through a lot of the conversations especially the romantics ones that go nowhere, there's so many couples and they talk A LOT.",
      "date": "May 6, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "Pretty good, its not 1883 but still good.",
      "date": "May 2, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "This series goes hand to hand with 1883. Good story, wonderful characters with depth. Slow pace and beautiful cinematography. Ford and Mirren played very well. The only nitpick I could find is that they depicted all nuns and priest like beasts. Not a single true christian among them, not a single soul with compassion, unebelivable.",
      "date": "Apr 29, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Loved this series. 1923 is brilliant TV. Nobody except Taylor Sheridan created epic, TV series with outstanding cast, cinematography and writing. The best series I have watched in years.",
      "date": "Apr 23, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Ok wow… i have had the privilege of watching Yellow Stone, 1883 and now 1923 and I have to say 1923 is the most captivating of the 3 series.  The acting is somewhat more raw and authentic, not sure how to describe the differences, but to say       the performances allow you to set apart their star factor from the character.  I have such a challenging time with movies now because its a block buster star in one movie after another.  Producers, writers… for the love of god, always cast new, unknown talent alongside one or two veteran actors max… more exciting for the audience",
      "date": "Apr 23, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The story isn't very compelling and is mostly scenes of violence strung together by contrived and predictable plot devices. Harrison Ford seems to be sleepwalking. And all that stuff with Spenser and his wildcat stereotyped girlfriend beggar belief. I found the prequel \"1883\" much better, supported mainly by Sam Elliott doing his wonderful crusty cowboy thing. Whether it's cowboy movies or superhero stuff, the story always follows the same line .... good guys living fine, bad guy or evil organization coming in to spoil it all, good guys rally around the flag, blah, blah blah. There really is nothing new under the Hollywood sun. Time to give it up Taylor.",
      "date": "Apr 22, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "I really wanted to love this as much as Yellowstone, but it is so depressing to watch. Cara and Jacob and the rest of the Dutton family are enjoyable to watch, but that's where it ends. The bizarre scenes of S/M beating prostitutes and non stop abuse of Indians consumes the episodes and leads me to turn it off and watch something more enjoyable.",
      "date": "Apr 21, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "It hasn't lived up to the standard of it's predecessors. The only enjoyable threads are the ones where the Yellowstone is directly involved. The entire Africa/ocean/journey thing and all of the Native American stuff may as well have each been their own different shows for all the usefulness of them. I get that the filmmakers wanted to drive home the terrible ways America treated NA in those days, and I get that some so-called christians also were terrible. The goal of fairly presenting these realities was deeply subverted through the decision to attack the audience with wildly excessive depictions of this abuse. \n\nWould it have really been too much to give the good, decent, honest, loving Christians who lived in those times just a few minutes of screentime? The ones that far out-numbered the vile racist and abusive ones? Would it have betrayed some political objective to give a few minutes time to show the people who treated the NA's with respect as equals? Instead, we were practically waterboarded with the message \"white christians are the worst humans on Earth\" over several episodes. It robbed much of the enjoyment for the show until I started skipping past those scenes entirely.\n\nAll in all, a lackluster effort.",
      "date": "Apr 18, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "This show had its moments but was spoilt by the unnecessary violence of the Indian/church and prostitute scenes which seemed totally unrelated to the main plot.",
      "date": "Apr 17, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "A must see. The Writing, Story line and Acting is wonderful. The History to the present day Yellowstone exceeds our expectation.",
      "date": "Apr 17, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Much better than the last couple seasons of Yellowstone. Starts slow, but rewards you for sticking with it, and by episode 4 the story and characters really start to flourish. Some scenes are boring, and some are straight hard to watch, but give it a chance and it'll pay off in the end.",
      "date": "Apr 15, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Some good storylines and acting overall but the scenes involving the nuns, priests and prostitutes were vile and unwatchable.",
      "date": "Apr 12, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Don't care for most of it. Can't see the point of the whole church vs Natives or the  Dutton switch from being ruthless to law abiding.",
      "date": "Apr 5, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Mostly pretty good but let down by Lady Alexandra's appalling attempt at an English upper class accent and whatever accent Brian Konowall's character was supposed to be.",
      "date": "Apr 2, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Action, Romance, Drama, and great Acting, what else can you ask for? I cant wait until season 2.",
      "date": "Mar 31, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "One of the very best shows on Paramount+.",
      "date": "Mar 31, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Superb first season that establishes a new generation of the Dutton clan, this time in 1923.  The series is anchored by the great Harrison Ford & Helen Mirren, the current heads of the Duttons who are adjusting to life as the Old West dies to give way for the modern age.  Behind the camera, Taylor Sheridan crafts another superb Western series, exploring a much bigger world, not just the plains of Montana, but the Indian reeducation program and African safaris.  All in all, a fantastic series that continues to expand the legacy of Yellowstone.",
      "date": "Mar 28, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "On a good note:\nSpencer's story and the African filming was great. MT scenery was gorgeous. \nHelen Mirren did a wonderful job.\n\nThe Teonna storyline was awful! The detailed torture and abuse was far too much for me and not necessary to make a point. \n\nI live in MT and have forcthe last 20 years. The BS of this show and Yellowstone is SO FAR from the way it is here.",
      "date": "Mar 26, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Pretty awful when Helen Mirren and Harrison Ford weren't in the scene.\n\nLow grade soap opera filled with cheap one-dimensional stereotypes, tropes, and cliches.\n\n3 different story-lines barely related to one another.  And some truly awful acting, although one can hardly blame some of them given the dialogue they were handed.\n\nToo bad.  I really wanted to like it, and I tried.  But it just got worse and worse as it went on.\n\nVery bad.",
      "date": "Mar 25, 2023",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "I took out a Paramount+ subscription just to see this and I wasn't disappointed. 1923  is as good as Yellowstone and I found it much more enthralling than 1888. Loved the posh English girl and the hunter guy storyline. Very enjoyable TV.",
      "date": "Mar 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Three great storylines, adventure, passion and survival makes for another first class TV series from Paramount+. Sheridan certainly knows the magic ingredients to entertain the vast majority. Great job Paramount, lets continue to see more like this.",
      "date": "Mar 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "So slow!!! A promising start slows to less than a crawl after just a few episodes. Many scenes that seem to be just throw away scenes with no point in the overall story. Spencer coming to America seems to be taking longer than the actual trip would on 1923.",
      "date": "Mar 20, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "A fan of Yellowstone (so far) and 1883, I was really disappointed in 1923.  I was expecting more in depth on the Dutton family and ranch, but was thrown off by the LONG side trips into  ugly sexual deviancy and violent bigotry that he (or the producers) thought needed to be shoved down our throats (\"take that, you stupid audience!!).  Sheridan should know that often times, less is more. Perhaps, it spoke more of themselves and what they like to see.  I liked the story line of Spencer and Alex, but again, the slow pace of each story line caused a loss of impact.  I am about to watch the most recent season of Yellowstone and worry it will be more of the same.",
      "date": "Mar 19, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "I think I like 1883 characters there more endearing but 1923 feels like it has a better and more intriguing plot but where it mostly falls flat is feeling uncomplete and feels like just kind of a sample of what you will get later cool shoot outs but it doesn't feel like there's a whole lot to say about this 5/10",
      "date": "Mar 16, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "Well acted, beautiful cinematography, three complex stories that are due to come together hopefully in season 2.\nSlow burner but I was fully invested.",
      "date": "Mar 16, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Loved the 3 different story lines! Portrays realistically the abuse suffered by Native Americans in \"Indian schools\", the lawless, brutal battling and conniving for control of the West between Ranchers, Sheep Herders, and Miners. Visually very colorful especially the lush landscapes in Africa.  Plenty of romance, tragedy  and action with  plot twists galore. A bit over done but good acting makes up for it. My favorite of the 3 series.",
      "date": "Mar 15, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "painfully slow and didn't resolve ANYTHING at the end.  Prostitute scenes were meaningless to plot and characters and it's a trope everyone is tired of seeing.  1883 was ten times better as a prequel/yellowstone story even though it was also slow and dark at times.",
      "date": "Mar 14, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "What is the purpose???\nMisery upon misery and no respite.\nWell acted with great cinematography  and stunning vistas but a truly bleak story and not worth the investment of time and energy.",
      "date": "Mar 13, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I love Yellowstone so was prepared to lap this up. I like Taylor Sheridan's work on King of Tulsa too so was expecting to love this. Only watched one so far and the story is okay, and its good to have the backstory for Yellowstone, but Helen, oh Helen, I have so much respect for you, but why that awful Irish accent? My Irish friends and myself were cringing. We talked about Dick Van Dyke in Mary Poppins as a cockney.",
      "date": "Mar 12, 2023",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "I am in LOVE with Spencer and his firebrand wife! What a season ending! Will definitely watching the next season of 1923! Taylor Sheridan is a gold nugget! Say goodbye to old Hollywood 😢  and hello to the most awesome creator, director, actor out there! Is there anything or show he cannot write, act, or create?! Umm no! \nThe main character like Helen Mirren, Harrison Ford are total \npackages! I also LOVED 188! Brutal honesty to Truth of how it really was in 1800s America.\nBut yet I loved Elsa! I wish you could have survived! That was a tear jerking ending! I so wanted her to survive and go back to her native American love!❤️ They were beautiful together! Could you imagine how beautiful they're baby would have been, IF she made it? I love these prequel series to Yellowstone, my FAVORITE show! Thank you Taylor Sheridan for your gift, your artistry and your magical way of weaving a ribbon through time to bring us the back story of the Duttons & the Rain Waters familys!",
      "date": "Mar 12, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Strong acting and gorgeous cinematography are the saving graces for watching this series. Don't bother looking for a cohesive story line, even though there are 3 of them.  ( Tip: watch Out of Africa if you want a truly romantic colonists on safari story).There is frustrating lack of connection between these different narratives, which are  driven by epic scenery mixed with gratuitous human degradation and violence. We all know the American West was brutal, but a posse of killer priests? There is more to the human experience than guns and sex, even in 1923 Montana.",
      "date": "Mar 10, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is one of the best shows on TV. right now. After 1883, this one is a worthy continuation of this family saga. Acting, filming, and directing are just fantastic. Television entertainment simply can't be better than this show. I am so glad they renewed this for the second season.",
      "date": "Mar 9, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "So good. 1923 is like a fine wine. If you sip it slowly, rather than binge watch and gulp it down, you will relish how exceptional it truly is.\n\nThe posh english woman in particular was simply divine. Perfect casting.\n\nLoved the show. Can't wait for what Sheridan brings us next.",
      "date": "Mar 9, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Simply superb!!!!! So much more interesting and sexy than the bland 1883. No doubt Taylor Sheridan is the only reason people are taking out Paramount+ subscriptions. With more like this Paramount will do fine. If Disney are looking for the next Indiana Jones it looks like Taylor just found him. Fabulous!!!",
      "date": "Mar 9, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I'm dropping Paramount.  trying to watch shows that go nowhere for one season is just a waste of my time.  I think the story is good but I think the amount of time it's taken to get people from across the world back to the main story is ridiculous.  I think they should have done 10 episodes this season and they stopped at 8.  Is this based on laziness, money I don't know but it's absolute bullshit. Seems like the streamers want to hook you in for money as long as they can and so they do weird shit with the scheduling.  This has influenced my decision to not continue to purchase Paramount. I would also say that trying to figure out how to watch this show and watch Yellowstone is just too hard. \n fucking pick a streaming service and fucking use one.",
      "date": "Mar 8, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "Loved 1883 and the Yellowstone.  Love parts of the story of 1923, other parts are salacious and ruin the rest of the story!",
      "date": "Mar 7, 2023",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "Critics have given 1923 and Sheridan high praise for taking on big issues like the Indian schools and how cattle ranchers abused the sheep herders. I do not give such high praise to the overly dramatic dialog, direction and acting in a lot of the scenes. Basically this is the same story line as Yellowstone. The violence is as cartoonish as Yellowstone season 3 and 4. There is not much new here. Sheridan seems to be riding one truck pony.",
      "date": "Mar 6, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "Started out great. Then nothing but filler for the last 4 or 5 episodes... Way to slow. Making this slow moving show after 1883 is insane.",
      "date": "Mar 6, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Casting, directing, and producing was great. The story is just moving to damn slow.",
      "date": "Mar 6, 2023",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "Well done, its got everything great about this time period. I like how the show has challenged historical perspectives while setting the narrative for Yellowstone. I am looking forward to the next season.",
      "date": "Mar 5, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I absolutely find the scenes with the prostitutes disgusting and unnecessary. My family, me, my husband, my 18 year old son and my 16 year old daughter watch this. Do you understand what discomfort it brings to have such filth come in to the room with my children watching. I know of other families who feel the same with their kids. We fast forward through it but that makes her show shorter for us and makes it undesirable to watch. Shame on you",
      "date": "Mar 5, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "I can't quite decide whether to like this series or not. The ingredients are there, and the star power is there, yet something is missing. Perhaps the slowness of it all, perhaps the emphasis on secondary characters and not enough, for example, about the story of Teonna Rainwater are at fault. That said, newcomer Julia Schlaepfer (Alexandra) is a delight - but something has to be done about Jerome Flynn's pseudo-Irish accent.",
      "date": "Mar 4, 2023",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "Started good, decent characters and story, then the second half of the season went nowhere only to leave every character and every scenario in the worst place possible",
      "date": "Mar 3, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "Riveting! I enjoy each episode and appreciate the accuracy of how the Native Americans were treated.  Helen Mirren and Harrison Ford are brilliant together.",
      "date": "Mar 3, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Reminded me of Handmaid's Tale, which felt slanted.",
      "date": "Mar 2, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "One of the slowest series I've watched. 8 episodes through and nothing happened. Terrible writing with a solid cast. Probably deserves 1 star for the writing and the cast makes up and gives it a second star.  Stop milking the Yellowstone series if you're not going to write anything worthwhile.",
      "date": "Mar 2, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Loved 1883!  And 1923 - love the characters, love the story line, love the scenery. Having been on African safaris 7 times, I found it so disturbing to watch elephants, lions, etc be shot.  Stopped watching mid Episode 3.",
      "date": "Mar 2, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Disappointing.  1923 comes no where near the standards that 1883 set.  I can appreciate some degree of romantic relationships, but the excessive nude scenes and the brutality of other scenes is excessive and gratuitous. Does not reach the high plateaus of excellence of either \"Mayor of Kingstown\" or \"Yellowstone\". Sometimes, while watching, I questioned who wrote various scenes. Sure does not seem like Mr. Sheridan.",
      "date": "Mar 1, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Awesome! It is my favorite show.",
      "date": "Mar 1, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I see to much sufers for chields and old people is too bizarre the idea is poor is imcomplete and, irialist to many bad people is no provocate in the spector  wating for the next season for mi is enougth i tink the 2 season is more the same more bad people wing and make more bad thinks to chield and old persons and more bizarre stuff. you lost the idea the yellowstons is.",
      "date": "Mar 1, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "The sequence on board the British Ship in episode 8 was the most unbelievable rubbish I have seen in a long time,",
      "date": "Feb 28, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "omg...like watching bits of three different stories each time.  tedious, bad writing, sadly slow, sterotypes, tropes galore.  eight episodes with three storylines broken into two four episode parts??? \n\nthe first two episodes bearable, but by the third, the broken up, sad stall in storytelling was obvious.   do better.",
      "date": "Feb 28, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Horrible. Such a disappointment after Yellowstone and 1883. Sheridan is totally out of his league.",
      "date": "Feb 28, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "The story was great, but the slow pacing of Spencer's return, and the Dutton ranch just holding out till he gets there was painful.",
      "date": "Feb 28, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "What a dissappointment. If I'd wanted to watch a show about a great white hunter and his improbable English bride, I could watch the Hallmark channel.  The side story about the indiginous girl abused by the nuns and priest was well done and written in a style I expect from Taylor Sheridan. However, stay off the ocean and stick to horses because the survival of the sinking of the tug was stupid.\nI can't fault the acting, Helen Mirren is surperb even when given a less than starring role. However that doesn't make up for the dragged out plot. Either get the \"hero\" to Montana in the first episode of Season 2 or I'm out.",
      "date": "Feb 27, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Started off promising then became unbelievable. I lost interest completely by the end. So many stereotypes it was farcical.",
      "date": "Feb 27, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I'm torn. I loved this series at its start. Mirren and Ford are amazing. Their scenes are compelling and I love the storyline. The story of Spencer and Alex is very dramatized, but I love it and enjoy it whenever they are on the screen. The storyline of Teonna Rainwater is difficult to watch, but it absolutely shares insight and truth about the harsh history of the time period. I am excited to see where her character goes in the future! The only story that seemed to leave us with a little hope in the last episode. The last two episodes' pacing was rough. Not satisfying to watch. Very depressing. I felt the hooker scenes wasted valuable storytelling time. It could have been shown briefly, but why dwell so long there? And then show what was basically the same exact scene as the penultimate again in the final episode. It was very annoying and poor storytelling in my opinion of Donald's character. It made me dislike the entire episode. Trying a little too hard to be like the early seasons of Game of Thrones here. I just don't want this in my Westerns. I would like to recommend this show to family and friends, but the sadism in it genuinely makes me a little embarrassed to recommend it. We can show it briefly, but why dwell? What's the point? I preferred the pacing of 1883 much more, and that it was a cleaner show to watch.",
      "date": "Feb 27, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "I enjoyed it with the huge exception of Alexandra's excrutiating, toe-curling attempt at the British accent and manners of the time.  Makes me flinch, especially (but not just) when the accent wanders off into something Northern European on the vowels. Odd because American actors normally do British well.",
      "date": "Feb 27, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "It's great.  It's a very character driven series, which is exactly what most modern programming is missing.",
      "date": "Feb 27, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "so much better than 1983, 3 great story lines, ford and mirren make it a must watch series and can't wait to see how all 3 lines tie into yellowstone.",
      "date": "Feb 27, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It doesn't have the same excitement as Yellowstone. It's more like Mills and Boon novels brought to the screen.",
      "date": "Feb 27, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "A banal, unrealistic, and simplistic script, with gratuitous nudity and sexual perversion scenes liberally thrown in to revitalise a lacklustre effort by the director. All of it destroys most of the realism, romance, and passion of the cattle ranching equity built by \"Yellowstone\" and even \"1883\". \nBut it's not just the script that lets it down, the production's ‘mise-en-scène' also leaves a lot to be desired, failing to replicate the realism required of a period piece. \nA huge disappointment.",
      "date": "Feb 27, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Slow start but it's getting really good.",
      "date": "Feb 27, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The show started off with a lot of promise.  Some parts were very good but during the entire season, the story just kept dragging out.  It's as if they wanted a second season, so they added a lot of useless, unnecessary and disgusting B.S. Some parts should've been x-rated.  It would be nice if these writers would leave a few things to the imagination.  Rather than focusing on the Duttons in Montana, and what life was like there,  the story continues to go off in different directions.  Another spinoff could be made possible based solely on Alex and Spencer. All three shows are lacking. Starting with Yellowstone, they never answered the question about the  skull, which was found on their property by the excavators two seasons ago. Elsa supposedly died in 1883, and now they have her narrating 1923. Since Elsa was married to an Indian, I expected to see more on how the Duttons were related to the Indian tribe and specifically if there would be some ties to Teonna Rainwater. All three shows have been a bit disappointing but 1923 has been the worst yet. I think Mr. Sheridan needs to focus on doing one show really well instead of trying to produce so many at once.  I would not pay to watch his shows again and I would not recommend 1923 to anyone.",
      "date": "Feb 27, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I have enjoyed several storylines of this show but the last 2 episodes of the season were too much for me. Taylor Sheridan loves gratuitous violence and seeing women raped and brutally beaten repeatedly. I've decided he's a perverted freak who likes to live out his sick fantasies through his shows.",
      "date": "Feb 27, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Probably the slowest series I've ever watched. It had none of the things that make Yellowstone and 1883 so great. At this rate. It will take 5 seasons to get to any type of conclusion. The ending was terrible.  I think Taylor has just been stretched too thin. I certainly hope Yellowstone doesn't start sucking this bad.",
      "date": "Feb 27, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "Pacing was just way too slow. Unnecessary scenes given too much time whilst interesting characters were left undeveloped. Odd place for the series to end, sort stacked a bunch of cliffhangers. I watched the entire series, thus the 2 stars, but Overall was left unsatisfied and disappointed.",
      "date": "Feb 27, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "We somewhat enjoyed the first half of the season; we thought the last half was slow, desperate and completely underwhelming.  In fact, the last couple of episodes got so raunchy with the prostitutes, along with neglecting to move the story along at all, it wasn't even entertaining. (And what was with Zane's family all the sudden being yet another storyline?  That seemed random and amateur.)  The whole season went almost nowhere and ended so lacking of actual writing that they had to throw in smut to fill the time.  I don't have the heart to give a series that Helen Mirren is in an actual \"F\", so 1923 gets a \"D- -\". (That's a \"D minus minus\". That means, it's REALLY BAD).",
      "date": "Feb 27, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Great cast, beautiful scenery, and sluggish pacing, coupled with plenty of sadistic violence and a couple of \"junk the shark\" moments in the final episode make this a watchable, but disappointing sequel to the Yellowstone saga.  1883 was far, far better.",
      "date": "Feb 27, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "Love the cast and the setting.  This really felt like a non-existent story.   At the end of the first season, it felt as if nothing had actually happened, other than introducing all of these people.    Did it really need to be 8 episodes of introductions??  and it certainly didn't need to be 2 seasons.  1883 was better, and at least it got to the point.",
      "date": "Feb 26, 2023",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "They did a great job with this show. I hope they are able to make a few more seasons.",
      "date": "Feb 26, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Taylor Sheridan wrote another incredible show.  The acting, directing, and action are above par in each episode.",
      "date": "Feb 25, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great follow-up to 1883, minus the gloriously beautiful nature. Elsa smiling, dancing, riding or swimming into each and every sunset was a glory that's missing in this show.",
      "date": "Feb 25, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "There are some interesting elements of the show BUT, it seems some scenes are being stretched a little to far, almost as if they are trying to just fill the hour.",
      "date": "Feb 24, 2023",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "I love Ford and Mirren, but I couldn't get through the first episode. Bad writing. Only serviceable acting. Couldn't hold a candle to the superb 1883. Moving on. Sad.",
      "date": "Feb 23, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Has so much potential.  Episode 3 was good. Also, typical Hollywood attack on Christians was lame. Yes, we know their were plenty of Catholic, religious hellholes like that, just is a theme in most shows on every streaming service. \n\nI am interested to see where it goes but only because I literally have nothing better to watch and love Harrison Ford.\n\nUgh, next.",
      "date": "Feb 23, 2023",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "So disgusted with the last episode. Love the storyline and cast. Harrison Ford and Helen Mirren are great. I'm no prude but why the F bomb so much? I don't think I'll continue watching this show. My husband and I love a good western but some of the content is just to much for us",
      "date": "Feb 21, 2023",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "The main plot is too slow. There are three separate stories in each episode. Be cause of this I feel like none of the story lines are moving fast enough. It's the same thing every single episode with each story line. Get on with it already.",
      "date": "Feb 21, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "Definitely the weakest series of the the 3 by far. \n\nThe plot moves at a snails pace and it's way too drawn out. Acting is B at best with Helen Mirren carrying the cast. The African/ Residential school scenes are way, way too drawn out. \n\nI was looking for a continuation of 1883, with the hopes of softer ending, not this mess.",
      "date": "Feb 21, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "I love Yellowstone, 1883 and loved 1923 until season 1, episode7.  What is wrong with these writers/producers?  They spent 10/15 minutes on naked prostitutes, when they could have gotten their point across in 1 minute and NO nudity.  They wasted all that time that should have been about the actual story line an not about naked prostitutes, who basically have nothing to do with Jacob, Jack, John or Spencer.  Come on, lets keep this family oriented and not something where the writers\\producers can get their fix on!",
      "date": "Feb 20, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "The show is boring in general but this episode was all whispers and boring dialog.....literally nothing of any remote interest happens",
      "date": "Feb 20, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Brilliant viewing. No sugar coating life like they have in the past. Life was cruel after the Indian wars in the US.\nIt makes me sad when I realise how bad Things were for some.",
      "date": "Feb 20, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show is so boring it's beyond belief. Sorry, Taylor, your family had to sell your precious Texas cattle ranch when you were like 20 years old. It's *NOT* the greatest tragedy in the history of the Western world. The stories from all the Sheridan Westerns are so transparently personal and so self-congratulatory and self-pitying it's embarrassing. Please, Paramount, move on from this hack.",
      "date": "Feb 20, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show is so good!  People complaining it takes a long time to tell the story are being unrealistic. There are multiple storylines here and each takes a while to build. I cannot wait for multiple stories to converge. It will be Epic. SO glad it has been renewed for Season 2.",
      "date": "Feb 20, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "So slow.  Just watched an entire episode that moved the plot forward about an inch. And the acting is getting worse. Taylor Sheridan is a master at telling a story that isn't very interesting at an excruciatingly slow pace.",
      "date": "Feb 20, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "The only thing that let this down for me was the dreadful Irish accents. We saw the same with Tulsa King and Sons of Anarchy. With a wealth of Irish talent, please look to hiring actors with a genuine accent.",
      "date": "Feb 19, 2023",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "It's very good. Not as good as 1883, certainly not as good as Yellowstone. I do find the character of the blond English lady very annoying and slightly vacuous.",
      "date": "Feb 18, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "I thought the show was great! I'm usually in sync with the audience scores on most movies, but I was surprised to find the audience score so low (~76). I loved the characters, the storyline, the acting, just about everything! Loved 1883 as well and have not yet watched Yellowstone with Kevin Kostner yet. I rate it a 10/10 if you like authentic westerns that are accurate to history and show the raw side of history as well, even if it's not flattering or PC in reflection.",
      "date": "Feb 18, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "meh, slow not as good as 1883 or Yellowstone, so far.",
      "date": "Feb 17, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "Required dedication to get through it. Not bad but just barely entertaining.",
      "date": "Feb 16, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "I'm excited to share that 1923 lives up to the legendary status of great television that 1883 proved to be. And this is saying A LOT!",
      "date": "Feb 16, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Awful, slow and boring. The actress who plays Alex is horrendous, can't understand a word she says. She mush mouths everything followed by an outrageous laugh. If you liked the old time afternoon soap operas this might be your thing but for anyone else, stay away!!!",
      "date": "Feb 16, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I Love all of the series, so very well written, with amazing performances. The one thing that I find a little off putting with 1923 is that perhaps the part of Alexander is slightly over acted.",
      "date": "Feb 16, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Quite a journey and just good old fun storytelling.",
      "date": "Feb 16, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Hold the sappy, Jesus hallmark movie christ.",
      "date": "Feb 14, 2023",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "It is watchable.  Ford and Mirren are fine actors, and Jerome Flynn has the potential for an outstanding villain with some real complexity behind him.  The show touches on potential moral complexity (like all those in the Yellowstone series, one could argue that the main characters are the villains), but in the end choses to retreat from those ideas.  The nuns are truly horrible. The Native Americans noble.  The matron, matronly. The stoic heroes are stoic all the time.  Every character has exactly one characteristic and sticks with that at all costs. The series isn't over yet, so I'll also not rule out the possibility that the show redeems itself, but so, it is too mired in cliche and romance-novel plotting to really achieve any sort of greatness.   See a ghost ship in act one.  Be assured that they will hit that ghost ship in act two, even if the odds of running into the same ship adrift in open water when your own ship is steaming at full speed (and then have it mysteriously disappear after doing its job) is next to zero.  Adrift in open water, cue the shark.  Gun fight between main characters and villains? Every shot from the good guys will hit its target, and despite the lack of antibiotics or blood transfusions in 1923 rural America, any main character that isn't instantly killed will have invincible plot armor to protect them.  Also, despite having at least three arcs running at time, it has the amazing how little plot can be advanced in an episode.   I lover westerns, and haven't given up on it yet, but mediocre writing is ruining a show that really had amazing potential.",
      "date": "Feb 14, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "Too slow, just drags on. 6 episodes in and it is still slow and down right boring. I don't even care what happens from here. I won't waste another Sunday night on this one.",
      "date": "Feb 13, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "Way to slow moving.  Story lines are slow and boring.",
      "date": "Feb 12, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "I like this better than Yellowstone!  Not sure about the whole Indian school subplot  It seems a bit over the top and way too dark and violent and makes it hard to watch at times.",
      "date": "Feb 12, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "All three of Sheridan's series are wonders — absolute wonders. I despaired at finding anything worthwhile to watch on television or in the theatres, and along comes these three extraordinary compelling pieces art. And have no doubt, Yellowstone, 1883, and 1923 are/ will be pieces of Americana: a true homage to how this country became great, the resilience of its people, the leaning into of the freedom described in our founding documents, and the practical, sometimes excruciating lessons of responsibilities learned. Also, the passions and romance of the story couples that harken back to old and epic romantic stories now absent from our screens for a very, very long time are a pure joy to watch. And the heroines! Absolutely fantastic! Heroines the like of which I haven't seen since before Cameron abandoned his story-telling and started producing sillinesses like Avatar. There are moments of Wokeness, but they relegate themselves to the Indian scenes, which are special in their own way as another perspective but not as the grand American vision that our ancestors fought so hard for. As a descendant of native Americans (both sides of my family owned and worked land here, fought in freedom wars here before this country was a country), I appreciate Sheridan's giant and necessary reminder of how scrappy, how honorable, how determined, how romantic, and how wonderful our ancestors were. It's as though we are given permission to be proud of our country and heritage again. So Taylor Sheridan, I thank you for television worth watching and a breath Of fresh air from the the stale rancid woke cultural rot that we've been subjected to for going on 40 years now. Thank-you, thank-you!!!",
      "date": "Feb 12, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Too much of a love story and over acting",
      "date": "Feb 11, 2023",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "Sheridan, Ford and Mirren with a compelling story. Top notch TV.",
      "date": "Feb 10, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Excellent, better than 1883, somehow you really start to care about the Duttons this time around, just like in the Yellowstone Main series.",
      "date": "Feb 8, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Fantastic story.  You really care about the Duttons of this time period",
      "date": "Feb 6, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I love the idea, cinematography, and the actors. \nBut\nIT IS MOVING SO SLOWLY!!! Pick up the pace! \nOTOH it is easy to mutitask while this is on because you can be distracted an not miss much.",
      "date": "Feb 6, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "Its clearly well acted but its slow. I think the Episode spacing has lost the momentum. Still enjoying it very much. Needs a little \"Giddy up\"!",
      "date": "Feb 5, 2023",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "Love this show. Thrilling and love the time period. I hope they continue the series.",
      "date": "Feb 2, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The bigotry toward the Catholic Church is horrible.  A nun tortures a Native American student for not knowing the answer and then a priest does it.  25% of the US is Catholic and that is growing with immigration.  Imagine the same scene with another religion and it would be on every network.  I noticed 25% of viewers rate the show a 1.  But money talks and I am organizing boycotts.  Definitely the show as Catholics are blown away I have discussed it with.  But possible Paramount +.  People believe this country isn't religious.  Try again, don't believe what you see on television",
      "date": "Feb 2, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I couldn't get past the ridiculous fake accents used by Flynn and Mirren.",
      "date": "Feb 1, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "The Spencer and Alex story is captivating! She definitely needs to learn to stop screaming around lions though. Can't wait until these two get to Montana. The homestead story needs to be enlivened a bit. I'm here for it!",
      "date": "Jan 28, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "I am a big Yellowstone fan...well I'm trying to like the most recent two seasons. I think I may have liked 1883 even better. I tried to go into 1923 with low expectations and was hoping to be pleasantly surprised... but I wasn't. I absolutely love Harrison Ford and Helen Mirren as actors but this just didn't seem to work. So I'm watching the show and all of a sudden... we are in Africa? So far, this has been a slow story line and I am totally unimpressed. I think I'll just pretend this spinoff doesn't exist and continue liking 1883 and crossing my fingers that Yellowstone will get back to its roots.",
      "date": "Jan 23, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great show, just as good as 1883, and just as that show kept me coming back for more, this show has me glued to my seat, Harrison Ford and Helen Mirren are both fantastic.",
      "date": "Jan 20, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Excellent series, great scenery , good acting, and a storyline better than Yellowstone.",
      "date": "Jan 19, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Three episodes in and I am finding it all a little disjointed and a little bit slow. Not quite the binge factor of Yellowstone or 1883, both of which I loved. Ford certainly doesn't seem to have the screen presence I was hoping for. He is certainly no Kevin Costner ! Anyhow, hopefully over the next couple of episodes my view will change and I might actually start to care about a character.",
      "date": "Jan 18, 2023",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "Fantastic! Just as good as Yellowstone, or even better.",
      "date": "Jan 18, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The storyline is not as focused as Yellowstone, or as realistic to watch (due to some pretty average CGI).  This is a real pity because Mirren is stellar and it is easy to become completely engrossed in her performance.  To take a break only four episodes into the season sans explanation or notice to paying customers arguably further disengages the audience.  It must be an enormous undertaking to develop a family of shows under the Yellowstone umbrella and it seems so disappointing to see it founder only as it starts to develop relevancy.",
      "date": "Jan 16, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show is fantastic I can't begin to imagine bad reviews. It's really entertaining and its cool to see the timeline",
      "date": "Jan 11, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Found it odd that all the women, except for Indians and Helen Mirren were sexy, bleached blonds. Thought the time spent on Spencer in Africa was most interesting. Thought the time Spencer and his girlfriend spent standing in ocean was long and boring. \nNot enthused about watching episode 5. p.s. Our family has not watched the latest season of Yellowstone due to continuous  filthy, language.",
      "date": "Jan 11, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "Let there be no doubt that Harrison Ford and Helen Mirren work so well together that the series is a pleasure to watch.  Early on the cattle ranchers and the sheep herders were always fighting over land and grazing rights.  Laws were broken, senseless killings and feuds were the order of the day.  This series is well written, acted and the scenery is  superb !  No disappointments here.",
      "date": "Jan 10, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Fantastic! Sweeping vistas, conflict and power. The best TV has to offer.",
      "date": "Jan 10, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I am not sure what show all these critics are watching but this show is terrible and cringy. The gratuitous sexual violence is so disturbing that I could not even watch those scenes. It is one thing to show how Native Americans were treated but to act out those scenes in such graphic detail is so unnecessary. I could have tolerated those scenes a little more if there was other more compelling and interesting characters but there are none.",
      "date": "Jan 10, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "This is even better than 1883. Top casting talent, top story, just a wonderful set of characters - this is more interesting than Yellowstone right now.",
      "date": "Jan 9, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Initially I thought Yellowstone was a better show, but by episode 4 I realized how wrong I was. 1923 is one of the best TV shows of recent memory.",
      "date": "Jan 9, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "So far this Sheridan outing is really disappointing. The pace is agonizingly slow, and the two other plot lines going on are so disjointed and disconnected they end up being unwanted detours that make the show drag even more. There is so much unnecessary time given to these that by the end of the hour it feels like the story line hasn't advanced at all. I'm not looking forward to enduring four more episodes just to see what happens. Maybe I won't.",
      "date": "Jan 9, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great story and characters.  Some scenes little jarring at first until you see it all weave together, so hang in there.  Beautifully filmed in wide open country.  A must see.",
      "date": "Jan 9, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "10 minutes or so into what appeared to be a pretty decent flick we cut to a never-ending segment of Catholic brutality against native American women.  Honestly it starts with what could be a 2023 riot at a NYC Starbucks and after exposing the brutality of \"Christianity\" at length proceeds with an endless Nazi-istic bathing scene of the oppressed. Please - I've been exposed to better TikTok by my children.  Goodbye free trial of Paramount Plus",
      "date": "Jan 8, 2023",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "Actual living and having family that have been Ranchers for the mid 1870's and involved in the cattle industry in Wyoming at high levels while I recognize that this is fiction I also know some of it hits close to home. Also following the Indians story, the treatment by the Catholic Church and the US Governments desire to completely destroy the identity of our native Americans is very difficult to watch.  But I can not turn away at times what isn happening on the screen.  Great evil was committed on both sides and cannot be dismissed lightly. But then again this was the Wild West in it's most rawest form",
      "date": "Jan 7, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "So far so good.\n1883 is the way a tv show should be done. 1923 seems to be following in it's footsteps.",
      "date": "Jan 7, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Simply....Irresistible",
      "date": "Jan 7, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Amazing show,finally some good content",
      "date": "Jan 6, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "More than solid, but not on the level of the first few seasons of Yellowstone. Some great performances and chemistry - and a real sense of atmosphere and tension, but overall just not all coming together in an effectively satisfying way. Absolutely arresting cinematography and visuals though.",
      "date": "Jan 6, 2023",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "Not enjoying this show, nothing like the others.",
      "date": "Jan 6, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Some good acting but wow, just too Hollywood, lol. I couldn't watch any  more than 5 episodes.  Best thing about it was the cinematography.",
      "date": "Jan 6, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Wow, somebody give Harrison Ford a chair and lay off on the wide angles, feels like he's going to break any minute.",
      "date": "Jan 5, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Taylor Sheridan tells the most compelling stories and doesn't spoon-feed every detail to the viewer. I love that you need to do some thinking to figure out who is who and how these various storylines and characters will all fit together. LOVE 1883 and 1923 and can't wait for more to unfold. I love the chemistry of Harrison Ford and Helen Mirren as the senior cast members and showing how older generations of farmers and ranchers could lead and be strong contributors to life and their families.",
      "date": "Jan 5, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Loved 1883, and very much enjoyed Yellowstone. I've watched three episodes of 1923. Themes such as treatment of First Nations people and the \"Native Schools\" are extremely well done. However, much of the storyline so far, like the \"African romance\" are more like a cheap Mills & Boone romance novel, abysmal and cringeworthy. Harrison Ford just doesn't work in my view, far too self-conscious, and he can't help looking like a soft and pampered Hollywood star, rather than a hard-bitten Montana cattleman. Helen Mirren is a great actor, but please, why not use Irish actors for Irish parts....?",
      "date": "Jan 5, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "I'm not usually drawn to period projects, however, Harrison Ford and Helen Mirren are massive drawcards and they do not disappoint. I was hooked from the first episode and I'll see it through to the end!",
      "date": "Jan 3, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Overall it's well done, although Tyler Sheridan seems to have an odd obsession with tan blonde women (without tan lines - which is especially odd considering women did not generally sun bathe during this era, especially in Montana).  I love the storyline about the Native American abuse at the Catholic school - it's very important to bring these types of stories into mainstream television. But the ranch stuff is actually really boring. Helen Mirren is phoning it in. Harrison Ford seems too old for his role. Fingers crossed things will pick up when the prodigal son finally returns from Africa.",
      "date": "Jan 3, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "The first two episodes were disappointing. I was so sick of evil nuns and priests I longed for Beth. But then episode three was like pow!\nI'm in.",
      "date": "Jan 3, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Only three episodes in, but great acting and story to date.",
      "date": "Jan 2, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is why prequels usually don't work. This bland, predictable, sanctimonious drivel put me to sleep pretty early on. Could have been thoughtful character study with beautiful photography in the hands of competent filmmakers.",
      "date": "Jan 2, 2023",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "I really liked the ranch parts but there isn't enough of that. I wanted to watch a Yellowstone prequel. The big game hunting is weird and the Native American girls school is insanely boring and unnecessary. If I wanted to watch something about Natives being treated badly 100 years ago, I would have watched a documentary on it. I don't as it turns out.",
      "date": "Jan 1, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Hmm that sexy boy in Africa! \nLove it so far",
      "date": "Dec 31, 2022",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "Helen Mirren is putting in her best, but Harrison Ford is just collecting a paycheck and it is obvious.  Ford needs to only act for shows that he cares about.  He clearly doesn't care for this one.",
      "date": "Dec 31, 2022",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "Quality production, great cast and writing that shows the entertainment of audiences is not a lost art.",
      "date": "Dec 29, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "SHERIDAN HAS LOST IT! VERY LITTLE ABOUT RANCH IN MONTANA, BUTWAY TOO MUCH AB9UT ABUSE OF INDIAN GIRLS AND BIG GAME HUNTER IN AFRICQ. NOT ENOUGH BOUT THE RANCH IN MONTAnal",
      "date": "Dec 28, 2022",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "I have to say the production value of this series is excellent.  Based on 2 episodes I say this is a hit.  For me the most interesting storyline is the Kenya hunter storyline with the new blonde girl in the mix now.  I would love to see this as a stand alone story Duttons of Kenya.   Looking forward to seeing where the rest of this series goes and if the creator kills the series after 1 season like the short lived 1883.  I truly hope not.",
      "date": "Dec 27, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Love it so far. Helen Mirren was a standout in episode one. Very excited for this season. They set the bar very high with 1883",
      "date": "Dec 27, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great writing and show.  The acting and writing is excellent.",
      "date": "Dec 27, 2022",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Love it. Great performances and much of the original magic",
      "date": "Dec 27, 2022",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "The acting, the story so far, the pace, and the way it reveals many different kinds of monsters all combine to make this another Sheridan masterpiece.",
      "date": "Dec 27, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Not as good as Yellowstone, but still has an excellent cast and solid direction behind the camera. Maybe shrink the world building and keep these spin-offs in a smaller scope so we can grow with the characters.",
      "date": "Dec 27, 2022",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "After all the money and time spent on this why oh why can't you people get the Irish accent right it's absolutely diabolical. We've come a long way from the quite man & Barry Fitzgerald Helen mirren should know better ! Such a shame",
      "date": "Dec 27, 2022",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great show! Love to see more.",
      "date": "Dec 27, 2022",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "How to make business wih meat and guns. Other than that nothing new since yellowstone",
      "date": "Dec 27, 2022",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "So far so good, but withholding full review until the end of the season.",
      "date": "Dec 27, 2022",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "The show ok not great.  1823 much better.  Harrison ford underwhelming.",
      "date": "Dec 26, 2022",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "Raw western set at the turn.  Yellowstone prequel excellently performed!",
      "date": "Dec 23, 2022",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show continues to tell the tale of the Duttons and how they came to be. Harrison Ford of course is great but the real hero is Mirren. Her portrayal of Cara Dutton shows Cara as the glue that keeps the family together. Sheridan highlights they way the Native American culture was treated during this time. Very emotional. 10/10!",
      "date": "Dec 22, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great start to another spin of Yellowstone.",
      "date": "Dec 22, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "What a miss on a major opportunity. Just more manure shoveled by Sheridan, who now speaks for Texas and the Irish? No thanks, lad.",
      "date": "Dec 22, 2022",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "It's good. I enjoyed it.",
      "date": "Dec 22, 2022",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "I think TS has another hit on his hands!",
      "date": "Dec 21, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great! another awesome series surrounding yellowstone. Really cool to see Harrison Ford doing a TV series.",
      "date": "Dec 21, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Boring, slow and Harrison needs to stay away from westerns!",
      "date": "Dec 20, 2022",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "I think it is a great prequel and the story is epic in all proportions. The actors are phenomenal and the cinematography is beautiful. Its a truly great show.",
      "date": "Dec 20, 2022",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Truly, I wanted to love this show, because I thought Taylor Sheridan's 1883 series was a masterpiece — a work of dramatic art so unexpected. I'll reserve my final judgement until I've seen the entire series, but the first episode of 1923 was a disappointment. The tinkling music in the background against the fuzzy filmmaking was disjointed. The dialogue was hard to follow — even the captions couldn't capture entire scenes. I am a fan of Helen Miranda and Harrison Ford  — and their performances were solid. But the overall impression of the show so far is confusing, especially compared to 1883…",
      "date": "Dec 20, 2022",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Watched the premier episode and personally found it to be a snoozefest.   Quality actors but storyline drug on too slowly.    Not easily offended but gratuitous profanity was just too much.     People in that era did not use the F word in every other sentence.   That plus boring makes it a one and done despite the great caliber of actors.",
      "date": "Dec 20, 2022",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "I had high hopes b/c I'm a huge fan of all TS series - Yellowstone, 1823, Mayor of Kingstown, Tulsa King.\n\nBut 1923 E1S1 was a HUGE disappointment.\n\nThe entire convent sub-episode was a huge snoozer.  Maybe it will be relevant later, but wow, how unbelievably boring.\n\nThe side-story in Africa - also lame, and not in the realm of believability.\n\nThe ending of E1 was SO contrived...\n\nSo far, 1923 is going to be TS's worst series if E1 is any indicator...",
      "date": "Dec 20, 2022",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "Not exactly what I was expecting, not sure what I was expecting but it wasn't the \"sit on the edge of your seat\" like Yellowstone or the Prequel 1883.  hoping it gets better but had a tuff time sitting through to the end.",
      "date": "Dec 20, 2022",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "started a little slow but the acting is good..",
      "date": "Dec 19, 2022",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "Breathtaking camera work and scenery, plot is setup quite nicely. Can't wait for more episodes, I think Helen Mirren will do great in this role.",
      "date": "Dec 19, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Loved it! A few too many plot lines in the first episode but I think subsequent episodes will help with that. Ford and Mirren are marvelous as always.",
      "date": "Dec 19, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Seems like a bridge episode... yet it's the first episode of the season. Characters could have been introduced better and the writing is barely decent so far. I was really looking forward to this show because I enjoyed 1883 and the casting seemed really good, but I was disappointed with the pilot.",
      "date": "Dec 19, 2022",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "Great pilot, let's hope it holds up.",
      "date": "Dec 19, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "So far so good. I'm looking forward to seeing where they go with it.",
      "date": "Dec 19, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I expected an enjoyable cinematic experience, not 4 minutes of commercials for every 8 to 10 minutes of screen time. Too bad MTV productions finds it necessary to dilute the viewing experience with so many long interruptions. But I guess they have to have some way to finance Harrison's and Helen's enormou$ paycheck$. I can live without having to watch so many commercials, so I probably won't be watching any more episodes.",
      "date": "Dec 19, 2022",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "I was really hoping 1923 would be as good as Yellowstone. But, within 10 minutes of watching and hearing the \"F\" word, too many times, I knew this was Not a Realistic show. And, the court scene at the beginning had around 200 people in the courthouse. That is just so unrealistic. I can see 25 people, maybe 30, but NOT 200. People before the 1970s didn't say the F word like they do today. And in 1923, the 1700s and 1800s, people didn't say the F word, or even cuss. What's with you Hollywood people trying to make movies? Go back to school and take some History and English classes, and quit trying to be so creative. Just make the show the way things really were. We don't need your \"spin\" on how you would have done things or the \"F\" bombs and cussing you would have done. That only makes your \"work\" stupid!",
      "date": "Dec 19, 2022",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "Wonderful cinematography for the most part.  Painfully bad writing and at best average acting.  It's like it was written with a book of cliches for reference.",
      "date": "Dec 19, 2022",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "OMG.  She died!!!!  She freaking died!!! How is she still talking and talking and talking.  I wish I could but I just can't.  Done.",
      "date": "Dec 19, 2022",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Very disappointed in the first episode.  It started our with a very realistic telling of the conditions for people living in Montana in 1923 and how unforgiving the land.  But it took a sick turn showing the very cruel treatment of young Native American girls by the Church.  It muddied what could be a great story.",
      "date": "Dec 19, 2022",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "Love the cast, didn't like the way the characters were introduced, left you trying to figure out who was who too long.",
      "date": "Dec 19, 2022",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "\"He got what his family fought for.\" Didn't an Indian in the last show 1883 decide not to wipe them out and give them the land so they could bury thier daughter? Glad Ford and Mirren got paid more of Sheridan's sophmoric writing.",
      "date": "Dec 19, 2022",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "When we watched 1899, we absolutely hated the girl doing the narration.  We were happy that she died at the end.  Her voice was annoying and fake.  Imagine my surprise and annoyance when I tuned in to 1923 only to hear her narrating again!  The show is compelling, but I subtracted a star for that irritating, fake accented narrator!",
      "date": "Dec 19, 2022",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Sheridan and Co. are like a great rock band that puts out one hit album after the other.     E01 of 1923 hits the mark for another 'must see'.",
      "date": "Dec 18, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Taylor Sheridan's Yellowstone Universe gets a new worthy addition to it.",
      "date": "Dec 18, 2022",
      "rating": 5.0,
      "episode info": "Season 1"
    }
  ]
}