{
  "lawmen_bass_reeves": [
    {
      "review": "Nothing here but squandered potential.",
      "date": "Mar 7, 2024",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Everything unfolds slowly and it's kind of a chore to watch.",
      "date": "Feb 20, 2024",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "I really enjoyed this series. If you are looking for a gritty western where for the most part the writing is strong, this is one for you. The series does stray at times in focus and loses its momentum but outside of that, a very entertaining show.",
      "date": "Jan 19, 2024",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show somehow manages to be both too slow and too rushed.",
      "date": "Jan 9, 2024",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "This is a fantastic series! Rich characters and storytelling. Rare in todays \"tv\".",
      "date": "Jan 6, 2024",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Taylor  Sheridan I believe has come to the end of his \"compelling\" western drama's with this one. \n\nYellowstone and the others westerns have ran their course, are played out, and this series puts the last nail in the coffin.\n\nQuit watching Bass Reeves after episode 4. \n\nThey'll bring it back for season 2 but Why?",
      "date": "Jan 1, 2024",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Excellent series with a satisfying ending that resolved everything in the end.",
      "date": "Dec 29, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show is amazing, it transports you to another time and makes you feel part of the story.",
      "date": "Dec 27, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "A solid modern western based on an amazing real-life figure. The show does move at a slower pace much of the time, and that may not be for everyone. But the performances are top-notch, the violence is visceral and brutal, and the whole thing is well shot.\n\nI only complaint is that I wish the show had focused more on Bass Reeves real life, exploits and less on the historical fiction  novels upon which the show is based.  There's enough in that man's life that they could've run a show for five seasons, and the need to tie up everything in a single arc caused them to leave out a lot of interesting material (example: The real account of what happened to the cook, would've been more interesting than what we got.) \n\nStill, solid effort.",
      "date": "Dec 26, 2023",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "The true story of Bass Reeves didn't need embellishment. They could have gone for many seasons just retelling what he really did. The side-stories were kind of ridiculous, and the finale was too much like a more serious version of a Wild Wild West episode. The series by the end just felt unfinished.",
      "date": "Dec 23, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "I really wanted to like this show, as I usually love historical fiction.  But Bass Reeves is just a bore, and the plot moves along  super-slowly.  By the fourth episode I just lost interest.",
      "date": "Dec 22, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Well acted, written and shot.  It is captivating and engrossing.  Highly recommended.",
      "date": "Dec 21, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I love this series. Although there is a fair amount of graphic violence, it is in service of the story, which is actually character driven.  I now want to read the books about this incredible man and his family.",
      "date": "Dec 19, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Lacks stakes, even if you know the character",
      "date": "Dec 18, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "Dry, Dry, Dry. Did I mention it was dry?",
      "date": "Dec 17, 2023",
      "rating": 2.5,
      "episode info": "Season 1"
    },
    {
      "review": "It's pretty mid for me nothing extraordinary really. Could have been better if they actually cast more native American or ethnically ambiguous roles. Bass Reeves accent sounds weird too.",
      "date": "Dec 15, 2023",
      "rating": 3.0,
      "episode info": "Season 1"
    },
    {
      "review": "i want to watch stories starring people that look like me. this is written for a cultural group that needs to realize it won't be accepted by those that hope we as humans should be striving for unity not division.",
      "date": "Dec 15, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "very slow and the story telling is so weak i dont even know what the show is about anymore. i quit watching",
      "date": "Dec 15, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "I am not sure everyone is watching the same show with these reviews. This show lacks a lot. The story line is incredibly choppy and slow. What is Dennis Quaid's role? The actors are great actors but the writing and direction of the plot are hard to follow and you lose interest quickly as the season progresses. I just wasted 32 minutes of my life on the latest episode. What are we even watching at this point?",
      "date": "Dec 11, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Great show,Great actors. So hard to find a show with both",
      "date": "Dec 9, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great acting by David Oyelowo. Good writing as well.",
      "date": "Dec 8, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Im a big fan of westerns and that period of history. I was really excited when I found Taylor Sheridan was making a show about Bass Reeves. This series does not disappoint.",
      "date": "Dec 6, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Taylor Sheridan's best TV show yet. The script, pacing, storytelling, acting and production quality are excellent. You will feel as though you are in the late 1800's  seeing the story of an American hero that we never learned about in school.",
      "date": "Dec 6, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "A little slow-paced with weak storytelling, the same narrative Sheridan likes to go to the well with, over and over again. I was hoping for something less expected from him. All in all, disappointing and an obvious money grab one again.",
      "date": "Dec 4, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "Started quite well with first few episodes.has lost its way and my attention span, didn't  finish watching episode 6.\nNot sure what the show is about now",
      "date": "Dec 3, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show is a throwback to old-school westerns, Americana at it's finest, but this is even better.\nFor too long the western has glorified the lone-wolf samurai character, who cares for nobody, drinks like a fish, and womanizer along the way.\nThis is different, bringing into the story the massive racism in the post-civil war America, and the hardship faced by ethical people of color, whether native American, black, or Asian. Where do good-hearted and honorable outcasts go in this wild and fractured American west?\nLike the earlier mentioned samurai, Bass Reeves' character lives by an immutable code, informed by judeo-Christian ethics , felt hatred he personally experienced, and the desire to be a citizen, husband, father, and lawman of honor.",
      "date": "Dec 2, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Very, Very Good. \n\nI am not the biggest fan of Westerns, especially the Taylor Sheridan drivel (well, except for Yellowstone), but this series is excellent! Very strong actors, a great narrative, and an excellent script. David Oyelowo works some magic on the screen, and you will find yourself invested in his life and story, as well as those around him. You get both a nice narrative pace with both depth and action. You feel like your attention is rewarded as a viewer. \n\nUnlike a series like 1923, where you feel like you are reading a novel by a novelist who is paid by the word, giving you very little for each minute you spend.",
      "date": "Dec 2, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great acting and edge-of-your seat plot.",
      "date": "Dec 1, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Started out just OK, then went trailed off into boring and uninteresting. Writing, casting and acting are just not good. I don't even want to finish watching the whole series.",
      "date": "Nov 27, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Once again David Oyelowo takes an American hero and ruins him with his lack of understanding of African American culture.",
      "date": "Nov 27, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Oyelowo is exceptional in the role of Bass Reeves, however with each successive episode I'm left feeling he's a little too invulnerable and a little too superhuman for the character to be completely believable.",
      "date": "Nov 25, 2023",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "De tirar o fôlego! Muito bom mesmo !",
      "date": "Nov 25, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Para quem gosta de filmes antigos de faroeste, indico esse!! Não conheço o ator mas interpretou super bem!",
      "date": "Nov 25, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Bandidos e mocinhos tão presentes nos quadrinhos dos EUA, agora ganham vida nessa série antológica. Uma maravilhosa viagem no tempo muito rica de detalhes, acrescentando muito conhecimento histórico ao telespectador.",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The intricate storytelling, combined with authentic period details, immerses viewers in the untamed landscapes of the frontier. The stellar performances and meticulous attention to historical accuracy make Lawmen: Bass Reeves a gripping and educational experience, providing a fresh perspective on the complexities of justice in the Wild West.",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Otimo filme. Aconselhos assistir.",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "FAROESTE SEMPRE UMA BOA PEDIDA!!\nGOSTO DE VER!!",
      "date": "Nov 24, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Adooooreiiiii💖💖💖💖",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "A good serie to watch in late nights.",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Melhor filme que já assisti indico muito parabéns",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "The plot tells the true story of Bass Reeves, a legendary lawman in the Old West. Reeves, known as the greatest frontier hero in American history, worked in the Reconstruction Era as a federal peace officer in Indian Country, capturing more than 3,000 of the most dangerous criminals without ever being harmed.",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Execelente, uma otima experiencia pra quem busca algo entusiamante!!1",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Isso me arremete a faroeste.",
      "date": "Nov 24, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Muito bom , filme parece ser interessante",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Gosto de filmes assim",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "incrível como os atores desse filme sao bons, adorei a produção e os cenarios",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Muito bom os filmes  de velho oeste assistir  com a família  e bom d emais",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Essa série é muito boa",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "😍😍😍😍😍😍😍😍😍😍😍",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Perfeito para sair da rotina.",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Bem legal recomendo muito",
      "date": "Nov 24, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Ótimo filme , muito bom !",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "MUITO BOM ASSISTA AINDA HOJE",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Gostei muito do filme gostei da longametragem",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Adoroooooooo filmes   👏😎🎉",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Very interesting movie. Good direction",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Bass e sua família enfrentam \n difículdades em sua fazenda, recebe a visita da lei e se depara com uma proposta interessante, série de faroeste com excelente ator",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Simplesmente muito legal",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Muito legal, fiquem a vontade.",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Essa é uma ótima pedida para os fãs de velho oeste",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Sem comentario. So trabalho para uma empresa de avaliacao.",
      "date": "Nov 24, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "There is a financial pyramid in Sima with one of the starred brands, they are paying for 5 stars, and they didn't pay me, you sons of bitches\n\nMeus olhos viram isso muito legal , tarefa 14",
      "date": "Nov 24, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "Esse é bom, história filé",
      "date": "Nov 24, 2023",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "Best série and cast.",
      "date": "Nov 24, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Fiquei preso no enredo incrível.",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Gostei muito, mesmo sendo meio confuso é diversão certa.",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Que filme maravilhoso. Amei. Recomendo.",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "\"Lawmen: Bass Reeves (2023)\" é um filme cativante que mergulha na vida fascinante do lendário oficial da lei Bass Reeves. A narrativa habilmente equilibra a ação emocionante com uma caracterização envolvente do personagem principal, oferecendo uma visão perspicaz da justiça no Velho Oeste. A cinematografia impressionante e a interpretação convincente do elenco elevam ainda mais a experiência, tornando este filme uma homenagem envolvente a um herói muitas vezes esquecido da história americana.",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It's a interesting movie",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Gostei muito, irei assistir novamente",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Ótimo. Como uma viagem para um outro mundo e uma outra época.",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Muito bom adorei 👏👏",
      "date": "Nov 24, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "lindo e emocionante!",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Serie maravilhosa, amei.",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Gostei do filme, mas ele é bem devagar para as coisas acontecer",
      "date": "Nov 24, 2023",
      "rating": 4.0,
      "episode info": "Season 1"
    },
    {
      "review": "Com David Oyelowo pisando habilmente nos estribos de Bass Reeves , este procedimento corajoso é lento para chegar ao empate, mas atinge seu alvo mesmo assim.",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Season muito bom recomendo",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Bom filme .... bastante ação.....",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Gostei muito Vale apena assistir",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Adorei esse filme bom",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "muito bom !!! recomendo muito",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Ótimoooooolooooooooo👏🏻👏🏻",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Ótimo filme pra quem gosta de uma ação",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Excelente filme muito bom",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Ótimo filme! Indico muito para qualquer idade, engraçado e cheio de suspense. Assistam sem medo",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "O ameiiiii a série, maravilhosaaaaa.",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Muito bom, e intuitivo",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Filme espetacular vale a pena assistir.",
      "date": "Nov 24, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "Filme muito bom sucesso",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Incredible story. World class acting. Something my entire family waits for and watches together. We need more shows like this.",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Absolutely brilliant! Blown away by the authenticity of David Oyelowo's performance. His acting is so believable in this beautiful true story. So thankful for this story coming to life. We need more stories told from this kind of perspective.",
      "date": "Nov 24, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It doesn't release fast enough. At the end of each episode I want more. The acting is great, the stories are somber  but hopeful still. It feels like an authentic human experience being presented.",
      "date": "Nov 22, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Awesome show. Emotional yet satisfying.",
      "date": "Nov 19, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Bass Reeves was an incredible man and it's so awesome to see his story told in an honorable way. David Oyelowo's performance in the show is captivating and leaves you wanting more after each episode. Seeing a Western story centered around a Black family is refreshing. One of my favorite scenes is when Bass reunites with Jennie and meets his daughter Sally for the first time. I had tears while watching that scene! We need more shows like this. So happy about this one!",
      "date": "Nov 17, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "I had a hard time trying to finish the first episode. That Bass Reeves sure cries a lot. I'm out.",
      "date": "Nov 17, 2023",
      "rating": 2.0,
      "episode info": "Season 1"
    },
    {
      "review": "We were looking forward to this series and were \"seriously\" disappointed.  There were numerous factual errors and inconsistencies in just the first two episodes.  For instance, the Seminole Indian tribe was not located in Texas.  They are a Florida tribe or southeastern US tribe.  In walking across a sage brush covered desert, anybody with any sense would wrap their feet in cloth or something rather than go barefoot.  We were hoping for something a bit more realistic.  I guess the director wanted drama more than credibility.",
      "date": "Nov 17, 2023",
      "rating": 1.5,
      "episode info": "Season 1"
    },
    {
      "review": "After first 3 episodes, I really like the series.  The acting is excellent, the scripting is very well done, and having a story told that fits the truth a little more than most stories about Bass Reeves is refreshing.  Looking forward to more.  I wish streaming services would stop trying to be like the old networks and would return to releasing an entire season at a time.",
      "date": "Nov 15, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "David Oyelowo pulls you into this show and keeps you engaged in every scene with his riveting performance. The writing and the intensity of the drama and expansive gritty world of characters that Bass Reeves must navigate is a gripping, compelling deep dive that leaves you wanting more.",
      "date": "Nov 14, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "A very difficult story to enact with regard to the era of the time. It was done exceptionally well",
      "date": "Nov 14, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "It's so refreshing to see a period drama centered around a Black family. I really enjoyed seeing this fresh perspective told in an honest and authentic way. Highly recommend.",
      "date": "Nov 14, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is one of my new favorite shows, so engaging. This story should have been told ages ago, but I'm so glad it's being told now.",
      "date": "Nov 14, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "David Oyelowo is brilliant",
      "date": "Nov 13, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Love! Aside from the absolute visual mastery of the Western landscape that is a hallmark of every TS series, this show is pure heart. David Oyelowo is spectacular as Bass Reeves. He had me 100% at the card game when his emotions move seamlessly from despair to rage in a pivotal moment. His face shows every nuance of thought and emotion. And brava to Christina Alexandra Voros who has made these series her own with such beauty, heart and respect for the history and the people of the old West.",
      "date": "Nov 11, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "David O. should be a shoe-in for an Emmy for this series. Dennis Quaid and Donald Sutherland are legends. And the supporting cast is great. I recognize many of the actors in the cast and I'm excited to see them. Even my favorite comic Bill Dawes is apparently on this. Can't wait to see how this unfolds.",
      "date": "Nov 11, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Great to learn about this interesting character in our history who overcame many challenges to be one of the most effective lawmen of his era - hooked after the 2nd episode.",
      "date": "Nov 10, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "David Oyelowo is incredible as Bass.",
      "date": "Nov 10, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "An authentic, gripping, and emotionally driven show supercharged by incredible performances, and unprecedented scope and scale.  A must watch.",
      "date": "Nov 8, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Clean gripping content, but a tad slow. Awesome show for the Family.",
      "date": "Nov 7, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This yet another Taylor Sheidan historical western drama with accurate portrayal and excellent cast",
      "date": "Nov 7, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "One of the best shows I've seen in a while.  Writing is superb and the acting is phenomenal!",
      "date": "Nov 7, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This is one of the best performances I've seen from a lead actor. And it's shot beautifully. Don't miss this awesome American series.",
      "date": "Nov 7, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "This show is so beautifully written and visually stunning. The actors deliver incredible performances as well. By far my favorite show of 2023, a must see!",
      "date": "Nov 7, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Based on the first two episodes, I really like this series!  I love that history not usually mentioned/whitewashed is being highlighted.  Great performances too!  Highly recommend",
      "date": "Nov 6, 2023",
      "rating": 4.5,
      "episode info": "Season 1"
    },
    {
      "review": "The plot long and drawn out. The acting me was just average. Owyelo's portrayal did not move me at all. And the screenplay was just boring and poorly written. Reeves deserved better.",
      "date": "Nov 6, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "Taylor did a nice job of writing as he as done on all of his projects.  Acting is very good, character development is very good.  Great actors in the show.  Let's see how it goes in the next episodes.",
      "date": "Nov 6, 2023",
      "rating": 3.5,
      "episode info": "Season 1"
    },
    {
      "review": "Outstanding story and acting in every way. Far better than I expected, especially after seeing several reviews giving it mediocre ratings. But the entire cast is excellent. The script is, too. David Oyelowo, as usual, nails it. Grateful that Bass Reeves story has come to the screen. Long overdue, but worth the wait.",
      "date": "Nov 6, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Captivating story and beautiful cinematography. The story has soul and good pace.  Can't wait to see more.",
      "date": "Nov 6, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "A Must Watch TV Show!",
      "date": "Nov 6, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Could change, but so far it's a great start. He's got a fascinating story. I hope they keep doing it justice!",
      "date": "Nov 6, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Was excited for the story but it's so slow and stale.  Bass Reeves has an incredible history and story but this entire thing is just off.  Last 2 Taylor Sheridan shows (this and Lioness) have been his worst by far.",
      "date": "Nov 5, 2023",
      "rating": 1.0,
      "episode info": "Season 1"
    },
    {
      "review": "These westerns are getting bland and overdone…good acting but sooooo boring omg….wont watch anymore",
      "date": "Nov 5, 2023",
      "rating": 0.5,
      "episode info": "Season 1"
    },
    {
      "review": "An epic show already. Well worth the wait as far as I am concerned.",
      "date": "Nov 5, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    },
    {
      "review": "Excellent, and a true story.",
      "date": "Nov 5, 2023",
      "rating": 5.0,
      "episode info": "Season 1"
    }
  ]
}