{
  "star_trek_lower_decks": [
    {
      "review": "The series started off strong and it keeps going strength to strength. I already liked the characters in season 1, but at this point I think they've sort of perfected the characters.",
      "date": "May 2, 2024",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "So silly but so enjoyable!\nI havent cared so much about a crew since Voyager <3",
      "date": "Apr 12, 2024",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Some very clever episodes were in this season. Characters and stories building from past ones. Its good stuff.",
      "date": "Oct 7, 2023",
      "rating": 4.5,
      "episode info": "Season 3"
    },
    {
      "review": "Hot robot on owl action, DS9 intro, Breen! This season has it all.",
      "date": "Sep 9, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Fresh but nostalgic, lower decks continues to make me want more and more. Fantastic characters, exciting new missions, bringing new backstory and development to many previous races and ideas throughout the trek franchise. If you love star trek, you must love lower decks.",
      "date": "Sep 1, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "It's good background noise. The references are still funny, but overall the show is getting pretty one note and the characters are getting stale.",
      "date": "Aug 22, 2023",
      "rating": 2.5,
      "episode info": "Season 3"
    },
    {
      "review": "This show just gets better and better over time.",
      "date": "Aug 2, 2023",
      "rating": 4.0,
      "episode info": "Season 3"
    },
    {
      "review": "LOL, the funniest 10 episodes ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "date": "Jun 15, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Cada temporada se pone mas entretenida. Esta el espiritu clásico que extrañaba en otras producciones",
      "date": "Jun 13, 2023",
      "rating": 4.5,
      "episode info": "Season 3"
    },
    {
      "review": "If you are a Trekkie who loved Futurama; you will love this! I love having a behind-the-scenes look at the Star Trek Universe!",
      "date": "May 8, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Yes. Yes. Yes. I never thought I would enjoy Star Trek as an animated series, but I'm in love with the show.",
      "date": "Apr 8, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Another superb season that gets a little more dramatic, especially the season finale, while still delivering the comedy.  The standout episode is \"Hear All, Trust Nothing\", a hilarious crossover with \"DS9\" that not only features the regular cast members but show how well they can integrate into this comedic format (this pretty much establishes the show is cannon).  Overall, a fantastic series and one of the best in the franchise in recent years.",
      "date": "Mar 27, 2023",
      "rating": 4.5,
      "episode info": "Season 3"
    },
    {
      "review": "I can't get enough of Star Trek Lower Decks. It's hilarious & does an admirable job of not only paying homage to the Star Trek shows that came before but, at the same time it's completely fresh & gives all the major characters great depth & originality.",
      "date": "Mar 23, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "This series has by far been my favorite new Trek series (and I'm a huge fan of them all).  The constant fun yet serious stories, the plethora of Trek easter eggs, and the great characters have ran consistetly through all three seasons, and I look forward to that in the future. I can truly say that there is only one episode and one character I did not like (rhymes with shmeanut shamper... the season 3 episode).",
      "date": "Feb 19, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "It didn't quite hit the amazing heights of S2, but it was phenomenal nonetheless.",
      "date": "Feb 16, 2023",
      "rating": 4.0,
      "episode info": "Season 3"
    },
    {
      "review": "Awesome Series!.. Very Funny!",
      "date": "Feb 7, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "this show grows on me more with each season, so glad it was renewed, its fantastic",
      "date": "Feb 6, 2023",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Was skeptical at first but Lower Decks turned to my favorite Star Trek series … nice cruise through the Star Trek universe with cool characters and creative stories.",
      "date": "Jan 23, 2023",
      "rating": 4.5,
      "episode info": "Season 3"
    },
    {
      "review": "This is by far the best and most entertaining of all the Paramount Star Trek series. So much fun to watch! The characters are completely endearing and it's refreshing that it's so out of the box. The rest of the Star Treks are very uptight. This show is light and fun.",
      "date": "Jan 18, 2023",
      "rating": 4.5,
      "episode info": "Season 3"
    },
    {
      "review": "Are they moneyless ? How could they live?",
      "date": "Jan 17, 2023",
      "rating": 0.5,
      "episode info": "Season 3"
    },
    {
      "review": "This show gets funnier every season. It may reference past Star Trek content a little too often but overall it's great. I love Boimler.",
      "date": "Jan 6, 2023",
      "rating": 4.0,
      "episode info": "Season 3"
    },
    {
      "review": "The best parts of Star Trek! Growing up and facing your flaws with a team who is willing to stand with you as you grow as a person. STLD truly shows us that a better world is possible and that everyone deserves empathy and compassion. \n\nIt's funny as hell -- nonstop laughs and many good throwbacks to the trek I grew up watching with my mom growing up. If you're looking to relive the days of TNG and DS9 with levity and fun this is your show.",
      "date": "Nov 14, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "This show makes me incredibly happy.",
      "date": "Nov 9, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "This show has everything from the beginning: a real story, character development, and lots of wacky Star Fleet adventures. Season 3 ramps the whole thing up to 11. Old mysteries are resolved, old faces come back for more adventures, and we have some new threads left hanging for season 4. What are you waiting to watch this show if you haven't already?",
      "date": "Nov 2, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Still a lot of fun to watch.",
      "date": "Oct 30, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Best season so far.\nPerfect combination of Star Trek nostalgia, adult animated show and good stories. \nIn that respect it is very similar to The The Orville.\n\nMy favorite \"New Trek\" show, hands down.",
      "date": "Oct 28, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Season is almost over and I think it's getting worse at the end here one more EP to go, let's hope they don't forget all past character progress.",
      "date": "Oct 22, 2022",
      "rating": 1.5,
      "episode info": "Season 3"
    },
    {
      "review": "Up to episode 9 and it was not good, they seem to have lost entire seasons' past character development progress, or EP9 was shown out of order.",
      "date": "Oct 22, 2022",
      "rating": 1.5,
      "episode info": "Season 3"
    },
    {
      "review": "Just a far Cry from the First Seasson.\n\nBoring and agressivly Unfunny.",
      "date": "Oct 17, 2022",
      "rating": 1.5,
      "episode info": "Season 3"
    },
    {
      "review": "Really stunning episodes.",
      "date": "Oct 17, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Overall this is a solid show.  Of the five current offerings.  This is my second choice after Strange New Worlds.  Please renew and consider 13ep seasons.",
      "date": "Oct 8, 2022",
      "rating": 4.5,
      "episode info": "Season 3"
    },
    {
      "review": "==SPOILER ALERT==\nLove the first two seasons, Love most of season 3.\nEp. 6 was great - it has humor and plenty of references, which is what the series is about.  Ep. 7 left me with \"what did I just see?\"   a love affair  between an excomp and a bird man with issue with his dad - seriously?  -- Fail please do not repeat it. \nReality check - your audience were kids when originals were aired - they are not kids anymore - sure its nostalgic and humorous - keep it nostalgic and humorous, don't dumb it down.",
      "date": "Oct 7, 2022",
      "rating": 3.5,
      "episode info": "Season 3"
    },
    {
      "review": "The third season is the best season for Lower Decks yet toning down the annoying personality of Mariner allowing other characters the screen as well as making Boimler less of the shows punching bag which was getting old fast. The shows biggest credit is still the art style which is reminiscent of the TNG / DS9 era and does away with most of the eye gouging modern track art in which everything is either dark and dreary or so bright you can't see the screen.",
      "date": "Sep 30, 2022",
      "rating": 4.0,
      "episode info": "Season 3"
    },
    {
      "review": "This is now in my opinion literally the best Star Trek offering sense before voyager.",
      "date": "Sep 30, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "The best Star Trek since the Original and Next Generation. It's fantastic how our characters are growing learning that they are not as \"useless\" as they thought during the first 2 seasons. This show is pure Star Trek a fantastic way to introduce newer generations to the franchise!",
      "date": "Sep 17, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Muy bella.una gran animacion buen humor inteligente ain miedo a la burla seria y bella de las los.mismos eventos de otras series de la.misma saga la recomiendo",
      "date": "Sep 16, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "Three episodes in and nothing has been learned from either seasons 1 or 2. Badly written, dated animation and, worst of all for a \"comedy\", deeply unfunny. I can't wait for the contract Paramount has with Kurtzman/Secret Hideout to end. They hate Star Trek. I've now seen the season finale... please make it the show finale!",
      "date": "Sep 10, 2022",
      "rating": 0.5,
      "episode info": "Season 3"
    },
    {
      "review": "Rather annoying principal character.",
      "date": "Aug 31, 2022",
      "rating": 1.0,
      "episode info": "Season 3"
    },
    {
      "review": "THIS AS BEEN ONE OF THE BEST OPENING EPISODES EVER, all the reference to the Old trek movies especially First Contact Easter eggs in the first episode and DS9 in Episode 6!\nCan't for the final episodes!",
      "date": "Aug 27, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "So pleased to have Lower Decks back.  The season opener was very entertaining, especially with its nod to Star Trek: First Contact.",
      "date": "Aug 26, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "LOL, the funniest 10 episodes ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "date": "Aug 26, 2022",
      "rating": 5.0,
      "episode info": "Season 3"
    },
    {
      "review": "I hope this show goes on for years. Different take on Star Trek, as it's comedy and showing the lower strata crew; all while still feeling like a Star Trek product. \n\nSome of the Star Trek series have missed the mark of what Star Trek is, but this isn't one of them. Fabulous stuff, with great characters, plots and storytelling.",
      "date": "Aug 26, 2022",
      "rating": 4.0,
      "episode info": "Season 3"
    }
  ]
}