{"title":"Columbo 2.0","review":"This show is fun,it's columbo 2.0 but with a goofier columbo. Like columbo,she immediately knew who did it in episode number one. I love the humor and goofiness of Arlene. Lol (sorry,couldn't resist) the show is refreshing and reminds me of the greats in my day. Columbo,McCloud,Hart to Hart,McMillion and Wife and so forth. Only 1\/2 way through first episode and definitely hooked. I hope the writing holds up,it gets an audience and runs for a long time. It's really rare we get a show the last few years that's not trying to push some agenda on me. I will definitely be watching every episode. Give it a try.","rating":"8\/10","date":"5 March 2024"}
{"title":"Elsbeth Grows On You","review":"Emmy winner Carrie Preston stars in her own series about the Chicago attorney moving to New York City and serve as outside observer. I think the Kings wanted to explore the character in a different light than a courtroom. The episode begins with the actual crime. The audience knows the murderer and why before she does. Unlike Columbo, we don't get enough time as the episode is only a hour long. I love Carrie Preston though. Her character of Elsbeth is quite quirky and entertaining. She does grown on you, She had a history of defending criminals. It was only the first episode. Elsbeth was taking in the city as a first time tourist.","rating":"8\/10","date":"1 March 2024"}
{"title":"Female Columbo and I love it!","review":"Wife and I watched the first episode and immediately fell in love with Elsbeth. While she reminds us of Columbo, she is her own person and we love it. She is quirky and devilish. She has kind of a gleam in her eyes that lets you know there is a lot going on behind them. She is witty, funny and possesses the wonder of a child and the disposition of someone I would like as a friend in real life. You learn from the beginning she has seen a lot but does not appear to let it darken her view of the world around her. So far the cast of characters come off as reasonable and for TV surprisingly realistic. We are patiently waiting for the next episode and hope the show continues to shine.","rating":"9\/10","date":"2 March 2024"}
{"title":"The Good Elsbeth","review":"Elsbeth has come back. We are delighted.For those who are not acquainted with her, it is a come-back indeed, as she is (to my knowledge) the only secondary character who has outlived not just one show (as Saul, of Better Call Saul), but two different long and successful series (The Good Wife and The Good Wife) and who has won people's heart to the extent of deservingly having her own show now.Reencountering her in The Good Fight was a lovely surprise years ago, I remember. Meeting her again in this show promises to be truly exciting. The first episode was a pleasure, although the action seems to have a more comedic vein here than in those other productions. (Carrie Preston can do comedic passes while doing crime investigation indeed, and the hybrid works.)The winks to fans of The Good Wife\/Fight were there too. Will we meet Cary Agos here again? Oh, that could be great!Elsbeth's kooky and loony attitude to lawyering now seems to be transferred to police internal surveillance. Don't be fooled by Elsbeth. Her brain is razor sharp, behind her apologetic, oddball and candid habit of annoyingly intruding into the work of the smart-asses who know it all. You can imagine the rest.It may be the case that Michelle and Robert King will make it again with this new show, much to our enjoyment. I hope so.","rating":"10\/10","date":"2 March 2024"}
{"title":"Love This Show and Carrie Preston!","review":"I loved this character from the first time on The Good Wife and then when she moved on to The Good Fight I was thrilled. I am so pleased that \"Elsbeth\" now has her own show. Notice several reviewers complained that it was just \"Columbo\" and no police work was shown. That is because it is NOT a \"cop show\", she is an attorney. Carrie said in an interview that when presented with playing the character 14 years ago a \"Columbo type\" character is exactly how it was described to her, so obviously the Kings have done a wonderful job with the character and the show.Carrie Preston is wonderful. Evertytime I see her my day is better. I hope this show is given a true chance to succeed because it can. I hate we have to wait a month to be able to see it on a weekly basis but I will be watching for sure. EXCELLENT.","rating":"10\/10","date":"2 March 2024"}
{"title":"I love this character!","review":"If you loved Elsbeth on The Good Wife or The Good Fight, you'll really love her here, on her own show. I was thrilled when this show was announced and it did not disappoint.The Kings have done a masterful job of continuing Elsbeth's quirky character. The show most definitely has a Columbo feel to it, as the who-dunnit part is revealed to the viewer early in the show. As always with the Kings, the writing is fantatic!And let's talk about Carrie Preston. She is just spectacular as Elsbeth. She has now played this character for over 14 years over three different shows and I can't but smile every single time she's on the screen. Ten stars from me!","rating":"10\/10","date":"1 March 2024"}
{"title":"What a Nice Surprise(!)","review":"I haven't liked any TV network shows in ages -- but I loved Elsbeth. It's an updated female Columbo-type character who keeps challenging and surprising us. She seems daffy -- as she overtly plays Cat and Mouse with an ingenious murderer.The show mixes dark elements with enough humor to keep it light and entertaining. Reminds me of the \"good old days,\" when I actually looked forward to turning on the television.Great energy. It's nice to see a quality, character-driven show again.They totally nailed every Beat and Plot Twist. Top notch writing and performances. I'm so glad the Kings are back...","rating":"10\/10","date":"2 March 2024"}
{"title":"What a Waste of a Great Character!","review":"I WANTED to love Elsbeth, I loved her in The Good Wife\/Fight and loved Carrie Preston in everything from True Blood to Claws and this show wastes her talent and sullies her character. The writing\/plotlines are so unbelievable, they're insulting. As an attorney, Elsbeth would gather little snippets of info and file away things that people said and look at things several different ways. As a second-rate Columbo, she meets the killer and apparently just gets a feeling that they are the killer and it's so clumsily done, it makes me miss a 50 year old show like Columbo. Do better guys...Carrie Preston, Wendell Pierce and Elsbeth deserve it!","rating":"6\/10","date":"11 May 2024"}
{"title":"Amazing show, so fun.","review":"Absolutely a 10\/10 for the first episode!No time was wasted; the pacing was superb. I was captivated throughout the entire hour, and it just breezed by.The writing is exceptionally clever and humorous, ensuring a constant smile. Surprisingly, a character that might be perceived as annoying is actually comes off quite charming.The only critique is the portrayal of police competence or engagement. However, one could argue that this mirrors real-life situations, considering what we know about the police... and their gross mishandling of things.Additionally, it's reminiscent of Sherlock Holmes, who consistently highlights the police's incompetence in noticing small details.","rating":"10\/10","date":"1 March 2024"}
{"title":"Meh","review":"I tried three episodes and am giving up now. It was clear from the beginning that this was a remake of the old Columbo series with Peter Falk---using a female lead. The bumbling detective but always knowing and apprehending her suspect. Plus it's a little too formulaic---the reason I don't like Blue Bloods and other series. Her voice is frankly annoying--the tone and the Fargo-like Frances McDormand accent. Layering the crazy fashion sense and tote bags is a ploy and then we can add in the TV series McCloud, starring Dennis Weaver in the 1970s show that had outsider\/cowboy coming to Manhattan to settle up the district scores. I do like Only Murders In The Building, the late Breaking Bad, Better Call Saul : even Monk was a great and engaging show. This series is missing something.","rating":"6\/10","date":"5 April 2024"}
{"title":"Great Right Out of the Gate","review":"I was hesitant about this show; because Elsbeth, in my mind wasn't a main character. A little of her goes a long way, I thought. I was wrong.Carrie Preston was just the right mix of zany with the ability to pull back a bit and let the story take center stage. I thought she and the show were excellent.The supporting actors were seamless and it felt like they all were in a mid-season groove even with the first episodeI enjoyed every minute of the premiere. I love the mix of comedy and drama. I was involved in the crime part of it but laughed a few times, too.Well-written, entertaining, with a bit of a bounce. I can't wait to see the next episode.","rating":"10\/10","date":"1 March 2024"}
{"title":"Officer Blanke","review":"I've watched Columbo and he definitely wears down the bad guy, I see some of that \"spark\" with this series but ...The overall crimes are interesting, the storytelling I hope will improve. I watched about 6 episodes. Carrie \/Elsbeth toned down the quirk in latter episodes TY. I do not appreciate the derogatory \"boomer\" references and it turns me off; nope not a boomer, but show some respect because writers who came before, can write circles around those today. Officer Blanke is actually my fav character, she seems the most authentic, realistic of all: young but smart and observant, open-minded, respectfully defiant and helpful. The actress is capturing that. I will give the show a few more episodes before deciding.","rating":"6\/10","date":"27 April 2024"}
{"title":"Weak writing ruining a great character","review":"On The Good Wife (2009) and The Good Fight (2017), Elsbeth was a terrific character who won cases by using her brilliance and ability to come up with unique solutions to tough cases others couldn't find.That's not so in this series. Here she solves the same generic, run-of-the-mill, Murder She Wrote type simple crimes other amateur detectives have been solving on TV for years.And they're so easy to solve, anyone could do it, except, of course, the actual trained detectives who look like idiots as they miss obvious clues every step of the way.I'm shocked and disappointed that the same creators who produced Good Wife\/Fight and Evil (2019) approve such amateurish boring scripts and cartoon villains.","rating":"2\/10","date":"20 April 2024"}
{"title":"A Breath of Fresh Air","review":"Elsbeth (Carrie Preston) is so infectious. Her character's zest for life and people makes me want to smile, stand up and cheer. Cannot wait to see how the show progresses. Also love that Arlene and Bill (True Blood) were back together for episode one. The chemistry between the characters was top notch for the first episode. All of them acted perfectly together. No over acting or lull in the scenes (for me). And of course, it does not hurt that the show is created by The Kings, who are simple amazing with mixing drama, comedy, and crime all together. Hopefully, this show will last a while. Entertaining.","rating":"10\/10","date":"1 March 2024"}
{"title":"Well..","review":"A typical fish out of water show,about an individual who knows way too much(despite their profession)the clues and resolve come too quick.Her quirky,eccentric style does eventually wear thin,but have watched also worse.As the season goes on,perhaps her style will change.Murder She Wrote..Jessica Fletcher she is not!Reminds me of the Spencer Sisters before you even get into the mystery,the credits are already rolling.I mean come on.. Scooby-Doo gave us better,but writers once had talent & originality.The guest stars are almost better than leads,which isn't overall good.It this makes it.. I'm being generous to season 3,that be a network miracle.If bored watch otherwise,watch a better mystery show.","rating":"","date":"18 April 2024"}
{"title":"I second the review titled \"Columbo 2.0\"","review":"Robert & Michelle King are the talented writing duo responsible for some of the best network TV shows in recent years, including \"The Good Wife\" and \"Evil.\" After ending \"The Good Fight,\" 2024 brings us yet another such spinoff of \"The Good Wife,\" one named for that show's kooky lawyer character named \"Elsbeth.\" The Leap Day pilot episode sets up the show's clever premise: that her title character has been designated an impartial observer of the NYPD in a formal legal consent decree to hopefully ferret out any police corruption in the ranks. But in the meantime she cannot help but help those hapless officers solve their trickiest cases. Like Columbo's classic show, we are privy to the perpetrator's machinations, but get pleasure from observing the observer, Elsbeth, investigate and determine those guilty of the crime(s). Carrie Preston is outstanding in the lead role, and Wendell Pierce excels in the role of the NY Police Captain, who may or may not be on the straight and narrow himself. I'll revisit my rating of 8\/10 stars as we proceed.","rating":"8\/10","date":"24 March 2024"}
{"title":"Loved Elsbeth!","review":"Definitely a female Colombo but uniquely done. I loved every moment of it.This is a crime procedural so always ends with the crime solved. You know who the murderer is and you just watch Elsbeth put together the clues, and solve the crime. Elsbeth is quirky and charming, and just like Colombo she gets in the face of the murderer, constantly bothering and irritating them as she gathers the clues.The supporting cast is great. Puts a smile on your face. I like that this show is light and doesn't take itself seriously. While there's always a murder to solve, there's comedy as well. Great show!","rating":"8\/10","date":"3 March 2024"}
{"title":"Great fun...and clever","review":"So this is not a serious procedural drama with great legal savvy, but a delightful witty comedy\/drama with the charming Carrie Preston . I stopped watching The Good wife during her time in that show, so I was not familiar with the character. The show is more in the Columbo or Monk presentations , and does have some clever writing and a bunch of actors who add to the show. But ultimately it is the quirkiness and presence of Carrie Preston that makes this show work. This is one that I will definitely tend to watch.I did not like the silly promotional snippets the network offered as I almost didn't watch because they were annoying.","rating":"9\/10","date":"4 March 2024"}
{"title":"Pity","review":"I have to say I really, really, really, really love \"The Good Wife\" and \"The Good Fight\", and I'm naturally a fan of Michelle King and Robert King.When I saw this series, I was really happyBut there is a lot things must be said. This series lacks a main story line, so the entire plot becomes very thin. Each case is solved within one episode, and Elsbeth always got the perfect intuition aiming the perpetrator. It makes the whole episode bald. The audience doesn't feel surprised through out the whole episode. It would naturally become plain with less reasoning and less turning points. Comparatively speaking, I often feel overjoyed watching The Good Wife,and The Good Fight.Generally , it will lose a lot of fun of watching the movie, and it will also lose a lot of understanding of the legal case. The previous confrontation between offense and defense in the court was the most attractive part to me. I think it is a pity.","rating":"7\/10","date":"20 April 2024"}
{"title":"I've never seen The Good Wife...","review":"Episode #1\nGood wholesome entertainment. Elsbeth is a modern day female Lieutenant Frank Columbo. I enjoyed this much more than I expected. Stephen Moyer was great and it was even better to not hear him say, Sookie... every other line.I am eagerly awaiting for episode #2 & meanwhile, I shall watch episode #1 of The Good Wife considering that I had no idea that Elsbeth is a Spin-off character from that show. Let's see if The Good Wife lives up to it's IMDB rating. I can't believe that I never gave The Good Wife a look, but at that time 2009 -2016 my house GiGs were nonstop. Anyways, I got the time and place to take it in.Cheers from My Home Sweet Home, Cancún México!","rating":"8\/10","date":"1 March 2024"}
{"title":"A female version of 'Monk?\"","review":"1st episode her psychopathology really put me off. Like the writer went way overboard letting us know she was not right. Smart, intuitive, but a kook. In much the same way Monk was. I think Columbo was far more normal. IMHO. 2nd, 3rd episodes, her brilliance was turned up, and the nuttiness eased up, just a tad.I hope the remaining cast is whittled down, and 5 or 6 major characters developed further. At first I was thinking \"1 and done,\" but after the next 2, I'm probably going to watch it for a while. Hoping she is made more complex, as well. Remember Monk and Trudy, his dead wife. Was Elsbeth always this way, or did a life tragedy, push her towards a 'home.'Bottomline.........if you liked Monk, you'll love this.6.5 so far.","rating":"6\/10","date":"8 April 2024"}
{"title":"Nobody as annoying since Columbo!","review":"These comments are regarding the Pilot. I'm so, so delighted to see the return of Elspeth! My gawd she so hilarious. She's my absolute favorite goofball with an outsized brain. I remember thinking she was a Columbo in bright colors on The Good Wife. She's a delight to watch while exercising your own powers of observation. As some others have already mentioned, the show pacing was perfect from the start. That is no small feat as there are thousands of who-done-it shows in the past. The cast is great and the arrogance of the killer also reminds me of Columbo. Im buckled in for this ride. Thoroughly entertaining and so much fun!","rating":"10\/10","date":"25 March 2024"}
{"title":"It seems that Kings wanted to make their own \"Columbo\"","review":"I really love television series created by Kings. I expected that the another spin-off of \"The Good Wife\" series would also be a legal and political drama, but not an inverted detective story in the \"Columbo\" style.In fact, the 1st episode causes more associations with the 6th and 8th episodes of the \"Poker Face\" series. At some point, there is even a feeling that Natasha Lyonne's character in a horse costume is about to climb the white staircase.By the way, I would like to see Lyonne in this show as an guest star.As a result, it turned out to be a not bad series about a charismatic and loved by many character, but so far it does not corresponding to cinematic style of Kings.","rating":"7\/10","date":"1 March 2024"}
{"title":"Make it at least sorta believable","review":"This show had awesome potential. Great actress. Great lead character. Sadly the writers are embarrassingly bad, episode 1 she figures out the suspect because he added 2 spaces after a period? Seriously? The story was so poorly written it was hard to believe it was real. You felt like the writers completed it in one day. Episode 2 she just happens to be at the window to see the suspect have a purse she said she forgot. All the stuff going on in the apartment and she decides to go look out the window at the exact time the suspect walks buy. Then in interrogation she decides to walk in and tell the actual detective to take a break. It's do not even remotely believable. It's lazy. Sloppy.the writers should be embarrassed. Episode 3 I didn't even bother. I deleted it and removed the show from recording. If they aren't going to try, why should I bother watching? This show has no chance, and it deserves even less.","rating":"2\/10","date":"8 April 2024"}
{"title":"Another lady Columbo - Elsbeth needs better writers.","review":"We were all pleasantly surprised by the fresh take on theColumbo (1971)\"reverse mystery\" formula withPoker Face (2023), and here we have CBS's attempt at that sub-genre with mixed feelings.For those unaware, the \"reverse mystery\" is not a \"whodunnit\" but a \"howcatchem.\" In this format, the crime is depicted first in full view of the audience. There is no doubt \"who did it.\" The fun them comes when the detective comes in and finds all the \"little\" things the killer gets wrong, and we get to watch as the \"perfect crime\" slowly unravels.Peter Falkas Columbo did this to great affect - with his little questions, constant \"one more thing\" jibes, and the reveal - that point where the killer know's the game is up - is more often than not very satisfying. Not so much here.Now introduce Elsbeth Tascioni (Carrie Preston) who is well-known to those who follow theThe Good Wife (2009)franchise. She's a quirky somewhat \"neruodiverse\" lawyer who has a special point of view of the world, and has a talent for seeing the little things.Now Elsbeth is \"on loan\" to monitor the NYPD, and manages to ease her way into leading an investigation into a murdered actress. I have no love of New York or the NYPD, but I do take exception with law enforcement being depicted as out-right incompetent. There's a perfect crime scene, where the killer has covered all the bases to make the murder appear a suicide. Open and shut - where's the donuts. Only Elsbeth comes in and finds three or four completely obvious clues that suggest that the suicide might be murder. Of course, the cops are all bothered and unimpressed by her insights. \"Wait in the hall,\" she's repeatedly told. But she's having none of it, and continues to poke-and-prod and even does a \"one more thing\" bit.While I'm overall happy with this show - shot beautifully to make you believe that every day is sunny in New York (it's not) - the writing is extremely weak and it shows. No spoilers here, but - come on - the mystery is so shallow that it almost seems the killer didn't have to work so hard. The \"little things\" that Elsbeth notices are so obvious and in plain sight, a trained police detective would have to be completely incompetent not to notice them.This show is almost-but-not-quite family friendly. The violence is subdued, and the killer goes (in classic Columbo fashion) with calm and grace, even asking \"where did I slip up?\" So, no fist fights, no car chases, no shouting matches. Only disdain for Elsbeth to go \"wait in the hall.\"I have overall hopes for this show that it will improve. This installment was weaker than the weakest of Columbo episodes. Here's hoping the mysteries can get deeper and the \"howcatchem\" can be satisfying again.","rating":"","date":"11 March 2024"}
{"title":"Finally A Show That is Worth Watching","review":"Back in the days when I used to watch The Good Wife and The Good Fight, I had always hoped that Elsbeth would have a spin off. Personally, I felt this show is much better than The Good Wife! I love her character. How her brain works just amazes me. Most people have compared her to Columbo. For me, I can also compare her to my other two shows that have been cancelled, which are The Mentalist and Perception. All three shows mentioned above are people who can connect the dots \"outside\" the box and solve murders. There is one difference, Elsbeth is FUNNY while she is trying to connect those dots. It's about time there is something else worth watching other than the regular cop shows.","rating":"10\/10","date":"5 April 2024"}
{"title":"Refreshing surprise!","review":"I never thought we'd run into Miss Tascioni again, and voilá! There she is. I'm so happy seasoned professionals (as Michelle and Robert King) have extended their narrative universe (for the third time?) in one of the quirkiest, funniest, smartest characters they have envisioned.I also found this episode to be better looking and stylized than their previous efforts, because in all honesty, I had no idea what I switched on and the first images hooked me in... and then, five minutes in, Elsbeth Tascioni!I also appreciated the fact that this is not a whodunit show, because I was personally feeling some fatigue by the genre (we are witness to the crime as soon as the show begins).I can't wait for the rest of the season!","rating":"9\/10","date":"5 March 2024"}
{"title":"love it","review":"Carrie Preston's portrayal of Elsbeth Tascioni in \"The Good Wife\" and \"The Good Fight\" left a lasting impression on audiences, and now, in her own spin-off series, \"Elsbeth,\" she shines even brighter. As a fan of the original shows, I was thrilled to dive into this new chapter of Elsbeth's story.Elsbeth is a character unlike any other. Quirky, intelligent, scattered, and incredibly observant, she approaches her cases with a unique blend of eccentricity and brilliance. In her spin-off series, we see her using these skills not just as a lawyer, but also as an investigator, aiding the police in solving complex cases.One of the standout features of \"Elsbeth\" is its writing. The dialogue is sharp and witty, perfectly capturing Elsbeth's eccentric personality. The series manages to strike a balance between legal drama and character-driven storytelling, giving us a deeper insight into Elsbeth's world and motivations.Carrie Preston's performance is, as expected, phenomenal. She effortlessly embodies Elsbeth's quirks and nuances, making her a captivating and relatable protagonist. The supporting cast also shines, adding depth and complexity to the narrative.Visually, \"Elsbeth\" is a treat. The cinematography is stylish and polished, with each frame beautifully composed. The use of color and lighting enhances the mood of the series, creating a visually stunning experience.One of the aspects I appreciate most about \"Elsbeth\" is its exploration of Elsbeth's character. While she is undeniably brilliant, the series also delves into her vulnerabilities and insecurities, making her a more well-rounded and relatable character.Overall, \"Elsbeth\" is a must-watch for fans of \"The Good Wife\" and \"The Good Fight,\" as well as anyone looking for a smart, engaging legal drama. With its stellar performances, sharp writing, and stylish visuals, \"Elsbeth\" is a worthy addition to the Elsbeth Tascioni legacy.","rating":"10\/10","date":"22 April 2024"}
{"title":"Absolutely Delightful!","review":"Elsbeth is a delightful legal drama series that introduces us to the enigmatic and brilliant attorney, Elsbeth Tascioni. With?Her unconventional approach to razor-sharp wit, Elsbeth navigates to the complex world of law enforcement and criminal justice in new york city.Portrayed by the talented Carrie Preston, Elsbeth is a breath of fresh air in the legal genre. Her quirky mannerisms, offbeat fashion sense, and unorthodox methods make her stand out from the crowd. Whether she's cross-examining a witness or dissecting evidence, Elsbeth's singular point of view keeps us hooked.It's most definitely a must see!!","rating":"10\/10","date":"1 May 2024"}
{"title":"Derivative plots","review":"The lead character is well portrayed, enough to carry the other-words straightforward, and derivative plots.I enjoy the show, but there aren't any other relationships with the lead's coworkers to be able to carry separate individual plots during the shows.It's all built around a single person, counting on her quirkiness to carry it all. If they could bring in a consistent team seen each week and develop their relationships, this could grow into a compelling show.As is, there is nothing to emotionally become attached. There is no family like in Blue Bloods, no romantic tension like in Castle, no team with which to build interpersonal relationships and therefore emotional connections by the viewer in each hour's show....","rating":"7\/10","date":"13 April 2024"}
{"title":"Paying homage to Columbo","review":"Yes, it's very much like Columbo - which is a good thing. The concept is the same - we see who did it, why and how. Elsbeth deduces and the police finally agree with her. The writing is witty and, on occasion, laugh-out-loud funny. The acting is great too which isn't surprising since the average age of the cast is probably somewhere around 40-45. (Real actors, not pretty faces that read lines - but don't get me started). It will be interesting to see how the corruption aspect plays out. Hopefully it will be wound up by the end of the first season. In the meantime, don't take it too seriously. Sit back and enjoy.","rating":"8\/10","date":"17 April 2024"}
{"title":"Don't tell me who the killer is!","review":"I was so excited finding this show - Elsbeth was a favourite of mine on Good Wife - and the first episode lived up to my internal hype. Unfortunately now on ep3 and it's clear the show is going to be overly formulaic.The audience knows who the killer is early on so there's no mystery. We get to enjoy Carrie Preston's endearing and insightful way of deducing and announcing said deductions to the guilty one - played by the only vaguely familiar actor - who then begrudgingly see's her as a worthy adversary.The police then pause long enough from telling her she's 'simply there to observe' to realise lo and behold she's been right all along! However by next week they'll have gone back to dismissing her theories and going after the obviously too obvious suspect.As far as this formula goes, this show does it well.","rating":"6\/10","date":"28 April 2024"}
{"title":"Elsbeth Is A Winner!","review":"Yes, it's the Columbo revamped, but actress Carrie Preston as well as the supporting cast bring a freshness to this who dunnit.Thing is, just like in Columbo, we know who dunnit but watching Elsbeth's antics as she convinces tough NYC detectives and other naysayers that she knows what she's doing is delightful.From her quirky wardrobe to her Midwest openness and naiveté, she is a delight every week. Contrasting her almost childish quality with the tough New Yorkers is a joy to watch.Seeing her bring down the bad guys and seeing their dismay at being beat by someone who seems so unsophisticated is a joy. I highly recommend this show.","rating":"10\/10","date":"28 April 2024"}
{"title":"Misusing a word once is bad; multiple times it's toxic!","review":"\"Cancelled\"?? A professor sleeping with a student would fear being FIRED. (Even though it's always been a thing, as far back as there have been young adult students and teachers because ephebophiles are drawn to colleges and\/or teaching, duh.) The point is when the first two said it it was annoying. When the rest of the characters did so, it became lazy, fake-trendy writing.Also the intelligence of the main character is great; the vocal fry (if ya wanna get linguistically trendy) is less-great.I am also very unsure whether the return to *Columbo* format-literally watching the crime committed in the first minutes of the episode-will fly in 2024. That requires us to go all-in on the detective, as we did with the late, great Peter Falk but might not on Carrie Preston's Elsbeth...We will give it some time. Most shows need to settle in. I think it's amusing that the other characters are not falling for her wide-eyed naif act even though they just met her, though.","rating":"6\/10","date":"1 March 2024"}
{"title":"So Disappointing","review":"I was so excited when I saw this show being offered. I loved Elsbeth as a lawyer in The Good Wife and I was looking forward to a show with her as the main character. Therefore I watched the first three episodes before sitting down to write this review, because I really wanted to like this show. Unfortunately this spin-off is nothing like her role in the Good Wife. .The characters in this show are flat, stereotyped and one dimensional. The dialogue is trite and predictable. The acting is second rate and the story lines are just unoriginal. I honestly can't recommend this show. Spare yourself and skip this one.","rating":"1\/10","date":"8 April 2024"}
{"title":"Light and Breezy","review":"The quick pace and fun vibe help keep \"Elsbeth\" firmly in the entertaining category rather than any sort of serious, dramatic genre. It is a very nice change from the overly dramatic, hyper-realistic police procedural shows out there. I love Carrie Preston in this role. I never watched \"The Good Wife\" or \"The Good Fight\" but this one made me find those shows on streaming services and watch the episodes she was in (and catch a couple of references I never would have noticed). I have also rewatched each episode of \"Elsbeth\" at least two times simply because the main character is so delightful. The guest stars have kept the fun factor up as well.","rating":"10\/10","date":"1 May 2024"}
{"title":"Zany meets Columbo","review":"Loved Elsbeth in \"The Good Wife\" - and really enjoyed this first episode. Reminded me of the format of \"Columbo\", yet it did not feel old. I especially enjoyed the open sparing between Elsbeth and the killer.There was even a little nod to \"That Girl\" and the show made NYC look enjoyable and fun. Loved the nod to \"The Good Wife\" by threatening to bring in Cary Agos as a replacement attorney.And then when you thought it was over, a twist at the end. Great timing, the show moved along at an attention keeping pace.Great cast. Loved Wendell Pierce. He always adds gravitas to a show. Looking forward to the rest of the season!","rating":"10\/10","date":"3 April 2024"}
{"title":"Columbo would love Carrie ...","review":"What a wonderful homage to Columbo (whether purposeful or not) is Elsbeth. The writing, the acting, the touches of snark and humor, all great! Carrie Preston is so natural and believable as the brilliant, quirky, engaging Elsbeth and the supporting cast plays off of her light effortlessly. You will love that the writer's play into her strengths, including christening her character with a quirky name. Elsbeth Tascioni.That Preston's \"True Blood\" colleague Stephen Moyer joins the cast in the Pilot Episode makes the watch more fun. Though I searched for vampire references, alas, there weren't any. But I had fun trying! Can't tell you any more. Don't want to be spoiling. Watch Elsbeth. You won't be sorry.Favorite quote line?\"Let go of this door or I'll shoot you.\"Watch Elsbeth. Enjoy the cookies.","rating":"10\/10","date":"3 April 2024"}
{"title":"Refreshing!","review":"Such a fun show. So Happy they've created this show for her character. I've never watched the Good Wife, which I guess her character comes from. But, I love watching this every week!! Her outfits and purses crack me up. Haha her character is just a little hilarious to see.It's nice to have a character that is just a little reminiscent of Monk or Columbo. It doesn't focus on sex, innuendos, violence, etc. Refreshing to see a tv show that's just fun to watch and you don't have to worry about small children being in the same room.Hopefully the network keeps it around for a long while. We really enjoy watching this show.","rating":"10\/10","date":"20 April 2024"}
{"title":"Good, but not in the same league as the Good Wife\/Fight","review":"The Good Wife is not just one of the best legal dramas, but one of the top television programs made. I was a latecomer to the show. I didn't think it would be my bag, but it was featured in the documentary America in Primetime and I decided to give it a go. I was blown away. Easily a 9 out of 10.When the Good Fight came along, it seemed to me to take the best bits of the Good Wife and amp them up, and through some unconventional storytelling and up-to-the-minute social commentary made what was great about the Good Wife even better. 10 out of 10. My second favourite TV show after Twin Peaks.Both of these shows centre around a core group of characters who are essentially all playing the straight man with the whacky, quirky stuff happening around them. Think Colin Sweeney, Judge Wapner, Felix Staples, the freakin lightning balls and, of course, Elsbeth Tascioni.With Elsbeth, the whacky, quirky stuff is front and centre. With the rest of the cast playing the straight man, and I'm not 100% convinced that it works. Elsbeth was such a delight in the earlier too programs because there was limited exposure to her, and it felt like we were only seeing one facet of her amazing personality. With an opportunity to spend more time with her, maybe we would have a chance to see the other facets.Unfortunately, now that we are spending more time with her, it feels like this is still the only personality we see. Every now and then, she hints at her past life, her clients, her husband, where she grew up, but not enough to develop the character in a truly meaningful way.I've fascinated by the fact that a few other reviewers have likened it to Columbo, a show I only watched for the first time recently. It actually feels like someone went to the network as pitched it as The Closer meets Columbo. Like The Closer, we have a female lead, new to town, but who is a fish out of water. She doesn't know the city she's living in, her colleagues are hesitant about working with her, but they start to warm to her when they realise her unconventional approach is actually leading to results. Plus add on the Columbo-esque storytelling where the audience know who the criminal is and go along with the ride while our protagonist figures it out. In both instances, I feel like Elsbeth doesn't quite lives up to the calibre of those shows either.I am enjoying the show, and will likely continue watching it, but it definitely does not feel to be of the same calibre of The Good Wife or The Good Fight. I'm hoping this will change.EDIT: Lastly, has anyone in the production team actually seen Cats? I mean I haven't, but I at least know the song is called 'Memory', not 'Memories'.","rating":"7\/10","date":"13 April 2024"}
{"title":"Delightful","review":"I enjoyed Elsbeth on her appearances in The Good Wife, charming, a bit scatter-brained, but very intelligent and perceptive. A delightful character to watch.She now has her own, well deserved, show, as an attorney who's there under a consent decree to watch the NYPD.Carra Patterson as Officer Blanke meshed well with Elsbeth and was believable as a police officer.One mistake I noticed was that Agent Celetano, who arranged for Elsbeth to go to New York for the consent decree, mentioned the other attorney considered was Cary Agos, who died in season 7 of The Good Wife. It would be a miracle to have a dead attorney fulfilling a consent decree.Wendell Pierce plays Captain Wagner and as usual he's perfect for that role. Very believable.The casting is well done, the potential is there for a good series. I hope they stay away from the plots that doomed The Good Fight and the series lives up to the potential hinted at in episode 1.","rating":"9\/10","date":"9 March 2024"}
{"title":"Who played Derek","review":"Why can't I find who the actor was who played the groom. I thought it might be Pete from Ghosts. Why don't they list all the actors? Oh I need to write more so that they will post this. Hmmm...\nOkay well, I find myself liking Elsbeth. They might have borrowed a few plot lines, or ideas from Monk, but it's a fun show. Except that the criminals never tell her to bug off, like I would do. She has that Colombo MO where she shows up constantly. It makes you wonder exactly when she suspects the suspects, but I guess it's usually from the very first meeting, just like with Colombo. Okay I think that's enough words.","rating":"6\/10","date":"3 May 2024"}
{"title":"I really love this show","review":"As a big fan of Columbo, Matlock and of course the Good Wife this show is so refreshing. The quirkiness of Elsbeth keeps you wanting more. Great writing and so far appears to be cast well.CBS appears to be on a roll with great content.The only thing I hate is we only got 1 episode and due to the state of the union and the nba finals we have to wait an entire month for the next episode. I think the smarter thing to have done would have been to air a double episode so we could get to know the characters a little better before the 4 week break.Please keep this show on, I will be watching and continue bringing these great shows.","rating":"10\/10","date":"10 March 2024"}
{"title":"A Fun Crime-Solver","review":"If you can get past the first episode, which feels like a direct ripoff of \"Columbo\", this can be an enjoyable series. Perhaps it is meant to be an homage to the Peter Falk character. By the fourth episode, I was actually looking forward to watching Carrie Preston in her portrayal of Elsbeth Tascioni.This humorous crime solver is not too insightful so that the stories feel unbelievable. Elsbeth is not a superhero. She is a kind-hearted person who is smart enough to disguise her powers of deduction with a veneer of absent-minded lack of focus. She notices the small details that matter (and some that don't) while working well with others.By the fourth episode, she has established a strong working relationship with officer Kaya Blanke (Carra Patterson), who comes to recognize the value of Elsbeth's talents. Their partnership promises to elevate the remainder of the series.I hope Wendell Pierce (who plays Captain Wagner) becomes a larger part of the stories. As on \"Suits\", he is always fun to watch.Like \"Columbo\", the series needs good \"villains\", and so far they have delivered. Deliciously arch antagonists really make a difference. The castings of Jane Krakowski and Jesse Tyler Ferguson were strong steps in the right direction.","rating":"7\/10","date":"17 April 2024"}
{"title":"So predictable and amateurish.","review":"Elsbeth is an attorney employed to carry out due diligence on the Police division after corruption claims but pokes around and solves murders. It takes around 10 minutes each episode to layout the plot and after that Elsbeth miraculously discovers unlikely clues everywhere to wrap up nicely in 40 minutes. There is no thrill, no drama. It's a walkthrough for all these actors and is plain dull. Good actors not even having to think, along with the audience. The quirky, no threat style protagonist is an old style trope. You know she's going to solve the crime single handedly. We all see it coming because there's no mystery. No thrill. The actors giving a slow wink to the camera is the next step. The sort of show that'll go on for ever because it's low budget. I'd cancel it after one season. CBS have been very lazy with this!","rating":"2\/10","date":"9 April 2024"}
{"title":"Enjoyable","review":"This is a watchable show as Carrie Preston gives a good performance as Elsbeth. I like the character (sort of a female Columbo with shades of Sherlock Holmes and Encyclopedia Brown thrown in) and the format of the episodes. Each mystery and episode features a good story and \"villain\" to deal with, and Elsbeth does a good job in figuring it out with what she has to work with, and the character is fun to watch. Her supporting cast is too, especially Wendell Pierce. The episodes are certainly unique. If you like a spunky character with decent cases to work through, give this show a try. You might like it.** 1\/2 out of ****","rating":"8\/10","date":"11 May 2024"}
{"title":"Smartly done!","review":"\"Elsbeth\" bursts onto the small screen with a refreshing blend of wit, intelligence, and humor in its pilot episode, setting a promising tone for what's to come. Written with finesse, the episode seamlessly intertwines clever investigation with laugh-out-loud moments, making for an engaging and thoroughly enjoyable viewing experience.At the heart of the show is its lead actor, whose impeccable performance injects life into the character of Elsbeth. With charisma and comedic timing, the actor effortlessly embodies the quirks and complexities of the protagonist, drawing viewers into her world from the very first scene. Elsbeth's quick wit and unorthodox investigative methods provide ample opportunities for comedic gold, and the lead actor rises to the occasion, delivering each line with precision and panache.What sets \"Elsbeth\" apart is its ability to balance humor with astute storytelling. While the pilot episode is undeniably funny, it doesn't shy away from tackling serious subject matter. The clever writing navigates seamlessly between comedic moments and moments of genuine intrigue, keeping viewers on their toes and invested in the unfolding mystery.One of the pilot's standout strengths is its narrative structure, which expertly weaves together multiple plot threads without feeling convoluted. As Elsbeth navigates the complexities of her latest case, the episode skillfully introduces key supporting characters and lays the groundwork for future storylines. Each character is distinct and well-defined, adding depth and dimension to the show's vibrant ensemble cast.Visually, \"Elsbeth\" is a treat to behold, with stylish cinematography and dynamic editing enhancing the overall viewing experience. From sweeping aerial shots to intimate close-ups, every frame is thoughtfully composed, immersing viewers in the show's richly detailed world.In summary, the pilot episode of \"Elsbeth\" is a triumph, seamlessly blending humor, intelligence, and intrigue to create a captivating viewing experience. With a talented lead actor at the helm and a sharp-witted script driving the action, the show promises to be a standout addition to the television landscape. If the pilot is any indication, \"Elsbeth\" is poised to become a must-watch series for fans of smart, character-driven storytelling with a comedic edge.Been seeing investigative TV series and this one so far is the funniest one I'd seen. The combination of comedy and serious crime investigation is phenomenal.","rating":"9\/10","date":"19 March 2024"}
{"title":"Is she really Misses Columbo or more?","review":"I guess that everyone who knows Inspector Columbo will have this thought a few minutes after watching the first episode. Yes, on one side it is the same kind of plot like Columbo in a female version. But after realizing that you also forget that a few minutes later. Why? Because her character shines through everything in such a friendly way that it really doesn't matter that much how she solves the crime. It is more or less watching Elsbeth as a quirky character that draws you in. It generates such a positive feeling when watching this series. That is the reason why i will not stop watching it. As a tv series junky, i have to say this is different. Elsbeth is my friend now.","rating":"9\/10","date":"9 May 2024"}
{"title":"Charm and disarm","review":"Elsbeth is a strange character name but that is the only strange element in this new Paramount series. It is a wonderful reflection on the Detective drama of the 70's and 80's.This is one of the classic charming characters that we don't see so much these days.Elsbeth is a show that has a refreshing positive vibe that sets it apart from much of the heavy message shows around today. Hope they renew this one for a new season.In the first episode we feel the connection to shows we love like Columbia, through a character we love fromThe Good Wife series.I for one look forward to the future shows with glee.","rating":"9\/10","date":"13 May 2024"}
{"title":"Language","review":"This is a Cute show but does she have to use the name God?I'm not understanding why people think you have to blasphemy the holy name of God in conversations. God's name should be revered and not blasphemed.Sorry but that's how I feel. Until the name of God is discontinued and sentences like \"oh my gosh\" or \"oh my goodness\" used instead I feel this is not watched in my home.I commend you that you have not had sexual content which is promising. Minors can inadvertently watch this show or see the commercials so it should be children approved\/appropriate.Maybe you can have a conversation with the writer of this show. Thank you.","rating":"6\/10","date":"10 April 2024"}
{"title":"Best Show when I come home","review":"It's super intriguing and exciting with the crimes that take place and the comedy that Elsbeth and the police team bring to the show takes the edge off. When I get home at night from a long day working, it's the perfect thing to relax but also have some suspense and mystery to close my day. The cinematography is also amazing. The perfect angles filming are used to convey certain emotions, bring out the comedy, and demonstrates the eccentricity of Elsbeth. There are more awesome things about this show but I don't want to give spoilers. I highly recommend watching this show and I hope it comes back for season 2!","rating":"10\/10","date":"18 May 2024"}
{"title":"Exactly what we need","review":"Elsbeth is a breath of fresh air. Even in the good wife, she was the best written character and best portrayal. And theres the anticipation, what will she do next? Notice how most shows these days are subpar or basically unwatchable? Ever since covid. Seems everyone else wants to churn out episodes in half the time and half the effort. We've needed a show like elsbeth for a looooong time now. (more mystery series please.) Used to be a lot of shows at this level of greatness to choose from -- house, dexter, monk... now elsbeth is the only new one that is as good. So please keep it coming, and for the love of the god called tv and all things holy, do n-o-t cancel this show.","rating":"8\/10","date":"17 May 2024"}
{"title":"A Distaff Mish-Mash","review":"Sadly, \"Elsbeth\" had better promos than it has had shows. The promos made it look promising. However, it has all been done before. Talk about a mash-up of \"Columbo\" and \"McCloud\"! This show has it hands down. \"Elsbeth\" has all of rube-like charm of \"McCloud\" and a bit of the pseudo- dimwitted charisma of Lt. Columbo. However, there is not an original bone in this body of work and that's too bad.I don't see how Elsbeth. Tascioni, is supposed to come from, or even lived in Chicago. This woman has all of the sophistication of an eggplant. Granted, she is enthusiastic and observant, but what a buffoon! If I was from Chicago, I'd be insulted.All this aside, the plots are thin and formulaic, the characters are stereotypical, and, it has all of the depth of a kid's wading pool. C'mon CBS! Put this show and your viewers out of our misery! Surely to goodness and mercy you have something better that this to offer us.","rating":"5\/10","date":"21 April 2024"}
{"title":"Surprisingly Very Good","review":"Gave up on network shows quite a while ago, especially comedies. I did not find the majority of them to be funny and dramas, seemed to me, to be formulaic. Based on the success of The Good Wife and The Good Fight, dramas, not comedies, I will now watch them. Therefore, I was not familiar with Elsbeth as a reoccurring character on either of the shows. I'm familiar with Carrie Preston and I think she is a fantastic actress.Decided to watch Elsbeth solely because of Carrie Preston and I was pleasantly surprised that I really liked the show and will continue watching it. I like that we are shown how the crime happened at the beginning of an episode. Carrie's voice is unique and I got used to it quickly, it fits the characters personality. There has been terrific actors making guest appearances in each episode to support the great cast. My hope is that the show will be picked up for a second season and that the writing gets better, based on reviewers comments.","rating":"8\/10","date":"8 May 2024"}
{"title":"Enjoyable comfort show","review":"This show is so pleasant and fun to watch! As a Murder She Wrote and Columbo fan I think it's just like those shows with a modern take on the crimes. The lead who plays Elsbeth does such a great job with the character and the special guests for each episode are such a nice touch as they keep things fresh and something else to look forward to. The stories are interesting and the main plot line that runs through connecting each episode is interesting and clever. I really hope that this series continues and gets a second season. I would have never even known about this show if I hadn't to happen to stumble upon in my Amazon recommendations!","rating":"10\/10","date":"16 May 2024"}
{"title":"Yes its formulaic , but it is so well made!","review":"There is a Columbo (especially the \"the viewer knows everything\"), Monk and every other quirky detective show ever made, even the doubtful commanding officers... but this is such a good formula, so well made!Of course this is not a \"whodunit\", it is not intended to be. I mean, by that criteria, Columbo wasn't , either.And of course there is the character of Tascioni, which was something I liked every time she appeared in one of the \"grandparent\" shows. Carrie Preston looking the way she does, doesn't hurt, either.I just hope they don't limit the eccentricities.. no! Punch up the volume, let Preston act out!","rating":"8\/10","date":"6 April 2024"}
{"title":"Female Columbo with much more quirkiness and pizazz","review":"Elsbeth is a great crime drama show that has fantastic writing and a wonderful cast. Elsbeth may seem befuddled but she has an eye for details and is like a hound dog on a scent once she has her suspect. She is witty, charming and cast well in this role. Much luck in future episodes! I can't wait! When I first saw the trailer for the first episode I thought I would give it a shot and quickly watched the first few episodes as I was left wanting more after the pilot. The story line keeps building as more of the back story is revealed as to why a lawyer from Chicago is now assigned to \"work with or observe\" the New York City police department.","rating":"10\/10","date":"16 April 2024"}
{"title":"Easy and refreshing","review":"I rarely enjoy quirky characters, especially in a crime solving setting but this Elsbeth is unexpectedly very pleasant to watch! She is smart, humble and definitely quirky but not in a cringy way. Her acting is refreshing, cute and fun. The crimes might to be so smart and well thought through but the point of the show is that those doing the crime get caught, so it makes sense. Plus it's not a serious show, it's more of chill and have fun kind which is felt very strongly through the palette of the side characters, many of whom are also lighthearted and comical. Overall, an easy pleasant watch.","rating":"10\/10","date":"9 April 2024"}
{"title":"Love this show!","review":"Improbable but lovable. This is a great fun show. I guess like others it reminds me of Columbo but with more humour. If you have ever seen the UK show Murder in Paradise, it kind of has that vibe where there is a lot humour. The characters are fun and bright and likable, and happy. Moves along fast. Pretty great guest stars in the episodes. I haven't seen the main character in a lot of shows, so I'm not sure if this is a new character for her, but she does an amazing job capturing the essence of Elsbeth. I really hope it stays around for awhile. The episodes so far are fun and interesting. A really good watch.","rating":"9\/10","date":"8 April 2024"}
{"title":"Nothing but fluff","review":"Although I like Carrie Preston as an actress and the character is a good one, quirky and all, the show is ridiculous. She shows up at a scene and within 30 seconds she has it all figured out. The acting is not great and storylines are shallow. Don't think her character is leading material. She's better as a supporting character. Could do way better. After three episodes I'm done.The back story seems superficial as you see nothing to show that the Chief is crooked.I will be sticking to British television as there is way more substance than what I'm finding on American tv these days. Britbox has way better tv.","rating":"3\/10","date":"10 April 2024"}
{"title":"Columbo","review":"Quite a surprise. Of course, I am always intrigued when a new shows comes up on my radar, especially with a large amount of press, and social talk.This one has an (almost) unique premise. Of course Elsbeth is a precocious, somewhat annoying, character but after awhile her charm is stronger than her annoying idiosyncrasies ... and after awhile, you see the similarities to other older crime or detective shows.No, this is not a spoiler. But please argue with me if you disagree. First, you can see the OCD qualities of Monk, but more personally I see Columbo in her personality.Oh, another thing ... LOL.","rating":"9\/10","date":"7 April 2024"}
{"title":"Great show!!","review":"I love this show, it reminds me of the hit show columbo. The two story lines are great. I love how she is so quirky and puts together the mystery each week. I.am.so excited to view weekly on cbs or paramont. Show is upbeat mystery in such a time where everything is so serious world. I love how the actors and actress bring the storyline together each week. Just how columbo was a pest to killer while unfolding murder, Elsbeth has the same character in a modern way. Very clever in noticing things that most will miss and love how many know actor and actress are guest character each week. Just an awesome show.Praying it renews for 2nd season.","rating":"10\/10","date":"16 May 2024"}
{"title":"Carrie Preston never disappoints!","review":"Being a fan of The Good Wife, and an even bigger fan of The Good Fight, I had to check this out. Elsbeth is always a fan favorite. The consensus amongst fans was often the same over many platforms. Elsbeth needs more screen time. Bring her back for another episode. Or my oddly foreshadowing favorite, \"I'd watch a show about her\". I cannot say anything bad about this show. It does seem like the people that do, are not prior fans of Elsbeth or TGF\/TGW. I have heard Poker Face comparisons and Colombo comparisons. I have watched both yet somehow it still doesn't click for me entirely. I find this show to be unique, much like Elsbeth herself. In conclusion, if you are an old fan of Elsbeth or going in with a fresh perspective, give it a chance. You may enjoy it.","rating":"10\/10","date":"7 April 2024"}
{"title":"Loving it!!","review":"I am really loving this series\nI first came across Elsbeth in the Good Fight and thought wow what a quirky character, was even happier when they branched out a spin off about her!Carrie Preston is a wonderful actress and really carries this character off with charm, humour (some annoyance) but overall a wonderful person.In case anyone reads this and is unaware she is married to Micheal Emerson (person of interest, fallout) who also plays quirky charactersI'm liking the different episodes and pleased it's not always murder but other areas of justice.Very happy it has been renewed for a second season.","rating":"8\/10","date":"22 May 2024"}
{"title":"Didn't expect to like this one but here we are","review":"I nearly by passed this one. Seemed like just another procedural with nothing to offer except a \"quirky\" lead who appeared to be a wannabe female sherlock.I was pleasantly surprised by this one and found Elsabeth grew on me. The first episode had me ripping my hair out a bit but after that it gets is grove and her a-dork-able nature is kind of refreshing. Its nice to see someone who isn't model perfect and has all the lumps and bumps of a real person in the lead but also is a kind and caring person. She's like your quirky grandma and has all the bags to go with it.Highly recommend. I was completely sucked in by the end and I'm disappointed I only have one more episode to go. Its binge worthy and the support cast while blander than Elsabeth, have their own realism to their characters. I like it for being brave enough to give someone unconventional the lead and make it work.Great character piece and Elsabeth doesn't grate on you and the writers get how to let everyone shine without it being glaring or jarring. Give it a go and see for yourself.","rating":"10\/10","date":"20 May 2024"}
{"title":"lady Columbos everywhere!","review":"When I saw the capsule description of Elsbeth, I thought, well that sounds dumb. Then I realized that this was the goofy-yet-brilliant character I had loved when she appeared on The Good Fight (unbeknownst to me, she had previously been a character on The Good Wife, which I didn't watch much of).Carrie Preston's Elsbeth is a fascinating character who uses her genuine goofiness and friendliness to make suspects underestimate her prodigious detective skills.Not that Elsbeth is a detective. Instead, in a rather strained premise, she's a lawyer sent to investigate a police department who just pokes her nose into every murder case that comes her way.Each episode starts with us watching the murderer committing the crime, then the rest of the episode is Elsbeth, who seems to instantly recognize the killer, pestering them until she finds the clue that reveals all.If this sounds familiar, well, it's both the formula for the old TV series Columbo and for the current series Poker Face, which also gives us a female version of the deceptively harmless detective.While Poker Face is a little more original in design and premise, and is arguably a more interesting series, I really like them pretty much equally. Each has an engaging star, an interesting villain, and a satisfying reveal.I will say that Poker Face has smarter killers. Some of Elsbeth's suspects would probably have been caught by pretty much anyone. But it's always fun to watch everyone realize that Elsbeth is more than meets the eye. The trick of this series is each week there's a new killer and a new police detective who dismisses Elsbeth out of hands, but the show doesn't pretend that there aren't rumors about how smart she is.The main difference between this and Columbo is, Columbo was from a time when no one expected a story arc. Now that such things are required, there is this whole story involving a police captain that just distracts from the fun of the investigations. But it doesn't suck up a lot of time, so it doesn't do any real harm.The acting by the sidekick cop and the villains (who Elsbeth seems to genuinely enjoy talking to) are very good, but still, this is Carrie's show all the way, and Carrie carries it beautifully. You should watch it.","rating":"8\/10","date":"19 May 2024"}
{"title":"Not as impressed as I thought I would be","review":"I loved Elsbeth on the Good Wife and the Good Fight, but so far I'm not impressed with this solo effort for her. It's like Columbo without the suspense, and I should add that on Columbo you knew who the killer was in advance; back them the killers were a whole lot smarter than the characters in Elsbeth. That fact makes it a bit boring after a while. We've seen her hijinks before and after a while they just irritate you.I will probably continue to watch till the season ends. But I'm not enjoying it as much as I hoped I would. Really disappointed. Maybe it will get better when they reveal more.","rating":"5\/10","date":"2 May 2024"}
{"title":"The Tv Gods have answered our prayers, or at least mine.","review":"I loved the oddity played by Carrie Preston on The Good Wife and always wished Elsbeth had her own show, and now she does. This spin off years later is just what the TV ordered and what I'd dreamed for. I remember thinking to myself when we first met her on the old show, I'd like to see more of her. Elsbeth is the right amount of quirk, comedy and emotion.The stories are complete like a Perry Mason original episode, extwe know who the killer is and get to watch as Elsbeth does her thing and peels back their evil layers. The underlying storyline is subtle and tricky to figure out, but when it comes due, it's like yes!I can't wait for more episodes and more seasons. Remember producers, law and order has been on for decades and never managed to have a repeat, but they're so boring and serious since Jerry Orbach. Elsbeth is just the right about of crime and comedy.I want more.","rating":"10\/10","date":"22 May 2024"}
{"title":"Ridiculous, lazy and so wasteful.","review":"The first episode provided an encouraging opening with good contributions from seasoned actors. This was one show I was really looking forward to seeing more of and with the pilot released well in advance of the other episodes, it was with some excitement I awaited the rest.What a massive disappointment and I can only assume that anyone giving this show more than 5 stars has based that rating on the 1st episode- either that or they've a very low iq.Read every review at 5 stars or below and you'll have a good idea how bad this show is. There is no mystery to the criminal event Elsbeth solves every week. They literally show the crime being committed in the opening credits and from there it's a walk through with Elsbeth solving the crime. No set locations or expensive scenery, this is all shot from a single lot, cheap editing and producing but nothing to be cheerful about. I rarely wrote reviews but made an exception at the indignity of passing this show as entertainment.","rating":"1\/10","date":"16 April 2024"}
{"title":"A modern day version of murder she wrote","review":"No joke when I was a kid, I watched murder she wrote with my mom every Sunday. But the way this Attorney comes up with solutions reminds me so much of the character Angela Lansbury played with the manner she figures things out or deduces. Only watched episode five or six about the murder at the tennis competition, but must say it felt highly formulaic. Perhaps there's some special love from this character being on other TV shows but taken without that it's rather mundane.q I feel like the intent is to make it quirky and odd and a reverent. Honestly, it feels more goofy and silly. I guess I would recommend Will Trent on ABC before this.","rating":"4\/10","date":"19 April 2024"}
{"title":"Loved Elsbeth the lawyer, dont like the detective","review":"Elsbeth was one of my favourite characters in Good WIfe and Good Fight. The reason she was likeable was, she was used sparingly and solved difficult legal situations there.Here the whole plot seems to bounce of her exuberant personality not on her legal acumen. The exuberant act gets tiring after a point and I can feel the actress trying too hard to be likeable. Then the show creators are also trying to sell NY in between.The sleuthing part doesnt work at all, police are portrayed as completely incomptent and Elsbeth knows it all. And this was such a weak case.Highly recommend they do better writing or bring some legal angle for her to argue to make the series more interesting. Else its a failed spin-off which is sad since \"The Good Fight\" was one of the best spin-offs ever.","rating":"4\/10","date":"14 March 2024"}
{"title":"So badddddddddddd so sadddddddd","review":"The difference between this and the good wife is astounding. The good wife was smart, well written, good stories that were relevant. Here, elsbeth has same great insights, but every other character is stupid.And, it's so obviously bad that it's not even funny. Obviously the point is that criminals are stupid, but in this instance, it's so stupid that it makes me really hate the whole show and I was so looking forward to it.I don't mind when bad guys win or when good guys win, as long as it's a good well written story. So far, I am 5 episodes and all are basically bad, with bad guys being too arrogant and unrealistic.One of them says rug is in storage or something and then goes to 1 antique store nearby to order it again. (it's not a spoiler because we are told who the killer is at the start, already) How is that anything close to what a real criminal would do?Just, so disappointed.","rating":"2\/10","date":"19 April 2024"}
{"title":"I was so excited about this show and then...","review":"I loved The Good Wife - my alltime fvoritw show - and I learned to love The Good Fight. They were so spot on on current events, and the politics in the series were thrilling. So were the multidimensional characters as Elsbeth, who we all loved. But this spinoff is nothing like the previous shows. It lacks connection to today's legal world and is more like a cop show centered on one individual.Maybe it's meant to be pure comedy and as waiting for something similar to the earlier shows that's why I don't get it. I used to love TGW and TGF as they captured my full attention. I hope someday I'll find one like that again. But it's not this.","rating":"2\/10","date":"13 April 2024"}
{"title":"Need to take another look at the writing.","review":"My wife and I love the Good Wife\/Good Fight series and we think that the Elsbeth character is great. But the new series needs\/deserves writing that can live up to the quality of the first two shows. The global audience is smarter than the focus group and this show could be so much better. Elsbeth is incredibly smart. But her ability to solve every case in the first 10 minutes of the show, without being shown any hard evidence and clues first, is robbing the series of intrigue. We find ourselves being turned off instead of being drawn in. We want this show, its actors, and it's crew to win. But Robert and Michelle need to encourage the other writers to dig deeper and bring the show into a place that compliments its predecessors.","rating":"5\/10","date":"20 April 2024"}
{"title":"disapointing","review":"Very derivative, if you've seen one tv show about quirky detective, you've seen them all. This one is trying to be original, by having cutesy elderly woman in titular role, with her female of color protege, who is not smart enough to figure things on her own, but is smarter than all the male detectives, cause she actually understands the supposedly magically amazing main characterexcept she's not really magically amazing, I'd say you are always ahead of her but then, most episodes actually start with the crime, so even that part is adjusted for audience whose intellect authors do not hold in esteem. You don't have to figure out \"who done it\", it's obvious from the very first scenes... and then the elsbeth character just latches onto the actual culprit and keeps bothering them, until she finds proof of guiltand all that while she's not a cop, nor a detective, she's a lawyer, and she's the only one who figures stuff out, all the detectives are constantly blaming wrong ppl... imagine what prisons must look like in this universe, stocked wall to wall with innocent people... sheesh.","rating":"4\/10","date":"17 April 2024"}
