{"title":"Really Enjoyed It","review":"Being a big fan of both westerns and Taylor Sheridan I can say I've been looking forward to this ever since I first heard about it. It did not disappoint. It's shows how this hero, Bass Reeves, will do anything to take care of his family and bring justice to this who deservee it, even if that means working along side racists and other people he didn't like. There have been a few portrayals of this character over the years but David Oyelowo is by far the best yet. He makes what would still be a good show a great one. It's action packed and intelligent at the same time. Can't wait to see what Sheridan does next.","rating":"8\/10","date":"9 December 2023"}
{"title":"Not Sheridan's best but still pretty good","review":"Lawmen: Bass Reeves is another in a long line of hits for Taylor Sheridan. Anything this guy touches is pure gold. Obviously, this series is about the life of Bass Reeves, one of the legends of the West and one of the first U. S. Deputy Marshall's who was black. David Oyelowo does a terrific job playing the title character, he was just nominated for an Emmy for his job in this. This series also has a bunch of supporting characters played by great actors like Dennis Quaid, Barry Pepper, Shea Whigham, Donald Sutherland, Lauren E Banks, Garrett Hedlund, Forrest Goodluck, etc. If you're a fan of this genre or Taylor Sheridan then this is a must watch.","rating":"8\/10","date":"19 December 2023"}
{"title":"Enjoyable!","review":"I enjoyed the first 5 or 6 episodes, but the last ones were a little out there and short. The last episode left me with questions unanswered, perhaps that was the intent. Over all a 7 at best. I enjoy most of Taylor Sheridan's stories\/shows\/endeavors, but I am glad this one is not setup for another season - or don't think it is. The shows with multiple seasons take far too long between them - so much so that I loose interest and let alone remember what was in the prior season. I truly believe it would be better to conclude some of his other shows like Yellowstone (if it is ending); or 1923 before coming out with more new ones.","rating":"7\/10","date":"19 December 2023"}
{"title":"Great. It too short","review":"Turns out this is well made, well filmed. Great show. So what is it with these paltry little 8 episode seasons we keep getting nowadays. ??Epic fail by the makers.Apparently based on a True story (no, I hadn't heard about this either !). Ina h episode was good. An underlying story running along through the series but just not enough details and episodes so what could have been a sprawling epic was left as too short, too time lapsed over periods of time and therefor just slightly unsatisfying. Hope it that this is successful so they some item can be made with better continuity and detail. (Oh and more than 8 episodes please!!!)","rating":"8\/10","date":"25 December 2023"}
{"title":"Navigating the Legend: A Review of Lawmen: Bass Reeves","review":"\"Lawmen: Bass Reeves,\" a recent addition to Taylor Sheridan's repertoire, begins its narrative journey at a slower pace than his renowned works like \"Yellowstone\" or \"1883.\" Initially, this slower tempo might feel less captivating, especially for those accustomed to the gripping beginnings typical of Sheridan's series. The show employs numerous time jumps, a storytelling technique that, while effective in progressing the narrative, contributes to a somewhat disjointed initial rhythm.A striking aspect of the series is how swiftly we see Bass Reeves and his family age. This rapid progression, while necessary for the story, can at times feel abrupt, leaving viewers longing for a more gradual depiction of their growth and evolution.However, the series finds its footing with the introduction of a clear antagonist. This pivotal moment seems to steer the narrative with a newfound sense of purpose and direction, transforming it into a more traditional hero-versus-villain tale. The gunfights, a staple in such stories, do fall into the familiar trope where villains inexplicably miss their shots, even against a hero in plain sight. This element, albeit clich√©d, doesn't detract significantly from the overall enjoyment of the series.The show concludes with a finale that feels like a fitting conclusion to the legend of Bass Reeves. It encapsulates his journey sufficiently, giving viewers a sense of completion. While the ending is well-executed, the pacing of the series as a whole suggests that a few additional episodes could have provided a more balanced narrative flow. The initial slowness and the somewhat rushed conclusion leave one contemplating what could have been with a more evenly paced storyline.In summary, \"Lawmen: Bass Reeves\" is another commendable effort by Sheridan, showcasing his storytelling prowess. Despite not reaching the heights of popularity seen in \"Yellowstone\" or \"1883,\" it stands as a solid portrayal of a legendary figure. The show navigates through its pacing challenges to deliver a story that is engaging and, ultimately, satisfying. It's a testament to Sheridan's ability to craft compelling narratives, even when they tread a more conventional path.","rating":"8\/10","date":"18 December 2023"}
{"title":"OK","review":"This show starts off great, the cinematography is amazing throughout.Solid acting from everyone.Only thing is the main character makes some weird decisions and they keep coming to the point where one starts identifying less and less with him.The main bad guy is great and there are parallels to the main character that make you ponder. How much bad is in the good guy, how similar are they really.The main guy bullies his sidekick for no good reason and yet the kid saved him and feels like the real protagonist at times.Then there is the main characters' family storyline, which is very weak and can be skipped all together for a better outcome. All around not bad, but it could have been great with some minor adjustments.","rating":"6\/10","date":"29 December 2023"}
{"title":"\"I need a man with a good gun and a straight spine.\" - Episode #3, Judge Isaac Parker to Bass Reeves","review":"As a lifelong TV and movie Western fan, I'm still amazed at the fact that I never heard of Bass Reeves until the Bill O'Reilly series 'Legends and Lies' offered an entry on the frontier lawman. That episode took a questionable tack, suggesting that Reeves might have been the inspiration for The Lone Ranger. Though there may have been similarities between the fictional character and the historical one, I can't buy the premise that one followed the other. This series does present elements of Bass Reeves' career as a Deputy U. S. Marshal, sworn to the post by the legendary Judge Isaac Parker for the western district of Arkansas, which had jurisdiction over the Indian Territory. Of the events portrayed in this series, Reeves' shooting of his camp cook in Episode #7 for letting a prisoner escape was made to look intentional, while the O'Reilly program stated it was an accident. Either way, Reeves was found not guilty of murder by Judge Parker, allowing him to resume his livelihood. One in fact that was legendary, and in no way touched upon in this series. Over the course of his career, it's estimated that Bass Reeves arrested over three thousand criminals, and killed a total of fourteen men. Given the scope of his career as a lawman, I thought more could have been done with this production, a fact that may offer hope for a second season, although it looked by the way this one ended that Reeves was ready to hang up his guns and become a family man full time.","rating":"8\/10","date":"17 December 2023"}
{"title":"Silliness","review":"The show is beautifully shot, well directed and with some fantastic performances. Unfortunately, as the series progressed, the stories drifted farther into pure HBO level cartoonish fiction.Bass Reeves was a great and legendary lawman, and it is sad that his story couldnt be told simply and truthfully. I guess his 14 kills in 32 years of being a lawman werent considered dramatic enough for us 2020's folks who need explosions and green screens. It detracts from the man's greatness when his long service to law enforcement is reduced to some magic-tinged fight between good and evil, mysticism and wild conjecture. By the time I reached episode VIII I grew disappointed that the heroics I saw in the early episodes--which I had thought must be accurate--were most likely complete fiction.This show was perhaps the biggest chunk of all my reasons to sign up for Paramount + and I will not watch any of the upcoming Lawmen seasons supposedly portraying famous lawmen. It's a shame.This is worth the watch, at only 8 episodes, and as I said it is very well done.","rating":"6\/10","date":"27 February 2024"}
{"title":"Really good.","review":"If you liked 'The Good Lord Bird' this is very similar. Well filmed, good acting. Seems higher budget than you might expect. I'm only a few episodes in, but enjoying it. You can always tell when a tv series is based on a book because the storytelling tends to be better as does the character development.If you're into Westerns, civil war style stories and the challenges of the mid 1800's, you'll no doubt like this. Also great to see Barry Pepper and Shea Whitman in the cast. David Oyelowo is a great leading man and brings so much to this series. Looking forward to finishing it and hopefully more series to follow.","rating":"9\/10","date":"30 December 2023"}
{"title":"lost interest midway","review":"It's a solid show, but just not much immersion and I honestly don't relate or care about a single character. I expected I would like it - and I don't dislike it - it just does'nt motivate me to watch. A typical episode is that Reeves gets a job, is teleported to his destination, shoots a bunch of bad guys, struggle to get his captive home (and shoots a lot of bad guys) and then is back home. While he's away we follow his family's life, which really is not all that interesting. The show lacks something and I don't have clue what? It has talented actors, so not that. Maybe it's because it's suppossed to be the wild west, the open and endless planes, but instead everything feels small and contained not grandiose, adventurous with beautiful scenery. Anyways, was'nt for me. Too bad.","rating":"6\/10","date":"22 December 2023"}
{"title":"Enthralling Story","review":"I have know of the story of Bass Reeves for years. The man was truly one of histories biggest badasses, he was the inspiration for the Lone Ranger after all. It is crazy that it has taken this long for Hollywood to tell the true story of him. I have not watched any of Tyler Sheridan's other shows but after watching this I can understand how the Yellowstone universe has become so popular. My only real issue with the show is David Oyelowo's size. The real Bass Reeves was somewhere between 6'2\"-6'4\" in the late 1800's and would dwarf nearly all men of the time. It is hard for me to get past David's lack of imposing size. Other than that, he does give a good performance.","rating":"7\/10","date":"18 November 2023"}
{"title":"Disappointing","review":"I really wanted to love this show, about a vastly underrated historical figure. And the casting of Oyewolo in the title role is so good. But so many little things just turn me off. For one, it's just too darn clean for it's time period. The streets of the towns, the buildings in the towns, even Bass's little farm, all are way too neat and pristine. And the saloons we've seen are so spotless. I realize that it's a TV program in the 21st century, but how can you have a clean, well lit saloon in 1875, without ANYONE smoking? This thing will wind up on CBS in the near future, and you cannot depict the consumption of tobacco on network TV these days, I get all that. But it detracts from the reality of an important story of its own time. And, most critically, the racial aspect hasn't been sufficiently addressed in the first few episodes. A black man riding into a Texas town and walking into a saloon there in 1875 would have gotten called every name you can think of and a few you can't, if not beaten and kicked out, not invited to sit down and enjoy a friendly card game. It's been fairly enjoyable so far, but it's been way too shallow in my view.","rating":"5\/10","date":"16 November 2023"}
{"title":"Fantastic and so well written and acted","review":"I've only watch the first episode, and I'll come back and adjust my review after I finish the series, but I can tell already I'm going to like it. I do like it.First of all, the writing in this is outstanding. Most productions would make everything black-and-white, good and evil, without any intrigue whatsoever. Bass himself is not perfect, in fact he fights for the confederacy willingly. Even as a slave, he has a sense of honor, of right and wrong, but he serves his master until his master no longer deserves his allegiance.I know quite a bit of the history of this character, and so far they've been faithful to trying to replicate the authenticity of Bass Reeves.As sets, locations, costumes, and related are outstanding. The casting is outstanding. No caricatures, and everyone plays the role right on the money neither under nor over playing it. This is smart writing that doesn't insult the intelligence of the viewer.If the first episode is any litmus test, this is one of the smarter shows on television right now. I've been a critic of Taylor Sheridan lately because I want him to FINALLY finish Yellowstone, but if this is what he's been working on instead, I'm gonna give him a bit of a pass because the show really is outstanding.","rating":"9\/10","date":"5 November 2023"}
{"title":"Great new western series","review":"I love this new western series and grateful it's creators saw fit to leave the \"f\" bombs at the door. Please make more westerns like Bass Reeves! The actors are talented and believeable, the story line is easy to follow after the first episode, which has to give you background so you'll understand Bass and his motivations. It's good to see Donald Sutherland and Dennis Quaid. From what I've read, I understand this is an anthology and next season we will follow a new character, but I'm sad to lose the thread of Reeves. Maybe we can get a spin-off? More clean westerns would be a real treat Hollywood.","rating":"9\/10","date":"27 December 2023"}
{"title":"The poor relative of Taylor's shows","review":"The opening episode was thrilling as it picks up during the American civil war with a black man fighting for the confederates although it soon becomes clear that he's still considered a lesser person even though he's risking his own life. They should've concentrated on this premise as it initially evolved into the two best episodes of the serious. Following this it becomes pretty boring to be honest and the episodes are criminally short, falling into streaming shows, 101, 'let's make this movie into 8 episodes'. The acting is competent and the production, as you'd expect from Taylor Sheridan is first class, just a shame the final product falls way below.","rating":"6\/10","date":"14 December 2023"}
{"title":"Another great show from Taylor Sheridan!","review":"Well, I was looking forward to seeing Bass Reeves and it didn't disappoint! A top-notch cast did a great job bringing the characters to life. The locations and cinematography were fantastic and it had a sense of grit that many western series don't.David Olewayo, as Bass, was exceptional. The supporting cast were also great: Forrest Goodluck, Dennis Quaid, Barry Pepper and Donald Sutherland all played their parts superbly. It's the best role I've seen Sutherland play in a long time.There were three books written, so I hope we'll get to see at least one more series of Bass Reeves. With 1883 and, now, Bass Reeves, Taylor Sheridan has struck gold, not pyrite! (Watch it all the way through and you'll recognise the reference!).","rating":"9\/10","date":"1 January 2024"}
{"title":"Ignore the annoying flaws and watch","review":"I really, really wanted to like this series. Finally, an acknowledgment of a legendary Western lawman who was arguably far more successful than the better known Wyatt Earp or Bat Masterson, plus he was a former slave, with a terrific actor (Daniel Oyelowo) cast as the lead. While somewhat disappointed, I would nevertheless still recommend the series to anyone who knows little or nothing about Bass Reeves. It's worth watching even with its flaws.Since not much is known about Reeves' life as a slave, the writers were free to let their imaginations roam. Why they chose to portray Reeves as a slave who shot and killed Union soldiers during the Civil War is beyond comprehension. Was it an attempt to show Reeves as a man of honor who felt he had a moral obligation to serve his master? That would require us to believe Reeves thought his own slavery was morally correct. Was it an attempt to appeal to White Southern viewers who still believe in the Lost Cause of the fallaciously named War of Northern Aggression? Or viewers who believe that slaves willingly fought on behalf of the Confederacy? To be clear, the latter view is nonsensical. While there are written eyewitness accounts of Black men seen among Confederate soldiers during battle, the simpler explanation is that many Confederate officers were slaveowners who brought along a slave to perform as their man-servants. The notion that a slave would willingly kill a man fighting to defeat slavery is ludicrous.There are other nonsensical minor details that are noted by other reviewers (Reeves runs away from his owner, taking a horse but not any shoes, leading to later agony? While still barefoot, he kills two probable slave catchers but he doesn't take their shoes? His cap-and-ball revolver works perfectly after being submerged in a river?). Meh, while annoying, these are mere nits. So suspend your disbelief because in the larger context, it's worth watching to learn more about a man who should be known as a Western legend.","rating":"7\/10","date":"5 December 2023"}
{"title":"Thought I was going to hate it...","review":"All my life I've heard the stories of Bass Reeves, and it automatically makes for a Hollywood drama. The man was a legend. But every account I've ever seen about his life, always did a disservice. The movie that came out a few years ago is no exception. The cartoonish mustache, the cliched shootouts, and the unrealistic dialogue made me want my 90 minutes back. I went into this expecting more of the same.The first thing that caught my attention, however, was the cast. David Oyelowo has never played a bad character. But then I see Dennis Quaid, Donald Sutherland, Shea Whigham, and Barry Pepper, my first thought was sheesh. You almost CAN'T mess this movie up. Turned out I was right. The acting is subtle, even if the old school southern dialect is a little strained. The character development doesn't seem rushed. The cinematography is beautiful. It's a great show all around, and the end of each episode so far, makes you want to stay up past your bed time to watch the next. Hats off to a fantastic cast, and finally a storyline that does justice to this forgotten hero.","rating":"8\/10","date":"14 November 2023"}
{"title":"should be a movie","review":"Bass Reeves (David Oyelowo) was a slave who followed his master to fight for the Confederates in the Civil War. After the war, he gets recruited by Deputy U. S. Marshal Sherrill Lynn (Dennis Quaid) to hunt down criminals in the lawless territories with assistant Billy Crow (Forrest Goodluck). Fellow Confederate soldier Esau Pierce (Barry Pepper) killed his loved one. He does find his love Jennie (Lauren E. Banks) with their child Sally.This limited series should have been a movie instead. It sets up the villain. It sets up the hero. It sets up a reason for revenge. As it stands, it does expand on his world weariness during his deputy days. It also gives Jennie's story more space. The historical subject is great. There are a few slower spots. Oyelowo does keep it moving and the show is solid.","rating":"7\/10","date":"19 December 2023"}
{"title":"Awesome Season One","review":"Great acting all around especially from the lead actor, David Oyelowo; always a joy to see Dennis Quaid and Donald Sutherland. Intense and dramatic story. Thoroughly enjoyed all eight episodes.I wonder how many more characters I need to reach six hundred. Guess I'll just have to keep on writing until I reach the minimum required length.Great acting all around especially from the lead actor, David Oyelowo; always a joy to see Dennis Quaid and Donald Sutherland. Intense and dramatic story. Thoroughly enjoyed all eight episodes.I wonder how many more characters I need to reach six hundred. Guess I'll just have to keep on writing until I reach the minimum required length.","rating":"10\/10","date":"18 December 2023"}
{"title":"Decent so far","review":"Pretty good show so far, haven't seen anything all that new for this genre, but David Oyelowo has been incredible, almost like this role was made for him. I'm also always a fan of grumpy Dennis Quaid. I did like the show enough to write this little ditty though:Weeellll, this is a story about a man named Bass\nHe's got a pretty wife and really great abs\nHe was a slave, but he ran awaaaaay\nNow he's a U. S. Marshall, well ain't that greeeat?He used to fight for the Confederacy,\nBut I'll tell you it wasn't willingly\nHe beat up his master and he ran awaaaaay\nNow that master is still looking for him to this daaayHe met a Deputy by the name of Sherill\nHe's a hard livin' man with a flask of swill\nBass saw through his life of scooorn\nBass excepted the job cause he can't grow no coooorn.Well needs work...","rating":"6\/10","date":"9 November 2023"}
{"title":"Boring and lazy","review":"Just because the subject of a TV series or movie is a hero or fascinating, that doesn't mean the actual program is going to be good. I see people giving reviews that seemed to be based on the subject & not the program itself.The writing and direction is lazy. By that, I mean they take shortcuts and do things for effect that aren't based in reality. I knew from the first episode this was essentially using the reputation of a remakable man to make a series specifically to make money and not put out a good product. Let me explain when I say the writing & direction is lazy. They're trying to show the hardships Bass Reeves endured. He was a man born into slavery who became a famous Deputy U. S. Marshall. So, the film makers felt the need to show some of his hardships. SPOILER ALERT: Bass having a disagreement with his slave owning master, beats the living daylights out of him. Then he goes to the stables, gets a horse and rides off. He comes across three men who I suspect are slave catchers. They question him why he is riding out there so he shoots and kills all three. Then there is a commercial break. Upon returning from the commercial, our hero is struggling, walking in the wilderness and his feet are bloody because he has no boots on. This is the lazy part. They needed a bit of action so they have him shoot 3 men and now we need to feel bad for his hardships so they show him with bloody feet. Where's his horse? Are you suggesting he left the house with no boots? Why? Well, let's say he did, he just shot 3 guys who were wearling boots. They also had 3 horses, so how does he wind up with no horse and no boots? Lazy writing and direction. They needed to have some drama & this is what they came up with. Then there is a gun fight in episode 2 where you can't see a damn thing because it happens at night so you just sit there while bullets are flying.There are many instances of just stupid dialogue, stupid scenes. This is not a good series, it's just based on a remarkable man.","rating":"5\/10","date":"24 November 2023"}
{"title":"Bass Reevs was the real lone ranger","review":"Forget the old tv show that everyone knows. That was a mishmash that never showed a black person in any way I can remember. There was a faithful Indian companion named Tonto. Lenny Bruce said that the Lone Ranger was gay and the mask hid mascara. Thats how he got censored back then. As I understand Reeves had the whole state of Oklahoma to patrol. He did well doing the \"Respectful\" act with whites till they let him get close. Then he could outdraw and outshoot any of them. Wanted dead or alive was a real thing back then. As for this show, I liked the Civil War reenactment that opened the first episode.","rating":"9\/10","date":"11 December 2023"}
{"title":"Need more seasons !!","review":"I've been telling my kids about bad reeves for years . Whenever people talk about the Wild West I always say \" well did you know about bas reeves ?\" It's a great show great cast . Everyone is doing a great job . It's really good . I really want more seasons of this because there is a lot of story to tell . This man's story is important to tell and there's more lawmen that Wyatt erp and doc holiday . Which by the title of this show they will probably expand into their stories as well which I will also watch . Very good show , no complaints only compliments and looking forward to seeing this and more like this !","rating":"10\/10","date":"5 December 2023"}
{"title":"Great Piece of American History","review":"I am very excited about the Bass Reeves movie each week. I look forward each week to the next episode . It is very well made series with great actors and powerful scenes. They serious shows the ups and downs of being a servant of the law . It shows how the man of the law has to balance the power he wields with the badge and his judgment in each and every interaction with criminal elements. Is Bass Reeves is steadily being challenged in his role as a US Deputy Marshal and a man of color. I can only hope that season 2 is just as great. Thank you for making this great peace of American history a visually appealing masterpiece.","rating":"10\/10","date":"18 December 2023"}
{"title":"He's done it again!","review":"What an amazing cast and well told story. I was hooked from the very beginning of the show. David Oyelowo is perfect as Bass Reeves. I really don't think they could've found anyone else to play him but David. He brings a strength and incredible honesty to the role. I cried as I watched but I also cheered in others. It shows you how awful people can be but it also shows the beauty of the human spirit. I highly recommend watching it. The acting is superb by everyone. Dennis Quad is excellent as always which comes as no surprise. You will not be disappointed if you give this series a chance. It's another hit.","rating":"9\/10","date":"6 November 2023"}
{"title":"I'm loving it so far","review":"David Oyelowo acting is supreme in this, I watched him in Silo and he is excellent in that also.In this you feel for his character and are on the edge of your seat for what's next around the corner for him.I've currently only watched 2 episodes but you can tell already how good this show is, one of the best westerns I've ever watched, and that's no exaggeration. I can guarantee if you watch this you won't be disappointed. I can't wait to watch the rest.The scenery and views are beautiful and really get a feel for how life must of been back then.The only gripe I have is that they haven't brought out all the episodes at once, but I suppose you can't have everything. 9\/10 from me.","rating":"9\/10","date":"5 November 2023"}
{"title":"Lawman Bass Reeves: A Disappointing Ride Through an Untapped Legacy","review":"As an avid fan of Western dramas, I approached Lawman Bass Reeves with high expectations, hoping to witness a fresh perspective on the untold stories of the Old West. Unfortunately, this series fell far short of delivering the captivating narrative and character development that one would expect from a show centered around the legendary lawman Bass Reeves.One of the major pitfalls of this series is the lackluster writing that fails to do justice to the complexities of Reeves' life. The character development is shallow, reducing a historical figure with a fascinating background to a mere caricature. The show fails to explore the nuanced aspects of Reeves' personality, leaving viewers with a one-dimensional and uninspiring protagonist.The pacing of the series is erratic at best, making it difficult to engage with the plot. Critical events are either rushed through or dragged out, resulting in a disjointed viewing experience. It's evident that the writers struggled to find a cohesive narrative, leaving viewers questioning the overall direction of the story.","rating":"4\/10","date":"11 December 2023"}
{"title":"so far so good, nitpick some pet peeves","review":"The show is going well for its first few episodes. The flow is smooth and we pick up the premise and characters quite effortlessly. My pet peeve is the lack of common sense for a man like Bass Reeves, famous lawman and detective. It's not like historical inaccuracies but more like, why would you do that? Beat your master, runaway forget shoes, kill some men don't steal shoes, and runaway, in a Confederate uniform, down South, making you either a deserter or a looter, either way, you hang. All could be overlooked, eventually.Besides that, the cast is perfect, can't go wrong with David Oyelowo. Shea Whigham as George Reeves works well because he's a good bit villain. Barry Pepper did a great job subverting my expectations, played with intelligence and understanding but pure ruthless. OG Westerns actors with the likes of Dennis Quaid and Donald Sutherland expectedly shine in their roles.The pedigree of the producers pretty much guarantee a entertaining show. Chad Feehan whose stoic tough men with complex backstories have shined on cable television (Banshee), with Taylor Sheridan as the money man, Paramount connect and experience with the 'Yellowstone' universe (1883).Added together, I look forward to the upcoming season.","rating":"8\/10","date":"12 November 2023"}
{"title":"Is Taylor Sheridan up for the task?","review":"A solid Western with grit and believability but, is Taylor Sheridan up to the task? With work he hasn't finished and more openings than a chicken joint, he has more than 3, 1 season shows and counting. From, Mayor of Kingstown, and others still on the block. I think we should start being careful of his shows to watch without an ending. Where is 1923 ? And when will we see the rest ?? He is a solid writer and we are still are waiting on the payoff for a lot of other shows. I think we'll never see a season like Yellowstone from him again, as the streaming services move more to a 35 min, 6 episode season like @Disneyplus. They will all be short and Quick for the Money.","rating":"8\/10","date":"5 December 2023"}
{"title":"Outstanding historical and excellent dramatic presentation","review":"As a Bass Reeves affectionado, I loved this series. As a retired black chief of police, I completely identified with Deputy US Marshall Reeves and his challenges as a black law enforcement officer. Among all the other movies I have seen and books I have read, this series captures the essence of his life and documents the skills Bass had that made him stand out. His skills as a black cowboy (shooting guns and rifles) and his ability to converse with Native Americans made him invaluable to the Marshals Service. He even has a statue erected at Ft Smith AR. The backstory presented in this series is very detailed and helps in the understanding of how he used his experiences to achieve his future objectives as a Marshal. I also am a Wyatt Earp affectionado but have always been amazed at the plethora of films, books and shows dedicated to Earp compared to the relative few dedicated to Reeves. This series goes along way to making up the difference. Kudos to Taylor Sheridan for making this into a mini series instead cramming the rich tales of Bass' achievements in one or two hour show. Great job!","rating":"9\/10","date":"6 November 2023"}
{"title":"A Really Good Western Series!","review":"Taylor Sheridan does it again with Lawmen: Bass Reeves. This ranks up there with one of my favorite Western series that has come out in the last 20 years. What seperates Bass Reeves from the competition is it has a compelling story and does not miss at all with the casting here. From the beginning to the end of season 1, I feel like so much ground has been covered that it makes the journey feel all that more epic. David Oyelowo as our Lead here puts on a wonderful performance and Barry Pepper as the Villian does a solid job. If you enjoy Westerns\/Drama\/Action then check out Lawmen: Bass Reeves. My only minor complaint is I wish the episodes were a little bit longer. Bass Reeves gets a very high 9 stars out of 10.","rating":"9\/10","date":"12 January 2024"}
{"title":"Lack Of Compelling Themes & Characters Saw Me Bail After Five Installments","review":"As a huge fan of the 1883 and 1923 series, I knew I'd be watching Lawmen: Bass Reeves. The first few episodes held my interest, to be sure, but as it progressed I found it to just as quickly lose that interest by not really being \"about\" anything.The hallmark of the Taylor Sheridan Paramount westerns are their ability to depict the Old West but make it seem like it isn't all that different (at least personality\/energy-wise) from today. It's very much a Hollywood trick-of-the-mind, but also very effective when done right. Bass Reeves does not take this tack--instead portraying itself as far more an of-its-time endeavor. A lot of that energy from the previous Sheridan effort is lost in this way.The biggest culprit, I think? That this series is based on a real-life figure. As such, the writers are relatively constrained (at least compared to 1883\/1923) in what they can \"dream up\". Not only that, but in a show where the central conceit is about a black man ascending to lawman in unprecedented fashion, very little (at least through five episodes) is devoted to those themes. Almost as if a conscious choice was made to downplay the racial aspect so key to the whole endeavor.I also felt that the series had very little direction--nothing more than Bass being given a task by his superiors, supposedly learning a lesson along the way, while his family pines for his presence back at home. David Oyelowo plays the Bass character so close to the vest that it is hard to get much of a bead on what exactly he is thinking or feeling.I can still give the first five episodes a right-down-the-middle 5\/10 star ranking because the production values are high. But in terms of relatable characters or intriguing themes, I found them so lacking that after those 5 it had become a chore (rather than a pleasure) to tune in--the surest sign of needing to move on.","rating":"5\/10","date":"2 December 2023"}
{"title":"Do not review tv shows based on ONE episode","review":"People that leave 1 star reviews are just Taylor Sheridan haters. Taylor Sheridan is literally what cinema and tv needed. If you are tired of the comic book and crappy random remakes that Hollywood decides to make non stop, Sheridan has made instant classics like Wind River, Sicario, Hell or High Water.. then one of the most successful shows of all time with Yellowstone, then Tulsa King then Mayor Of Kingstown then 1883 and MORE. Now with Bass Reeves the first two episodes are a little slow because this is a story building characters, infact at the end of episode 2 he just became the US marshall which is what the story is about. Give Sheridan the trust and flowers that he deserves... he is an amazing talent that I think is one of the only people in Hollywood coming out with quality original entertainment.","rating":"10\/10","date":"6 November 2023"}
{"title":"Pretty Good So Far... üôè","review":"At the time of writing we only have the first three episodes to wet our appetite but despite a fairly slow start this is demonstrating some promise! ü§ûWe pick up our story towards the end of the American Civil War with Bass seen with the confederate army! The tide of the war is turning in favour of the union so Bass accompanies his master back home to Texas. There is a little \"disagreement\" over a card game and pretty soon Bass is on the move again - no spoilers here.Eventually we see Bass enlisted to help a deputy track down a wanted man and although things don't go quite to plan Bass is recruited to be a Deputy US Marshall for the state of Arkansas. And so it begins...David Oyelowo plays Bass and does so with a strong and quiet dignity and is very well cast. There are some great supporting roles from Donald Sutherland to Dennis Quaid as well as Bass' family. As you'd expect from a Taylor Sheridan show there is plenty of beautiful scenery on screen as well as an excellent musical score. I believe this was originally penned as an 1883 spin off and they are very similar in style and story pacing.New episodes drop every Sunday so hopefully this series will continue to develop and grow as it rolls along but so far so good.","rating":"9\/10","date":"15 November 2023"}
{"title":"I can't rate it until it's over.","review":"I can't rate it until it's over but I will say this, FINALLY SOMEONE GOT IT RIGHT!This is the first ever show or movie I've seen where they didn't use the North Alabama battle flag(the one everyone incorrectly calls the Confederate flag) they use a real one so I have high hopes for this! He is one of my favorite people from history and I desperately hope they do this great man justice.I can't rate it until it's over but I will say this, FINALLY SOMEONE GOT IT RIGHT!This is the first ever show or movie I've seen where they didn't use the North Alabama battle flag(the one everyone incorrectly calls the Confederate flag) they use a real one so I have high hopes for this! He is one of my favorite people from history and I desperately hope they do this great man justice.","rating":"","date":"10 November 2023"}
{"title":"Solid Work!","review":"This show offers a glimpse into the history of the American Culture and identity of our nation. There's a lot of infuriating bigotry that can still be identified today. The fact that Bass Reeves was able to steer past those objections, obstacles and challenges that were bought to him is a story of marvel and strength. Be ready for a ride of action, adventures and acceptances of the true nature of how this country was built after the original inhabitants of this land were killed and buried on the same soil they constructed. If you can identify with the disappointment of the past being led through racism, bigotry and hate towards others and the rise of a nation of people that come together at times for a common cause, you will enjoy the show.","rating":"10\/10","date":"4 December 2023"}
{"title":"Great acting and costumes!","review":"I'm a big fan. My husband and I can't wait for Sundays to come so we can watch the next episode. The casting is great and the relationships are very credible. I hope the Emmy's don't pass them over. On top of the quality of cast and crew, there's enough historical accuracy to appeal to history buffs as well. While the dialogue is fully the creation of some very talented writers, it reveals the nature of each character, and not in that all black and white way. But in the human way showing something in each one that compels compassion regardless of their obvious flaws or crimes. I highly recommend it!","rating":"10\/10","date":"26 November 2023"}
{"title":"Watch that accent....","review":"This ain't the \"wild west\" .. this... this.... is the \"homogenized west\". Apparently all the post-civil war and reconstruction animosity that's in every history book doesn't exist in this fable... So how accurate is any part of Bass Reeves's life as it's portrayed here? History is being ignored or rewritten.. I can only assume so is any biographical aspect.It all seems so watered down and unrealistic.The rich white lady speaks an unforgivable word ONCE in the final of all 8 episodes. It's not heard from Confederate soldiers? It's not heard from bad men seeking to perpetuate the mindset of the South? It's not even heard among friends used as merely a descriptive word. Really? I understand trying to not be offensive, but one also has to consider accuracy for historical settings. Horrible words were used and terrible mindsets existed. Failure to portray such things is more of a disservice to viewers than anything else. A la \"Those who forget history are doomed to repeat it.\" Reeves's climb to history was PERPETRATED by the incorrect and abusive mindsets of the times. Not showing what it was he truly overcame to become a well-established figure is a bit sad. But I guess accuracy isn't part of Sheridan's Profit Machine.-----------I was liking this up to episode 4.The first few episodes were interesting and compelling. There were a few, well, logic errors but still it was a good watch. Interesting story and well written\/acted.That all changed in episode 4.I found the (mumblecore) accent used by David Oyelowo just EXCEPTIONALLY poor and overly FORCED in episode 4. Perhaps that was merely a result of more lines for Bass in episode 4. But it just sounds overly fake and strained. I also found the storyline of episode 4 rather uninteresting and more \"episode filler\" than anything. It wasn't so much about Bass as situations around him at the time.Perhaps episode 4 was just a bad episode, but if David Oyelowo continues to use that strained, clearly forced, accent.. it's going to be an ingoing issue for me.---------------Episode 5 was better than ep4, but I still think I'm done.. They should probably retitle the show to \"Lawman Bass Reeves, His Wife's Social Endeavors, And His Daughter's First Romance.\" -- Too much time is spent on the wife and daughter when Bass isn't around, making the show far more \"emotional drama\" than western. I find EVERYTHING related to the wife and daughter just so utterly unentertaining and unrealistic due to the inability to honestly portray ANY time period in today's social climate. But, perhaps that's just my take.","rating":"5\/10","date":"22 November 2023"}
{"title":"Way more than just a Sheridan","review":"Bass Reeves is way more than just a Sheridan production. Right away we are transported to a place and time which incorporates the opposites of good and evil so that they might work closely together in the harvesting of humanity. The Civil War continues now across the world repeating a similar incorporation of opposites to achieve their world view. I'm not completely sure, but nature seems to spill out a human or two who transcend everything around them in a search of truth and Justice. Bass Reeves is one of these people. I read about Bass Reeves almost 50 years ago. I won't give away any storyline, but this show is just phenomenal.","rating":"10\/10","date":"14 November 2023"}
{"title":"Bass Revees Story Done With Justice","review":"I think this is a brilliant idea of telling the story of Bass Revees properly I also think it's a very cool that they are using Native American ACTORS instead of white actors like in the The Lone Ranger...It has a gentle story teller. Style too it and what the costumes are period correct. And I think. Need be that the way of suddenly having black screen appears is very uncool take me out the show. I know it's American style but its. Very confusing ok. I also feel. That use of more experienced. ACTORS. Is very good and make this have a air. Taking the story more seriously. I also feel that. We in the 21st century. Need to know. This amazing story.","rating":"10\/10","date":"14 November 2023"}
{"title":"Great show","review":"Just finish few episodes and I must say the acting and story line is well done!! Another great show by Taylor Sheridan and hope he continues to put out more hits!! This show is not slow, not every show has to be action pack. The show is definitely worth watching and learning about the famous black marshals. I hope everyone who watched the show truly gives it a good review and not bash it because of some political or racial agenda. The actors played the part very well and perfectly pick for their roles. I hope their will be a second season or full 7 seasons. Well enjoy everyone and look forward to seeing more positive reviews.","rating":"10\/10","date":"20 November 2023"}
{"title":"Bass Reeves is More Than One Man","review":"Dynamic Character Bass Reeves survives 3 completely different realities in America's past. Firstly, as a Civil War era slave he is able to distinguish himself with courageous soldiering before a troubled but powerful Confederate Major. Then secondly, escaping the War to a remote Seminole Outpost (as many black slaves actually did in Florida - Seminole means \"runaways\") he lays low and develops language skills in Indian dialects (the historical Bass Reeves was proficient in several Native American tongues) and earns his keep by practicing a New Trade.For me, the show reveals life's radical change of rules depending on the times in which a man finds himself. This Reeves is a man of integrity, even a fierce sense of righteousness. He studies his world and judges that some men are lost in their grief, bitterness, or lust for vengeance. I believe there's realism in this portrayal of Western Expansionist Opportunity soured by Soldier-Trauma from a bloody embittering Civil War.As Reeves embarks on a new way of life, in a third incarnation of himself, he stands taller than ever, taking on \"the weight of the badge\" as US Marshall. The irony of a Black US Marshall outsmarting and outshooting white criminals challenges today's stereotypes effectively. Bass and \"Ginny\" also challenge so much derogatory commentary in today's culture about the black family unit. If anything, Bass and Ginny embody passion and spiritual strength to overcome tumultuous times. With slavery, war, separation and uncertainty against them, they support and elevate each other in an inspirational exemplary way.The casting is outstanding. Ginny, to me, brings the most realism and period accuracy - an outstanding job of acting! Quaid portrays a broken and troubled Deputy, unable to deny the excellence of character we find in Reeves. Barry Pepper's work has the \"X-Factor\" as the villain who is too smart and too dangerous to leave roaming free among good people - I actually felt fear and foreboding watching him.Obviously, the real Bass Reeves was an extraordinary American Hero. Many thanks to the writers, costumers, set-dressers, historical consultants, cast and crew for your massive effort to bring Bass Reeves to life.","rating":"9\/10","date":"2 February 2024"}
{"title":"Kind of boring after all!","review":"I really wanted to like this and I thought the slow pace in the first episodes was for the sake of character building but here I am on episode 8 and nothing really happening. I thought the story of the great Bass Reeves would be an opportunity to make a great western series. I thought this would be the aventures of Lawman Bass Reeves going from town to town capturing outlaws and delivering them to the law. Instead there's little action and so much talk. Different events just hang with no resolution. Although David Oyelowo is a great actor he didn't have much to work with. Also he's too short and stocky to be Bass Reeves who was very talk and slander in real life. This show will be soon forgotten by all. What a missed opportunity.","rating":"3\/10","date":"18 December 2023"}
{"title":"Sheridan has done it again.","review":"This series is outstanding. It reminds me of a mini series I like called, 'Godless'. The west was harsh but Bass is fair and just in a time when life was cheap. A former slave guided by Biblical ethics. What a great story and cast. Dennis Quad is authentic wild west, and David Oyelowo is the black law man with a natural sense of justice. If you like other Sheridan series like Yellowstone, 1883, Tulsa King and others, you'll like this series as well. The westerns are making a comeback, but in the form of series and miniseries for membership only. That's because the true west should never be subjected to editing for the faint of heart and pious.","rating":"10\/10","date":"29 November 2023"}
{"title":"Great actors and characters","review":"I didn'r know about Bass Reeves before watching this show but I definitely want to know more about him! David Oyelowo's acting is stellar, although I have trouble reconciling his accent. Now I want to look up anything else he's in and watch it!. I love Jennie's character! She's one tough lady who obviously loves her husband but she's running a tight ship at home and is a character with depth! Esau is definitely the character you love to hate!! Just evil. I wish it was a little more western and little less drama. But with actors like Quaid, Pepper, Southerland, and Goodluck it's definitely a Western in the making. It felt a bit rushed but I guess if you have to cram everything into one short season that's how it has to be. Overall I loved it though!","rating":"9\/10","date":"28 January 2024"}
{"title":"Great series and very much enjoyed to watch immensely!","review":"One of the best Western series of our time! LAWMEN: BASS REEVES follows the journey of Reeves (Oyelowo) and his rise from enslavement to law enforcement as one of the first Black U. S. Deputy Marshals west ...Follow Bass Reeves' rise from enslavement to law enforcement as one of the first Black U. S. Deputy Marshals west of the Mississippi. The finale of Lawmen: Bass Reeves leaves the legendary Old West lawman at a high point, having defeated the heinous Mr. SundownOne trap the series falls into is showing Reeves as a singular superman - he is the only Black character whose skills, smarts and moral code ....","rating":"10\/10","date":"28 January 2024"}
{"title":"Great western series","review":"This TV series, by a great director, and featuring an all around stellar cast, is definitely one of the better shows of the year, and one true standout in the genre.The actors all do an incredible job, capturing the essence and tone splendidly, and it is indeed very career defining and great, as one would expect from such great names. Very complex, nuanced and ever exciting and suspenseful. Great script, filled with emotions and reinvokes the classic western tropes in splendid ways.The cinematography, cutting and editing is stellar, overall very beautifully put together and very authentic.Overall, definitely an incredible TV series, that I would highly recommend!","rating":"9\/10","date":"10 March 2024"}
{"title":"Too slow dragging. They should have made a movie instead","review":"I love a good western with character build and story. I love the idea of a black marshall. The actors in this series all play well and the scenery is great and decent traditional filmed. The only problem, like with so many tv (mini)series is that there is just not enough story to tell for a mini-series. And that is why this mini-series goes to wast. It starts promisiing but with each episode and minute ticking away it gets slower and slower to the point it is just dragging on to get the time by. In addition the makers create strange time jumps and not telling some parts where there could have been a (character building) story. My guess is that the writing is just poor. Such a wast of money and talent. If it only was cut down to the essentials and a quicker pase. But then it would have had the length of a normal movie and nobody makes money then right?","rating":"3\/10","date":"23 November 2023"}
{"title":"Deputy US Marshal Bass Reeves","review":"It's hard to imagine or even comprehend the prejudice and low estimation of others Deputy US Marshal Reeves had to overcome. And he became an elite federal lawman during his tumultuous time of living. I listened to a bit of his story in a podcast from \"Texas Monthly\" and read a small amount of his biography on the internet. The podcast was \"White Hats\" and is a condensed history of the Texas Rangers. Shortly thereafter I was watching an older episode of \"Timeless\" and Deputy Reeves was a character in the show. And then I found this series on Paramount.I always love the depiction of men who love their wives and children so this series is my new current favorite.We celebrate Black History Month year round and this show goes on our family recommended watchlist.","rating":"10\/10","date":"3 March 2024"}
