{"title":"This was so good!","review":"It's hard to even describe how much I enjoyed The Offer. All I know is I wasn't expecting that. It's easily one of the most surprising shows I've ever seem. I'm not saying it the best I've ever seem just surprised by how much I liked it. After reading all the great reviews I thought it would be good but this show is beyond just good. I couldn't get enough. I binged the entire series over a weekend and was sad when it was over. The writing is as good as a tv show gets, the acting is great, and every episode is entertaining enough to hold your attention throughout the series. I'm a huge Godfather fan but you don't have to like or even know anything about it to enjoy this. It's just a little more interesting if you do. If you're looking for a new show to watch or binge then look no further. I promise you won't be disappointed!","rating":"9\/10","date":"7 April 2023"}
{"title":"So much better than I expected!","review":"I didn't really know what to expect from The Offer. Even though I love The Godfather as much as everyone else, I wasn't all the interested on how the film was made. I was wrong! After reading all the great reviews and seeing the great cast I thought I'd give it a chance. I'm absolutely blown away by how much I like this show. You don't have to be a fan of The Godfather or have even seen it to enjoy this show. It's not the best series I've ever seen but it's still a really good and interesting series. Miles Teller, Giovanni Robison, Matthew Goode and the rest of this fantastic cast all do an amazing job. If you have reservations like I did on how good a show about a a movie getting made can be...don't! I absolutely recommend this show!","rating":"9\/10","date":"11 July 2022"}
{"title":"Matthew Goode is a gem","review":"Matthew Goode as Bob Evans is some wonderful casting and he has the persona and voice down pat. If you are interested in how movies are made and who the people are behind them you'll find this fascinating. If you aren't, you won't.","rating":"10\/10","date":"29 April 2022"}
{"title":"There are no words... 10\/10","review":"This is a show about the making of a movie, but it's so very much more. It's about the people who birthed \"The Godfather\", and the extreme adversity which hindered the creation of this immortal film. I watched the first 5 episodes in a day.We follow an amateur producer, Albert Ruddy (Miles Teller), with minimal experience on the Hollywood scene, but he is a force, a powerhouse with a vision. His primary role with Paramount is to make this \"mafia\" movie that it seems nobody (who was anybody) wants on the screen. There is a lot of pressure from Frank Sinatra, the government, the Italians, and others to halt the making of this film in its tracks. At any given time any or all of these powerful entities are fighting for any hint of this movie to be eradicated from existence - never to be conceived, and promptly to be forgotten. But Mr. Ruddy's persistence and sheer will are what eventually lead to the realization of the greatest, or at least one of the top five greatest films of all time. Miles Teller as an actor proves in this that he is literally capable of anything, and his inexhaustible skills are apparent. Bravo. 10\/10. Award-worthy.The over-indulgent and bloated executives at an ailing Paramount allow Ruddy to assemble what appears to be a bunch of aspiring indigents...novices so to speak; to piece together a fragmented but potentially splendorous film. This is their story.Ruddy's persistence and focus alone is what brought this dream to fruition, but he needed direction, vision, and inspiration as well. A woman named Bettye McCart (Juno Temple), bulldozes her way into his good graces, and basically takes the assistant position. She senses his brilliance and unequaled drive immediately, and with her own seemingly limitless knowledge of \"the biz\", she is able to enhance his effectiveness. Ms. Temple gives a stellar performance. 9.0\/10Ruddy meets an alluring woman named Francoise Glazer (Nora Arnezeder), who wishes to share his aspirations, and they quickly fall in love. Kudos to Arnezeder's portrayal of this character, as I found her to be startlingly irresistible. Although her screen time was fairly minimal, her character was quite refined - yet another brilliant performance. 8.7\/10The executives at Paramount, Matthew Goode as Robert Evans, and Burn Gorman as Charles Bluhdorn are the most profound embodiment of uptight intensity that I've witnessed in a number of years. I'm reminded of some of the great Jack Nicholson roles. Gorman has a very bizarre tone unrivaled by most, and I found myself strangely drawn to his antics. 9.7\/10. And Evans, the way he shows anger, disgust, and approval all in the same expression - is quite convincing, and fascinating. 9.3\/10.The writer of the novel \"The Godfather\", Mario Puzo, was also invited to write the screenplay for the movie, because Paramount had a limited budget. Oh how fate smiled upon these circumstances, because Puzo (Patrick Gallo) went on to write one of the greatest screenplays of all time. And Patrick Gallo engineered nothing short of a brilliance. I am amazed at all the great performances in this series, it's totally mind-boggling. 9.2\/10Guess what? There's still more...Probably my favorite actor in this series is Dan Fogler who portrays Francis Ford Coppola. If Coppola's true nature is similar to what Fogler has illustrated - then I am in love with this man!! What a fascinating and thoroughly compelling director and person Fogler renders for us. The provocative style and essence of Coppola - sheer BRILLIANCE. I feel like I keep repeating that word. The way he fashions The Godfather, primarily sharing a co-vision with Puzo, it's so tangible and full of emotional depth. 10\/10. Award-worthy.Giovanni Ribisi as Joe Colombo (real mafia mob boss), is a very chummy sort of scary guy. You really want to like him, but we are reminded from time to time that he is indeed a real gangster, a true thug. Ribisi captures the essence of being a lovable bad guy. I have the faint impression that he wanted to be Marlon Brando (many similarities to Don Corleone), but was probably informed that it was too small a part. All said - 8.8\/10Colin Hanks as Barry Lapidus (another angry and impatient man) 8.5\/10. I am surprised he had one of the very lesser roles in this, being such an accomplished actor himself.Do you have to love The Godfather to love this show? I don't know, I love the Godfather, so I might be biased. However, my love for The Godfather notwithstanding, this is (and likely will remain) the #1 show of 2022 (for me). I find it difficult to imagine anything will surpass it. Everything is 10\/10: writing, directing, pacing, cinematography, acting, dialogue.","rating":"10\/10","date":"17 May 2022"}
{"title":"The best series about a movie Ive ever seen","review":"Thats all...There is a helleva lot of mediocre shows out there...This ones a gem, even if you aren't a Godfather aficionado this is just one great, incredible and best of all TRUE story. Its very well acted (especially the guy who plays Al Pacino) and I cant stand waiting for a week to catch the next episode (5 so far, 6 tomorrow). A total treat. A great show about making a classic movie, the kind that were made when Hollywood actually cared about its audience.","rating":"9\/10","date":"19 May 2022"}
{"title":"Bloated As Hell and I LOVE It!","review":"I got sucked in with The Offer. Incredible sets and definitely period correct. Yes there's some exaggerated performances, and it's bloated as Hell with subplots, and I don't know why, but that's what makes The Offer fun. I'm hooked, flaws and all. I love period pieces, I'm a movie and a Godfather lover from way back.I know there's some whining, rich painfully out-of-touch with reality Hollywood folks (I've heard it all a million times), name-dropping, and talking about they knew the real people portrayed in this series, saying this not how it happened, blah, blah, blah, and who think they know it all...they're annoying. No one ever said this series was a Ken Burns documentary. Get over yourselves. But for the rest of us who love period pieces, sometimes you just want to time travel for some escapist fun. So take the bad reviews with a grain of salt, because some of these professional movie critics, know the rich people complaining and want to stay in their good graces.Miles Teller is superb as Al Ruddy and Juno Temple nails per part as his trusted sidekick\/secretary\/friend\/shrink. And though. Giovanni Ribisi is getting dragged for his portrayal of an Italian crime boss, I think he's perfect in that role. And Matthew Goode as Robert Evans is hilarious, and from what I've heard, he's also spot-on. There is no bad casting in The Offer and it harkens back to an era of pure hedonistic pleasure, early 70s fashion and a studio system that had no real vision and The Godfather scared them because it stepped outside of the norm.","rating":"9\/10","date":"29 April 2022"}
{"title":"Life Imitating Art Imitating Life...or Is it the Other Way Around?","review":"This series is done with so much love and reverence for the film that it's impossible not to like if you loved The Godfather, and who doesn't like that movie?After a single episode, I was all in. It's the perfect mix of great acting, good story, and a fun script. I was dubious about this when I saw the trailer, but my doubts were gone almost from the beginning of episode one. The movie was larger than life, so a series about how the film came to be was definitely worth a shot.I may come back and change this initial euphoria, but for now, this is one of the best things I've seen in a long while. I mean, come on! It's a series about the making of the most epic gangster movie and one of the best films ever made, and it has gangsters in it. What more could anyone want?The scenes with Coppola and Mario Puzo are genius. They both make the process of writing look exciting, positively thrilling like I've never seen before.One complaint, and it's major. There are WAY too many scenes shot in almost complete darkness. I am so fed up with this technique and for the life of me, I don't understand why directors think shooting in the dark is so cool. Just about every scene is shot in candlelight, an unlit room with light shining through a curtained window, a club or office as dark as a cave with visibility at about ten feet. If there is daylight, it's only to show characters walking into ill-lit rooms, or shadows playing a prominent role. Puzo and his wife sit in a dark kitchen. Couldn't he pay the electric bill? Turn on a light!When Puzo sees the line at the bookstore the lighting was so bad that I could barely see anyone. Wasn't the whole point of the scene to show a mob? It was like people hiding in the dark. Why was this scene at night? It was a book signing. You can sign a book during the daylight hours and viewers might be able to see something instead of squinting at the screen.If it were available, I would have watched the entire series in one night. This could be the best thing ever on TV. I almost want to tell viewers to wait until it's all available before beginning the series so as not to have the anguish of waiting for the next installment in what could be the best TV series ever-no kiddingIf you would have told me beforehand that Giovani Ribisi plays Joe Colombo, I would have laughed, or at least been a bit skeptical. He's a stroke of pure brilliance in a series that is loaded with talent and great performances. I had a difficult time recognizing many of the actors because they were so far from anything they'd done before.Another complaint I have is that we have to wait around until the end of June to see this through to the conclusion. I want it now! This reminds me of a true story. Back in about 1989, a group of friends were sitting in my living room ready to go out for the night when The Godfather came on the TV on some network station. We all promised that we'd go out after watching a few scenes. I mean, we'd all seen it a million times already. Well over an hour later, when Michael goes into the bathroom and comes out with the pistol, there was a message on the screen: To Be Continued Tomorrow.We all said to heck with that, and someone went out to the video store to rent a copy so we could finish watching it for the 1,000,001 time. I don't remember what happened after that, but we probably went out to a bar and talked about the movie for the millionth time. The moral to this story is don't jerk people around by making them wait. Just hand over the product like they do at Netflix.","rating":"10\/10","date":"28 April 2022"}
{"title":"And I never rated anything a 10...","review":"Can't believe how goo this is. There's is not one aspect of this series that is off the mark. The production, the acting, the dialog, the pace, drama, humor, tension, on and on there are no faults here. Very entertaining from beginning to end. Every episode is better that the prior one hands down.","rating":"10\/10","date":"18 May 2022"}
{"title":"Excellent!","review":"This is now my favorite show. I think it helps to have seen The Godfather, be a fan and have interest in the circumstances in which the movie was made. I think those who think this is boring may have no such interest. With that out of the way, this show is awesome. Ive been having a hard time with cheap biopics made these days with the fake wigs and actors that don't even look like the people they portray. Such bombs are Winning Times and First Lady.The Offer looks genuine and the actors are all awesome and established. Try to find a photo of the real Mario Puzo and compare him to the actor. They look like brothers. Same with the Francis Ford Coppola character. I had no problem being fully immersed in the story. The first episode set things up real nice and I can't wait to watch more.","rating":"10\/10","date":"29 April 2022"}
{"title":"A Wonderful Surprise for lovers of Hollywood backstories!","review":"Outstanding casting for this series! Writing scores with unexpectedly strong female characters. The creatives on this series deserve accolades for creating something different from other streaming series. I would put this in the same outstanding quality category as the current Julia on HBOMax.","rating":"10\/10","date":"14 May 2022"}
{"title":"Screw The Haters. This Is Great Television.","review":"I'll keep this short and sweet. Being a huge fan of The Godfather I already had insight into a lot of the mayhem that went into making this masterpiece. I mean the powers that be did everything they could to keep it from happening, and yet, through a lot miracles it made it through the fire. I'm 3 episodes in and am getting to see several of those instances play out, as well as getting better insight into them with a more nuanced play of the facts.Having seen a professional reviewer take a dump on it somewhere else I tell you pay no mind. I've learned to stop relying on paid critics. Too often they have an agenda, and in this day and age I'm tired of the agendas when it comes to my entertainment, aren't you? Give this one a watch. It's a beautiful thing seeing what went into one of the greatest movies ever made.","rating":"10\/10","date":"30 April 2022"}
{"title":"Good entertainment that gets a bit schmaltzy","review":"The Offer operates on the assumption you loved The Godfather. The episodes are suffused with a kind of reverence, as if the series starring Miles Teller, Matthew Goode and Juno Temple was documenting the first landing on the moon, not the making of a relatively low budget movie from Paramount in the early '70s.It also strains credibility. In order to get the movie made in New York, producer Al Ruddy (Teller) needs the permission and support of the Italian American Citizens League (or something), headed by Joe Columbo (Giovanni Ribisi, sounding like he swallowed a frog). Columbo gets shot, just like Vito Corleone in the movie, and winds up barely clinging to life. It's an ominous parallel.Then there are the outright embellishments. In The Godfather, the actor Gianni Russo portrays Connie Corleone's husband, Carlo Rizzi. In The Offer, actor Branden Williams plays Russo. Russo is portrayed as a woman-beating sleaze bag; according to The Offer, he beats up actress Talia Shire for real in the scene when his character (Carlo Rizzi) is supposed to beat up Connie. According to The Offer, this upsets director Francis Coppola (Dan Fogler), who is Shire's real-life brother. Coppola tells Ruddy. Ruddy then has actor James Caan, who plays Connie's brother in The Godfather, actually beat up the actor playing Connie's husband, Gianni Russo, in the scene where he kicks his butt for hurting her.In short, we're to believe actor James Caan really beats up actor Gianni Russo in The Godfather. But when you watch The Godfather, as I just recently did, you see there's no way that's true. Caan's punches and kicks are clearly pulled; one punch misses Russo's face by a good six inches.The Offer is full of embellishments and parallelism like these that strain belief. And the intense drama at times feels silly. Bob Evans, for instance (played by British actor Matthew Goode as if he has a perpetual cold and can't breathe through his nose), is deep in his cave of self-doubt near the end of the series, having lost his wife to his workaholism (and the dashing Steve McQueen). The rousing speech Ruddy gives Evans about the importance of movies (not the first time in the series) felt corny and overblown.Despite all of this, The Offer held my interest for the full run. It was good. It relies on peoples' love of The Godfather to really sustain it, in the same way The Godfather movie relied on peoples' love of Puzo's book to sustain it. But maybe that's okay. People love to love things, even if that love obfuscates reality.7\/10.","rating":"7\/10","date":"23 June 2022"}
{"title":"Prepare to be spoonfed","review":"Two episodes in and I am dizzy from being slapped in the face with staggering exposition. I don't know who wrote this, but they have no respect for the viewer. So far, a great subject with great characters that is treating me like this is the only show I have watched that isn't One Life to Live. Here's Bob Evans (who is REPEATEDLY referred to by his first and last name even though the target audience for this would likely know EXACTLY who he is my his mannerisms and glasses) trying to get some groupies to come to a party - Evans: \"If you're not there, I'm just gonna send everybody home...even Jack and Warren\". Random person: \"Huh?\" Evans: \"Nicholson and Beatty\". Shameless.","rating":"5\/10","date":"28 April 2022"}
{"title":"This made me want to watch \"The Godfather\"","review":"I like movies in general but somehow \"The Godfather\" has eluded me. Maybe it's the lengthy running time, dark lighting, or gangster shenanigans, but it is just something I haven't sought out to sit and watch. Now I hear about a TV series called \"The Offer,\" its critical acclaim and high ratings, so I get intrigued, especially when I learn that the subject matter is about the making of \"The Godfather.\" Is it a documentary? Why is the rating so high? I give the first episode a whirl and quickly realize it's a dramatization of events in the making of this classic movie, of course. As the series progresses, because it is so exquisitely made, I become more and more interested in the actual movie and so I finally give it a watch. All this time, I have been missing out on the burgeoning talents of Al Pacino in the early days, the artistic storytelling, and all the drama from everyone involved. \"The Offer\" does great service to viewers like me, and without it, I would have been deprived of this classic cinematic experience.","rating":"9\/10","date":"30 March 2023"}
{"title":"Why not everyone's talking about this, Cinephiles it's about how they made one of your beloved movies.","review":"Why not everyone's talking about this, Cinephiles it's about how they made one of your beloved movies. An incredible series that is surely to get its due credit with times. Loved it.A series about the making of The Godfather by its producer Al Ruddy's perspective. Undoubtedly took many artistic liberties to tell the amazing true story, so many of the things I have seen, & read over the years, that gave credit to Coppola, this series gives those credits to Ruddy. Balances fact and fiction in such a lovable way. The real-life Mafia struggles juxtaposed against the backdrop of the film & it's making is really intriguing to watch. Acting performances are mind blowing! Matthew Goode, Juno Temple, Burn Gorman are obviously excellent, steals every scene but Miles Teller has really grown on me since Whiplash to this as Ruddy. The next big thing.. A Must Watch, if you love The Godfather Trilogy...What a great way to celebrate the 51st anniversary of The Godfather, released on this day 1972.","rating":"9\/10","date":"24 March 2023"}
{"title":"So Many Brilliant Performances","review":"This series is about so many things, mostly about an American Dreamer making a movie, in a sort of perverted way, about the American Dream. Miles Teller as producer Al Ruddy, gets early advice to not let anything get in the way of his movie. It's advice he takes seriously and there are at least a dozen times The Godfather would have been shelved had any other producer in his or her right mind been at the wheel. To say The Godfather encountered obstacles would be the understatement of the century. Many of them are so comical, and the solutions to crushing said obstacles knocked me off my chair more than once.So for starters, this is storytelling at its finest, compelling, dramatic, wonderful contrasts between deadpan emotions of Miles Teller with the brilliance of Dan Fogler, who absolutely transforms into the great Coppola himself. Seriously, I thought they had found a way to go back in time and get the master director himself. Also remarkable is the hilarious (and I mean hilarious) Matthew Goode as Bob Evans. Patrick Gallo, as Mario Puzo, delivers superb chemistry with Fogler, and the two of them together as collaborators are one of the best acting duos you'll ever see.As an early Pacino fan, I was especially impressed with the terrific nuances delivered by Anthony Ippolito, who really did his homework. I had forgotten how shy Pacino was in his early years, and Ippolito is just heartbreakingly wonderful as the insecure actor who gets the role of a lifetime.But the performance to end all performances has to be Giovanni Ribisi who just blew me away in all of his scenes, which he aptly steals every time. He is SO FUNNY and so clever and just so brilliant. I had to rewind most of his scenes because they were just so darned entertaining.Casting The Godfather was an extraordinary challenge, and thankfully for us, Coppola instinctively knew who would be great in these roles. Fortunately he had Ruddy as his partner to fight the good fight. Had these two not been unrelenting we would have had Robert Redford as Michael, who I am sure would have delivered (as a Northern Italian type) but that would have compromised the whole \"Sicilian thing.\" In a remarkable twist, which is truly Hollywood history, Pacino is swapped with Robert De Niro (who takes Pacino's role in The Gang Can't Shoot Straight, which bombed). De Niro of course, would play Pacino's grandfather in The Godfather II.Nice to see Eric Balfour (who is always fun) show up as Dean Tavoularis. And of course, the brilliant Justin Chambers who's Marlon Brando is show-stopping especially \"the voice.\" Chambers, like Ippolito, pays close attention to the tiny nuances that bring their real-life counterparts to life in very, very impressive ways.This is pure drama of course, because it's about the making of a film, but the comedy is equally brilliant. I'm sure I'll watch this again and again.","rating":"10\/10","date":"13 August 2022"}
{"title":"caution: risk of bingeing this is very high!","review":"Do not start watching this show unless you have time to watch the whole thing in one go! You will, and I repeat, you will be craving for the next episode, and then the next, and the next...until the show is over and you are left emotionally drained, covered in chips crumbs and peanut shells, lying on your couch bloated from all the coca-cola or beer you drank watching this, while your spouse is walking out the door after handing you the divorce papers as this was the final straw. This show is roughly two times better than you actually expect it to be while you're reading this reviews and trying to make a decision if you should be watching this or not. I expected a decent show, more of a documentary style, but what I got in return was an intense and very entertaining emotional drama that left me on awe.","rating":"10\/10","date":"30 April 2023"}
{"title":"Deserves every awards for a TV Show","review":"It's so good and well created that it doesn't matter if they got everything historically accurate or they adapted something for the story sake.I will watch it again and again like The Godfather movies.I can only say: Thank you for making this great story seen!!!","rating":"10\/10","date":"16 June 2022"}
{"title":"This is entertainment","review":"This is everything you could want in a miniseries. A great plot, an intelligent and witty script. And excellent performances. That is happens to be based on true events is, in a sense, irrelevant. You could enjoy this without ever having heard of \"The Godfather\" - though knowing much of the background to its production did add to my enjoyment.Bottom line: this is an extremely well-made show that is a delight to watch.","rating":"9\/10","date":"4 May 2022"}
{"title":"A treat for movie lovers","review":"This is a well made treat for all of us that love \"The Godfather\" movie.It's also an extremely well made and entertaining show with loads of interesting hints of how famous scenes from the movie was invented. We get to follow both the movie producing and making process and at the same time we get to know about the mafia and their opposition against the movie.We also get a series without the usual virtue signalling and PC-garbage that most productions have today.It's not easy to make a show about one of the best books and movies ever made. But this show have put a lot of the lore and different facts about this in a show that is a joy to see.I really look forward to the rest of this refreshing and interesting series.","rating":"10\/10","date":"1 May 2022"}
{"title":"The Best","review":"This show was fabulous. Beyond a 10. Perfect. My favorite show of 2022 this is for sure. The sound-track too was excellent.There is not a negative thing I can say about the series.Just watch it. It was every adjective that means super duper and more.It is about the creation of the Godfather. Starting with the writing of the book to filming of the movie. I did not think that I would be blown away by this show but I was. Who would of thought that the story of the making of the Godfather would be brilliant. When I read about it being made I did not think it would be of interest to me. I was so wrong. It is worth its telling because it is a story that is ballsy, wonderful and so so so interesting.I loved it!","rating":"10\/10","date":"25 April 2023"}
{"title":"Enjoyable","review":"This is well done, a lot of history here to discover. I gotta admit Fogler brings it as Francis Ford. Get past the first half of the first episode and it starts getting good.","rating":"7\/10","date":"5 May 2022"}
{"title":"The Making Of An American Movie","review":"The unfortunate part of this project is that they speak of it in hindsight. And much of it from producer Albert S. Ruddy's recollection. A similar tale had been told by Robert Evans. And Peter Bart. And Francis Ford. And so forth. So there is a nagging feeling that we are being told the tale from an unreliable narrator. That said, this is so caricature-driven. It may as well be a MAD magazine version of it. And perhaps that is their intention. The thing is, most people who are interested in the making of \"The Godfather\" likely heard or know more than the people involved. The ones who \"lived it\", to be honest, can only paint themselves out to be the hero of the story. Witness the pilot episode where Ruddy pitches \"Hogan's Heroes\" to Paramount executives only to have it become a smash hit. Then having the sand to go down to Mexico to leverage Robert Redford to be in some schlock motorcycle movie. Sure it's all true. Sure it's not as golden hued dreamy as this project would have you believe.Then there's Francis Coppola. As re-creations go, they're kind enough to paint him out to be more flower child then blustery know-it-all. Listen to any commentary track on his movies to hear how he claims everything he does is genius. As does Robert Evans in his book (about himself) \"The Kid Stays In The Picture\" Does it surprise you these men have died lonely?Any way, this is a little depressing. This is really a biopic of a few things...Mafia in Hollywood, Albert Ruddy, \"The Godfather\" and so forth. Unfortunately, that means the focus is spread too thin.A few laughable moments...Frank Sinatra threatening Mario Puzo is laughably bad. Doesn't look or sound like Frank in the least.Juno Temple as Bettye McCartt. How was it that she was privy to all this information and have men actually listen to her? I'm sure this is history re-writing itself for Ruddy to seem progressive.Obnoxious blow hards who spend their days playing make believe may only be interested to fans of the film. Otherwise, it may be confusing. Or a lackluster version of \"The Last Tycoon\"","rating":"5\/10","date":"5 May 2022"}
{"title":"Entertaining!","review":"Great:\n-- Mathhew Goode's acting. He was one of the only ones to actually nail down the old timey accent & mannerisms.-- Godfather Cast: From a frighteningly similar Al Pacino to a wondrous Brando, it was spot on.-- Giovanni Rivision did fantastic.-- Pacing: I'm sure it took a helluva lot of liberties with timelines & events, but it kept the pace rolling well.--Cinematography: A.-- Plot\/Topic: Kudos to whoever thought it'd be a great idea to showcase this. The hustle, passion & struggle depicted here was almost inspiring!Miss:\n-- Juno Temple's character's constant need to bring in modernism\/gender narratives etc was a bit off putting & served to drag you out of the time period. Her association with Ted Lasso, her poodle like expression & failure to completely drop her thick English accent didn't help.-- I like Miles Teller but his acting was really wooden here. Maybe the guy he was playing was this way, I doubt it. He almost never showed any extreme emotion even when things seemed to wildly derail, from divorce to mob threats to professional assassination.-- The guy who played Caesar. Is he related to Bobby Canavale? His acting was terrible.","rating":"9\/10","date":"31 March 2023"}
{"title":"*Amazing Series!","review":"*If you liked the movie The Godfather.The series is fantastic! If you've ever wondered how movies are actually produced or what goes into making a movie, you will be severely educated and entertained. I think the casting was great! It's answering a lot of unasked questions, but I love that!","rating":"9\/10","date":"28 April 2022"}
{"title":"The best Tribute to the 50th Anniversary","review":"My Review - The OfferMy Rating 10\/10 Streaming on ParamountI've read a few negative reviews concerning this series that I have to totally disagree with . Criticisms like \" The splashy inside Hollywood drama on the making of The Godfather is a patchy, overlong series that is best when it sticks to the script\"\nI'm sorry I don't agree at all and I'm the first person to complain if a series is overlong or padded out but compared to the fanciful and over done 2020 Ryan Murphy 7 part series Hollywood \"The Offer \" created by Michael Tolkin is a masterpiece and I think is the best television drama of the year .I can't think of any other movie or series that documents a famous movie of the quality of The Godfather from book to World Premiere.Being a keen cinephile I found The Offer\ngives a great insight into the different roles of movie makers from the Producers writers and Directors perspective to the non creative Studio financial accountant's who must be responsible for the nightmares experienced by the creative teams who are responsible for the movies we love.The three primary actors are Matthew Goode as Studio Head Robert Evans he is so impressive in a high energy role like I've never seen him play before.Dan Fogler as Francis Ford Coppola is also sensational as the Director who protects Mario Puzo's best seller like a beloved child never compromising on quality or the actors he wants to play the roles .For me though the standout performance is Miles Teller as Producer of The Godfather Albert S. Ruddy he is sensational and deserves at least an Emmy nomination for his performance. His character is tough and complex trying to negotiate the Studio politics ,budget constraints plus intimidation and pressure from The Italian American community and the gangsters that rule it.I read that the original actor cast to portray Albert S. Ruddy was Armie Hammer who left the series for unknown reasons I have a good idea why that was .All I can say as much as I like Armie Hammer he would have been totally wrong in this series ,his matinee idol looks and acting style would have spoiled the series for me.Juno Temple an actress I'm not to familiar with but will watch out for is also spectacular in her role as Bettye Mc Cartt the Production assistant and great support to jet boss Albert S, Ruddy .The Offer is based on the experiences of Oscar winning Producer Albert S. Ruddy who in 1969 after the success of his first television sitcom Hogans Heroes approaches Robert Evans the head of Production at Paramount Studios in an effort to be taken on as a film Producer.The first movie project he pitches is a new top selling novel titled The Godfather by once struggling author Mario Puzo .Robert Evans is reluctant at first insisting his Studio hits like Love Story are what Paramount needs to balance the books.However The Godfather is taken on by the studio with Albert S Ruddy as Producer and Francis Ford Coppola to Direct.This is where the story really takes off when one of the actual Godfathers heading the notorious Italian American \"Five Families \" Joe Colombo puts the pressure on Robert Evans to stop the filming of The Godfather as if doesn't portray his Italian community favourably .The heat is on especially when friend and ally of the 5 families pop idol Frank Sinatra points out the obvious similarities to the singer character in the book Johnny Fontaine believing probably correctly that it's based in him.The Offer is such a great 50th Anniversary tribute to the movie The Godfather which is listed as the official 2nd most critically acclaimed film all time film and a movie that had a modest production budget by todays standards of USD 6,000,000 (estimated) earning a staggering USD 270,012,224 Worldwide.Apart from the fine acting performances from the entire ensemble cast what impressed me most is the intelligence of the script and the expert Directing team. It's an achievement indeed and rare to have audiences impatiently eagerly awaiting each instalment in a mammoth ten part series ,especially this member of the audience.Ps watch The Godfather movie after the series it's even more enjoyable than before.","rating":"10\/10","date":"17 June 2022"}
{"title":"1 episode in and I love it.","review":"I read some negative reviews of this show before watching it. I was unsure I would appreciate it, being a dyed in the wool The Godfather fan. To me this takes the story and kind of gives it a Scorsese treatment. You know, exaggeration of the clich√©s and all that, and I think it really works for this modern day take on it. I have no idea if this is an accurate account and I couldn't care less. It is entertainment, so STFU and enjoy it.The only reason I only gave this 8 out of 10 is that I have only seen one episode. I reserve the right to change it up or down after further reviewing.","rating":"8\/10","date":"29 April 2022"}
{"title":"Just watched the first three episodes...","review":"Just watched the first three episodes while simultaneously having The Godfather without sound on the TV.A test for a show to be good is when it takes you into that Realm of suspension of disbelief and engagement in the story. So far, the series exceeds that.","rating":"8\/10","date":"1 May 2022"}
{"title":"Who knew so many obstacles?!?","review":"Truly excellent and fast paced Hollywood story about the making of one of the greatest films of all time. Amazing how many obstacles the production team\nHad to overcome. Fantastic performances especially Miles Teller and Matthew Goode who NAILS IT as the great \"kid notorious \" Robert Evans. My mom thought she wouldn't care for this - by the end of episode one she was hanging on every moment. I love Film history so I had been waiting for this for a long time. I loved Feud about making of what ever happened to Baby Jane and I love this just as much.","rating":"10\/10","date":"1 May 2022"}
{"title":"Addictive, funny, hooked!!!","review":"I'm so hooked, enthralled, the acting is incredible!!It's witty and gripping, a great show. I'm at episode 3 and have to wait a few days till new eps come out and I'm busting. I have never seen the godfather, yet this show is soooooo enthralling with its brilliantly written characters acted superbly.","rating":"10\/10","date":"29 April 2022"}
{"title":"This is one you can't refuse","review":"A show about the making of The Godfather sounds like a very interesting idea, and it sure pays off.Showcasing a very talented cast of actors, and an overall great sense of cinematography and writing gives this a special flair that actually makes it feel like The Godfather films, even though it is a fictionalization of the background story.Some events might be a bit romanticized or simplified to make it all more interesting - but that's what any great adaptation should aspire to do. The essence of it all, the risks taken in making this human gangster drama, is conveyed very well througy the writing and performances, and like stated above, it feels very similar to that of an actual Godfather TV show, with its gangster dramas and in how it delves into the human psyche.Overall, a fantastic show!","rating":"9\/10","date":"27 December 2022"}
{"title":"Awesome story, laughably anachronistic dialogue","review":"Imagine watching a movie set during the revolutionary war, and you find the story riveting. And you are really invested in the characters. And then suddenly a soldier takes out a Bic disposable razor to shave. And then suddenly you remember that it's just a movie, and that somebody missed the memo on making the movie appear to truly be set in revolutionary war times. That's what it felt like listening to the dialogue in, \"The Offer\".\"Love you\", \"love you more\"\n\"Are we good?\", \"We're good\"\n\"You got this!\"\n\"No worries\"\n\"We'll that was two hours of my life I'll never get back\"None of the jargon\/idioms above were spoken in the early 70s. But when you watch 'the offer', you'll hear these words and other modern jargon just like it, peppered throughout every conversation. It's distracting. It's also really lazy. It's poor writing.Having said that, the story is awesome. Matthew Goode steals every scene he is in. And if you loved \"the godfather\", this is 'must viewing'.","rating":"7\/10","date":"4 September 2023"}
{"title":"Flashy, soulless, stupid","review":"Looks really good. Lots of music, flashy period sets and pretty girls. Utterly heartless and plastic. It's like it's made by the people it portrays. There's no characters to care about just stiff cardboard cutouts of people that may or may not have existed. The mafia stuff is so genarilzed and poorly thought out it's laughable. I'm sure they had commission meetings with 50 other guys in the room where they announce to the room such and such's name, that he's a boss of such and such family and there involvement in the commission.","rating":"2\/10","date":"4 May 2022"}
{"title":"Don't believe the critics - it's great","review":"For some unfathomable reason the critics seem to have largely hated this miniseries from Paramount. In papers and magazines it has been accused of being empty, cliched, badly written and pointless. Nothing could be further from the truth. The show is beautifully made and the entire cast sparkle - especially Juno Temple and Matthew Goode, whose portrayal of the legendary producer\/studio boss Robert Evans is electrifying. It's true that at times the characters speak in cliches, but that's the point, not a failure. The show is, amongst other things, about the dominance of superficial surfaces in Hollywood and a running theme is the idea of how performance is not simply an aspect of cinema\/acting, but is part of how all of us deal with the world around us. The fact that characters talk in movie soundbites a lot of the time is simply a reflection of where they are drawing their performances from.That said, to expect this to be a profound exploration of deep themes and ideas is to misunderstand the point of the show. More than anything this is a joyful romp about arguably the most exciting decade in Hollywood's history - the New Hollywood era when the great studios had ceased to operate as independent companies and became part of large corporations that had no real understanding of the businesses they had added to their port-folios. As a result a slew of great, challenging and very risky films were produced by studio heads like Evans, who ran circles around their corporate bosses and started greenlighting the kinds of films that major studios would hardly ever get behind either before or after.The series is a kind of love letter to this period. Sure, it plays a little fast and loose with the facts at times, and clearly it's a highly subjective take on events. It's based almost entirely on \"Albert Ruddy's experiences\" and the show flags this up very clearly at the beginning of each episode, so it's hardly as if anyone is trying to pull the wool over the audience's eyes.The series was developed by Michael Tolkin, who wrote the book and screenplay for the fantastic 'The Player' - Altman's great and brutal satire about Hollywood in the late 80s\/early 90s, so the show's pedigree is pretty impressive.Trust the audience ratings on this one - it's a joy to watch.","rating":"9\/10","date":"27 August 2022"}
{"title":"A Series You Can't Refuse!","review":"I will begin by saying that I have watched 'the Godfather' north of 170 times and so of course it's my favourite movie ever. So when I heard about 'the Offer' I was really skeptic towards it as I feared it may ruin my memory of the original movie.But my God what a series it has been so far, a breath of fresh air in between all the agenda driven tv shows and movies that are being shoved into our faces. Amazing actors, all of them, and a brilliant brilliant script. A must watch for anybody who just loves to hear a good story.Thank you, for letting me see how it must have felt to watch Marlon Brando at his first attempt at the Don!Thank you for showing me how my favourite actor ever (Al Pacino) got his mega debut!Thank you for letting me watch the process of how my favourite movie ever was made!","rating":"10\/10","date":"6 May 2022"}
{"title":"Totally sucks you in!","review":"This is great - ignore the bad reviews. The actors are all so good, and the story is compelling, not merely because this movie is epically ingrained in most Americans, but because it's a fascinating origin story.","rating":"10\/10","date":"2 May 2022"}
{"title":"Shocked the awards people didn't watch it, too good","review":"First of all, this miniseries was just amazing from start to finish. The cast was great, Matthew Goode really steals the show as Robert Evans and my god I'm surprised the golden globes never considered him for a nomination. It's very rare a miniseries comes along to take you back to history and see how one of the greatest movies ever made was made and the people behind the scenes. Every actor didn't miss a note on their characters and it was just amazing. Highly recommend you watch this and join in my anger to the awards people for not recognizing this miniseries this year. Also watch again.....","rating":"10\/10","date":"25 December 2022"}
{"title":"Ruddy Hell !","review":"I had intended to watch this series nearer the time it was released, but for whatever reason lost track of it, it has now arrived on the Paramount Plus system in the UK and I was really happy to get the opportunity. Despite the mixed response it seemed to have received, I love anything that recounts the story of Hollywood, even one as relatively recent as this and I really enjoyed it.Having left his job as a computer programmer, and successfully pitched the hit TV series \"Hogan's Heroes\", Albert Ruddy (Miles Teller) joins Paramount Pictures as a producer. For his first film, he convinces head of the studio Robert Evans (Matthew Goode) to hand him the reins of \"The Godfather\", an adaptation of the phenomenally successful book. The production though was not without controversy, as strong opposition came from the Italian-American Civil Rights league, which was founded by mobster Joe Colombo (Giovanni Ribisi). Ruddy negotiates this, and several other emergencies as he fights to get the movie finished.There are several really good performances in this, from Teller himself, from Dan Fogler as Francis Ford Coppola, from Burn Gorman as Charles Bluhdorn and Juno Temple as Bettye Mccartt. My undeniable favourite though was Matthew Goode portrayal of Robert Evans, who I was familiar with particularly from \"The Kid Stays in the Picture\" documentary. Goode does exaggerate the voice a tiny bit, but as an indication of what Robert Evans was like, I think it's a great turn and it's unfortunately that the performance wasn't better rewarded come the awards season.For the bulk of the series, there are two stories told, though they intersect at various points. Colombo establishes the league ostensibly in opposition to the production of the film, and under particular pressure from Sinatra to stop it. He establishes a relationship with Ruddy though and, through a number of compromises, he not only reverses his position, but actively supports the production. You also have the pressures of Paramount, that Gulf and Western are looking to offload but whose leader, Charles Bluhdorn, has a soft spot for.I can get that criticism that I saw that there are two many plot strands but for me, who knows a little bit about what is going to happen to the various films, properties and stars mentioned, I thought it was brilliant. I'd love to see Goode come back to play Evans again in a look at the production of \"The Cotton Club\" and the aftermath of that.","rating":"8\/10","date":"10 March 2023"}
{"title":"Riveting!","review":"I love this new show. Watched 3 episodes in a row and can't wait to see more!!! The characters are well cast and the story is easy to follow. I can actually envision another movie being made from this one.","rating":"10\/10","date":"29 April 2022"}
{"title":"The Offer (2022, Paramount+) Superlative, underrated treasure","review":"'The Offer' is a 2022 television series that debuted on Paramount+ in April of 2022 and had a ten episode run. It fictionalizes, in wonderful detail, the laborious process that was the making of 1972's 'The Godfather', thought by many to be one of the best, if not the best, American film ever made. The stars are all wonderful and luminous. Notably shining are Miles Teller and Juno Temple in lead roles, but also Matthew Goode as Bob Evans, Dan Fogler as Francis Ford Coppola and Burn Gorman as Charles Bludhorn.'The Godfather' is one of those things we have come to think of as a foregone conclusion. Of course it was made and of course it was brilliant kind of like the Mona Lisa or the Statue of Liberty. The making of the film shows that numerous people thought 'The Godfather' was far from a sure thing, and pretty much the production was pushed ever forward thanks in large part to the drive of a small handful of people. Just about everything was questioned from Puzo writing the script, to Coppola as director to the running time to Al Pacino as Michael. Al Ruddy, played by Teller, who produced the movie did anything and everything to get the film made including dealing with the mafia directly who, for various reasons, threatened the productions very existence. It is an amazing thing to see it all come together when we know the classic that 'The Godfather' would go on to be.This show is amazing and if you love 'The Godfather' or are a fan of film history at all you need to watch it. There is a documentary about the life and career of iconic film producer Bob Evans who headed Paramount Pictures during this period called 'The Kid Stays in the Picture'. Matthew Goode is so wonderful in the role of Evans it makes me want to dig up that documentary and watch his story again. Shockingly 'The Offer' did not get any Emmy nominations which I consider a travesty, and more of a result of the show being stuck on Paramount+ where it did not generate much buzz rather than it being on one of the streaming heavy hitters such as HBOmax or Apple or the like. In any case do not let that dissuade you. This is one of the best shows I have seen in quite sometime, and it is especially meaningful to a fan of movies as this is truly an homage and a celebration of the creation of one of our most revered films.Eric's Grade: A.","rating":"10\/10","date":"29 August 2022"}
{"title":"A Streaming Series You Can't Refuse","review":"I'm a guy who prides himself on seeing things through to the end. There have been times when I went to see a movie in a theater and I have flat out dozed off and woke up with a sore neck. The last program I saw streaming was \"The Batman\" and I fell asleep every time I watched it. But because I wanted to see what I had missed, I was willing to try and stay awake and watch it however many times as I did; 6 times. Unfortunately, the movie was boring enough to knock me out each time.But with \"The Offer\", I'll admit that I dozed off only once and it was only because I didn't get enough sleep the night before. I've never been curious about what happens behind the scenes or the entire film making process but I have been taken back to the golden times of Hollywood and this is only after the first 3 episodes. I look forward to what happens next and I do hope Paramount+ will do right by the legacies of Francis Ford Coppola, Mario Van Puzo, and the entire \"Godfather\" cast members.","rating":"10\/10","date":"29 April 2022"}
{"title":"Tone-Confused, Well-Acted \"Making\" of The Godfather","review":"The miniseries \"The Offer\" explores the behind-the-scenes making of the 1972 timeless classic \"The Godfather\" in a messy, zany, and serious manner. Yes, the tones are confused and some of the scenes make you wonder whether every single far-fetched incident really happened. Still, I have a lot of fun watching this well-acted, upbeat show, if only imagining that these mafia-associated occurrences happened in an alternate universe. The period drama is written mostly by Michael Tolkin, with a little aid from Leslie Greif, and is based on the experiences of the \"The Godfather\" producer Albert Ruddy.Ruddy, played by a serious, yet playful Miles Teller, is the main character of the show. Each episode follows Ruddy on a new escapade or obstacle that gets in the way of him making this movie - whether it's money, the Italian American crime syndicate disguised as a civil rights activist group, creative differences, or deceit. The show gets muddled and monotonous when it focuses on the characters' personal intimate relationships or the involvement of crime boss Joe Colombo (played by Giovanni Ribisi with a little too much of an exaggerated gangster personality) as these scenes are unnecessarily drawn out to tedious melodrama. Where the show shines and should focus more on are the scenes with Dan Fogler playing director Francis Ford Coppola and his interactions with the creative cast and crew of the movie. Seeing Justin Chambers as Brando and Anthony Ippolito as Pacino as well as the other actors who play actors in the movie is a real treat. The show also pays careful attention to its time period details and locales elevating the nostalgia.While watching the show, I couldn't help but research whether what I was watching was true. In an interview with writer Michael Tolkin regarding his talks with Albert Ruddy, it is revealed that many of the improbable events in the show happen out of order or context or are merely an amalgam of the actual events. If you are a cinephile, the story is a fun, enjoyable watch - even if it lacks humor and heart - in the sense that you are getting a semi-autobiographical reimagining of the making of one of the greatest films of all time, but do not look here if you are hoping for the actual truth of what transpired.","rating":"7\/10","date":"4 January 2023"}
{"title":"I would rather watch The Kid Stays in the Picture, again","review":"I have a thing for 1970s movies, not that they all are so perfect or great, but as an era of experimentation and burgeoning changes, captured in film. I very much liked Godfather 2 ( but not so much Godfather 1) , and I was interested in seeing this re enactment of the 1970s and making of Godfather. I loved Bob Evan's recollections in his animated movie about his life. This series was entertaining but fell flat .... so much of the dialogue and mannerisms were of today. Dialogue full of \" likes\" and \" Fing this or that\" , it seemed like kids playing dress up ( granted -some of the vintage clothes looked great!) . And as a passing fancy it seems the women were behind the men's successes... Mario's wife, Ruddy's chain smoking secretary, Ali McGraw as Evans' muse...I thought the actor who played Pacino was not only as breathtakingly gorgeous as Al was, but played him pretty well ( from someone who isnt crazy about re enactments of famous people. ) Overall, it is watchable but not compelling.","rating":"5\/10","date":"15 March 2023"}
{"title":"Highly Entertaining, Well Acted, Solid And Well Worth The Watch","review":"I had seen the movie \"The Kid Stays In The Picture\" about the legendary producer Robert Evans. When my husband started listening to the audio book of \"The Offer,\" I sought out this series for us to watch. We both enjoyed it immensely.First off, Mattthew Goode is a revelation as Evans. I had only ever seen him in period pieces and one rom-com with Amy Adams. He's a good actor, but he plays against type here and does it so well that I didn't realize it was him for the first couple of episodes. He nails the character's unique speech patterns and bravado and adds a comic flourish and a touch of pathos to it. He is just so much fun to watch in the role. It's a wonderful performance.All of the other actors are great too. Kudos to the casting agent for finding the perfect Francis Ford Coppola, the perfect Al Pacino and an excellent Mario Puzo. Burn Gorman as the Big Honcho owner of the studio is great too, and Juno Temple is every bit as good here as she is on \"Ted Lasso.\" The whole cast looks great and delivers. My only complaint is the actress they chose to play Diane Keaton. She doesn't really look like her and has almost no lines at all, if any. I felt like that was a big miss. She was an important part of the movie and deserved better.I was a very young child when \"The Godfather\" came out, much too young to remember just what a huge deal it was. The book was one that I remember being on my parents' bedside table, even though their usual taste ran to things like the John Updike \"Rabbitt\" books, Truman Capote's \"In Cold Blood\" and maybe books on bettering your bridge game.But I do remember my parents and three older siblings watching it on TV when it aired (this was years before Blockbuster, when you had to wait for something to air on one of the four networks and everyone was watching). I found it boring the first time, but I remembered it. Over the years I have watched it in whole and part more times than I can count. Seeing what went into making this classic was an absolute treat.I know that they changed things for the dramatization, particularly some things about Evans and producer Al Ruddy. But you know what? I don't care. I don't care who was on speaking terms with whom at whatever point in the process or who wanted to cut which iconic scene. The important thing is that this was sausage-making. It was messy and stressful and even dangerous at time. People put a lot on the line and the risk payed off. We almost didn't get this great movie. But we did, and the show honors that.Great show. I hope you like it as much as I did.","rating":"8\/10","date":"20 October 2023"}
{"title":"A series you can't refuse","review":"\"The Offer\" transports us to 1970's Hollywood as it shows us the making of \"The Godfather.\" While the entire cast is spectacular and seemingly having the time of their lives, Miles Teller, embodying the film's producer with charismatic swagger, delivers a standout performance. Juno Temple gives an equally impressive portrayal of a smart and spirited Bettye McCartt.Within \"The Offer,\" echoes of \"The Godfather\" resonate, unearthing power struggles involving creatives, studio heads, corporate moguls, and mobsters all seemingly depicted with heavy doses of historical fiction...a genre that I find entertaining. Balancing homage with freshness, the series is a delight to watch as it hooks the audience with a lighthearted pace.While the series is not perfect and doesn't seem to take itself seriously, as it navigates through themes of tongue-in-cheek dramedy to elementary simplicity, \"The Offer\" is a series you can't resist...or refuse.","rating":"8\/10","date":"14 August 2023"}
{"title":"Obsessed","review":"Addicted and obsessed with this series. The casting one hundred percent hit the nail on the head. Rud, Evans, Charlie, Betty, Francois, Joe, Cesar and more make you not want to take your eyes off the screen. And Hello how great the dialogue. Someone who originally was not a dan of The Godfather, I am now very interested. Knowing what was behind the creation and the sacrifice and it almost not making it to screen. The fight, the artistic battle and belief in this project makes us realize we all have this fight. Whatever we want, we must believe and not waver. It is a good lesson for us all. An incredible entertaining and inspiring series. It's definitely in the re-watch category.","rating":"10\/10","date":"3 January 2024"}
{"title":"Awesome. Just awesome","review":"Wow. I was 4 episodes in and it was already the best limited series I've ever seen. Just kept getting better and better. As a huge fan of the Godfather, watching how it was made was so interesting. All the inner-workings of Hollywood, politics and underworld life make such a great pseudo-documentary. Ready to watch it all again. Some great performances by Miles Teller, Matthew Goode, June Temple and Burn Gorman. Colin Hanks plays his usual weasel character and Giovanni Ribisi steal the show. Some unique casting with Uncle Marv from the Goldbergs as Coppola and Lou Ferrigni as Luca Brasi!! C'mon! Watch this show!","rating":"10\/10","date":"21 July 2023"}
{"title":"Class","review":"When I first saw this title and what it was about I put it low on my things to watch list. I have seen the godfather and thought it was a bit slow ( after all it isn't goodfellows). After a while I got round to giving this a bit of air time and was surprised at how good it is. It is so well written with some excellent acting. After a couple of episodes I was captivated. This a unique mini series which takes you into a story that not many people know about. After watching this I had more respect for the film the godfather as well as its actors. Without the work behind the scenes of the producer and backers it would never had been. This is well worth a watch. Excellent imo.","rating":"9\/10","date":"24 August 2023"}
{"title":"All thrills! Not a single episode is a miss","review":"I have to say, incredibly surprised by how great show turned out to be. Not only is acting fantastic. The show is full of twist and turns where truth turned out to be stranger than fiction.Miles Teller, and Matthew Goode, Burn Gorman, Colin Hanks, Juno Temple and Giovanni Ribisi all shine!I learned quite a bit by watching this, about all of the fascinating events, drama, and craziness that goes on with producing a movie. In truth until watching this, I didn't fully know what exactly a producer did, but now I think I've got the full picture. I have to say being a producer sounds pretty rewarding based on what I've seen on the show. Perhaps times are different now, but this show will make you long for the 70s.The portrayals of all the actors from the Godfather in various stages of their careers is truly fascinating for someone who loves the film industry. They may not be the star of my time but these were stars nonetheless. The story manages to combine organize crime, an inside look into the history behind other storied films, an underdog story, and great personal stories behind those too.The finale was satisfying and seeing them get to celebrate what ultimately became one of the greatest films of the 20th century. Bravo!","rating":"10\/10","date":"21 October 2023"}
{"title":"true incident - highly exciting and informative for all who are interested in film history","review":"How the 1972 classic \"The Godfather\" (almost didn't) came to be - the ultimate Mafia epic, which actually doesn't mention the word Mafia a single time.Tolkien's making-of chronicle \"The Offer\" is based on the memories of producer Albert S. Ruddy. And he said, \"Every day of The Godfather was the worst day of my life.\"Right from the beginning the series picks up speed, in the first episode so much already happens, as it is surprising what all fits into almost 60 min.As a film fan (and employee in the film industry), your heart goes out to the huge original Paramount Picture Studios - quote from the film, \"This place is a damn sanctuary\". The 70's setting is completely high quality and consistently realized. In addition, the fantastic soundtrack, which carries away from the first episode.The cast \/ the actors are all convincing through and through. Especially, of course, the main characters, would like to mention here that I like Juno Temple as a patente secretary Bettye McCartt (who later manages stars like George Clooney) has grown to my heart and hats off, for the time as a woman in management.Back then you didn't need a degree to make movies, just passion, perseverance and skill.We devoured this series, because for us everything really fit: Story, which is extremely exciting and also touches here and there, convincing and sympathetic actors, great setting and a great soundtrack.------------\nConclusion:\nIf you are interested in the story of \"The Godfather\" or in film history in general, you will absolutely get your money's worth. But beware: It is NOT the movie, it is not a stand-alone mafia story,","rating":"10\/10","date":"28 July 2023"}
{"title":"an excellent show","review":"The Offer is an opportunity to pull back the curtain and view the world of what it takes to make a movie. The show is excellent. The story is real and the characters have depth. I can't wait to see season 2!","rating":"9\/10","date":"2 May 2022"}
{"title":"Very impressed but not perfect","review":"These generation Is going back to the days I missed with the television movies and series. People are bank rolling on TV series. I'm not talking about the streaming ones like narcos or orange Is the new black. This series comes out every Thursday so if you binge watch the first 6 episodes like I did you have to wait. Luckily for me it's Thursday.But enough about that let's get to the actual review of the first 6 episodes I watched. This is gonna start out slow. So for all you godfather fans like me who are wondering who is who cause you are ready to put the puzzle pieces together then stop. They won't be honest all there till the 4th or 5th episode.This series is mostly about the miles character who is the main producer and his battles with separate inviduals on how to get the godfather producing. It will go in detail from quiting his computer it job to how got to paramount and hired his secretary. I mean they have time so nothing is rushed. This also goes over joe Columbo and his leadership of the Columbo crime family.Let me say this before anyone watches this series. This isn't going to be a factual movie other than the names involved. I also took off two points for that. Obviously frank Sinatra isn't calling any mafia boses up on the phone and cussing them out. But he did see puzzo in the restaurant and tell him where he could go. And secretaries are going to schedule a sit down with a mob boss.Other than that I do believe members of the mob where on production set. Robert Evans character was funny and we could not stop laughing. My girlfriend and I were like he might be doing some method acting he was too good at being a jerk boss. Also don't like how puzzo is made to look like an overvweight gambler.Frankly this series is good but if they would have made the actual godfather with this tone of diminishing Italians as they do in this...it wouldnt have made. It's a 7. I could go on the injustices were done to Italians in this movie but I'm not.","rating":"7\/10","date":"27 May 2022"}
{"title":"Boring story about a tremendous film","review":"First off, Ruddy fixes everything. We don't know how he does it, they don't think it's necessary to tell us but he can fix anything (how the heck did he fix Redford's legal problems to get him to do his film?). It's super annoying and he's a severely unlikeable character (I have no idea how much of this is really like him, however he was one of the producers so I guess a lot).I love the Godfather so I really wanted this to be good. But it drags. It's repetitive and boring a lot of the time. There were a couple episodes I couldn't get through in one sitting. Some of the people are cast well and some are not. I loved the guy playing Pacino but my God, Pacino didn't look at the floor constantly.But man, they took what could have been a great story and made it boring. We never see any reenactments of the real film either, we see them about to start shooting, then the reactions of the Coppola and Ruddy. That sucked.Ruddy was seriously miscast too. Miles Teller was not good and I like Miles.But yeah, does make you want to watch the Godfather again and I probably watch it every couple years. But what a boring show.","rating":"4\/10","date":"16 June 2022"}
{"title":"I don't know what the hell is up with these random low scores..","review":"You can see it has a 95% viewer score on rotten tomatoes and almost a 9 here. Critics rest around 50% which seems suspect. The show is great. The acting is great. I'm sure the story isn't 100% truthful but it's highly entertaining and each episode leaves you waiting for the next. There's a trash pile of shows coming out on streaming services but this isn't one of them. Don't believe me? Just try one episode. Hell Paramount+ has all kinds of free trials.","rating":"9\/10","date":"4 June 2022"}
{"title":"Casting alone deserves a Golden Globe","review":"When you know you know..\nA lot of talent in this mini series .If it was done as a movie maybe would lost story but probably would be been in the next Oscars.Is one of these series you \"inhale\" not just binge. Quick,witty,street smart and substantial makes you pause even when you are looking for your lighter to light a cigarette.The casting is spooky good! Coppola and Pacino are spitting images of the real actors with the right make up and mannerisms. Just amazing! And Giovanni Ribisi! I ve waited a long time to play something like that especially after the huge disappointment from the cancelation of sneaky Pete.The resemblance of this show with Vinyl(masterpiece)is there for a few Series junkies like me to see.Let's hope they won't cancel this one as well...","rating":"10\/10","date":"4 May 2022"}
{"title":"No Godfather Fan Can Miss This","review":"From my experience as someone who saw The Godfather in 1972 and have loved it ever since, the one thing that I have dreaded is Hollywood remaking it. The temptation over the years must have been great yet thankfully it didnt happen. At that same time, I cant get enough of The Godfather. The Offer is the perfect answer!It's about how the movie got made, how it many times almost didnt get made. All of the people involved are here, most looking and sounding just like the actual people. And there are lots of things that will come as a surprise, even to avid fans.No, this has none of the great writing and acting of the Godfather but thats not the point of this series. It's for those who were around then to get another taste of the early 70s, and for those who werent to see what they missed.","rating":"10\/10","date":"2 May 2022"}
{"title":"It's a tie between The Offer and Fleishman","review":"Absolutely terrific series that I highly recommend. Well deserving of its lofty high IMDB score of 8+. There's been talk that Hollywood is lacking true male movie stars. Myles Teller is looking to fill that role.The only reason I didn't give this series a ten out of ten was because from what I've read online, it's pretty far removed from the true story.That being said, the historical fiction around this series is true enough to make it a solid winner.As I mentioned Myles Teller is great but he's more of a straight man to fantastic characters such as Mathew Goode's Bob Evans. He basically steals the show and it's well deserved. Everyone in this ensemble is wonderful. Can't say enough about how well this series was executed. I may even watch it a second time, something I never do.Bravo!","rating":"9\/10","date":"21 February 2023"}
{"title":"They Don't Make Shows Like This Anymore","review":"Love, love, love this show.The energy, the pace, the insights and the performances are amazing. Not only that but I feel like you could easily make this into a series about different movies and the behind the scenes.I love the script and the performances of every character. Past few years there have been shows that are passable. This is one of those essential shows to watch for years to come.","rating":"10\/10","date":"6 May 2022"}
{"title":"I saw","review":"The trailers for this and wasn't sure I wanted at add Paramount again( as it never has a lot of new stuff). I saw I could watch the first episode free last night with my Prime so I did. F--- Frank Sinatra! Lol I do not think you have to have seen the Godfather to like this. I can't even remember the movie. Yes I'm old enough I am one of the few that didn't get into the movies( even tho Pacino is my favorite actor of all time)! I still am enjoying this especially since I was fascinated with big studios growing up ad watched all the shows about them. I do however think anyone under 40 probably won't appreciate it. I forget the actor who plays the guy with the weird voice( thought it was Hugh Jackman) ? I don't like him. I love Juno Temple and most of the cast and was just looking and saw Jake Cannavale is in it! I love Bobby( didn't know he had a son. Can't wait what to see what he brings to the table. So judging off one episode I'll wait until all the episodes are released and just buy Paramount to watch. To be continued. Lol.","rating":"8\/10","date":"30 April 2022"}
{"title":"The best BTS ever made, about the best film ever made.","review":"What a grand standing ovation for the creation of the greatest film of all time.I am a grown 42-year-old man, and I got the goosebumps at least once every episode. Every actor nailed it.Bravo.","rating":"9\/10","date":"15 May 2022"}
{"title":"Incredible","review":"This show was a masterpiece. The writing the way it transports you to being there. Would have been a 10 but Colin hanks can't act and I'm not sure when the world will quit putting him in things. But literally everything else is perfect in this show.","rating":"9\/10","date":"30 June 2022"}
{"title":"Entertainingly dumb, self-serving soap opera...","review":"The amazing tale of how producer Ruddy went toe to toe with the Mafia to make the greatest movie ever. Silly, over-the-top performance by Matthew Goode. Cartoony mobsters straight out of the SNL version of Goodfellas.","rating":"7\/10","date":"30 April 2022"}
{"title":"For gen z only","review":"I'm a great fan of the Godfather movies, so I gave this show a chance, even knowing that 2022 culture could probably have ruined this as well. I wasn't wrong, 15min in and we already saw twice the \"stunning brave woman\" complex. It's hilarious, that would never happen during that time. Anyway, it's just one more garbage tv show during this period of virtue signaling entertainment. Hard pass, don't need to watch any longer.At least I can still watch Succession, Ozark and Better Call Saul, the only modern shows without woke bs.","rating":"1\/10","date":"1 May 2022"}
{"title":"Talent and creativity is still alive","review":"On episode 3 and this is some of the best new TV I've seen for a while.This knits together a real life scenario about the making of one of the greatest films of all time into a fresh and massively entertaining drama with a underlying humour.The acting is second to none, the characters bring the whole thing to life..\nMiles Teller is always brilliant in my opinion, but the whole cast nail it.. Juno Temple in particular.The cinematography is fantastic , gives the feel and vibe of Hollywood in the late 60's early 70's..\nVery reminiscent of the feel that Quentin Tarantino managed to capture in Once upon a time in Hollywood.","rating":"10\/10","date":"22 September 2023"}
{"title":"I couldn't stop watching","review":"I absolutely loved this series. I binged it over two days. Giovanni Ribisi was very entertaining as Joe Colombo. Mathew Goode delivered some great monologues. Juno Temple was the real star of the show. Her acting was nothing short of superb. Juno and Miles Tellers on screen chemistry kept the the viewer reeled in throughout the series. I wasn't too sure about about Dan Fogler as Frances Ford Copella, although he looked a lot like Copella, the characters on screen mannerisms reminded me too much of his character in fantastic beasts, and less like Copella. The actor that played played Al pacino played the character so good I actually thought it was a young pacino. Brilliant show. I enjoyed it Immensely.","rating":"10\/10","date":"23 October 2023"}
{"title":"Entertaining view about creation of Godfather","review":"Greetings from Lithuania.\"The Offer\" (2022), a limited series about creation of The Godfather was entertaining show enough for me to watch its entire 10 episodes. All of them were solid, because acting was superb, set design was fabulous and directing was superb. Non of the episodes were boring or uninvolving. I read many things about creation of Godfather, therefore some of the moments were simply intruiging to see it on screen. What i would like to see next is series about creation of \"Apocalypse Now\" - that would be one hell of a show.Overall, while not being very realistic creators did a good job with \"The Offer\". Its a colorful and entertaining show about creation of a masterpiece and arguably best film even made - The Godfather (to which I totally agree).","rating":"8\/10","date":"29 April 2023"}
{"title":"The bonus features that doesn't exist on the Blu-Ray","review":"I have watched the bonus features of The Godfather so many times and read a lot of articles or watched videos on the making of The Godfather. I always thought I had read or watched everything that is there to read or see about the behind the scenes of this movie that is arguably the greatest movie of all times.This is why the series took me by surprise, since I really did not know a lot about the making of this movie. I really believed it was a war between Francis Coppola and the stuidios. But, Al Ruddy's version of how he had to fight hard to get the movie made is a fresh perspective, and presumably authentic since he produced this series too and is a first person account really. I mean even if some of the things are exaggarated (and I do believe it is), it still was a lot to produce the movie and make it see the light of the day!! My only grouse is Mario Puzo and Francis Coppola are made to look almost like comical characters in the first few episodes. A little more of the genious of Coppola could have been highlighted. After all, he was the person who created this masterpiece.In terms of performances, Matthew Goode as Bob Evans steals the show in my opinion. I don't know how Bob Evans was in real life, but Goode's performance makes you want to believe Bob Evans was exactly like how Goode performed in this series.If you are a fan of The Godfather and have watched it a million times like I have, you are bound to enjoy this series.","rating":"9\/10","date":"19 June 2023"}
{"title":"UPDATE: EXCELLENT!! (Subject to change, probably for the better)","review":"Just finished watching the series. As hoped and expected, the series gets better and better after the first two episodes. Or perhaps maintains its trajectory including the last two episodes which deal more with post production.The achievement of caring about the actual people\/characters that created this masterpiece occurs effortlessly throughout making episodes 9 and 10 every bit as important and engaging as episodes 1 and 2. That's a very difficult task, in my opinion, considering the mammoth subject matter. WATCH THIS SHOW!!!I've only watched the first two episodes. I consider myself to be a decent historian on both the Hollywood and Cosa Nostra sides of this story. I fell in love in the first five minutes.The Offer should not be refused. The casting and cast are excellent. Every performance makes you want to learn more about the story; Matthew Goode, Juno Temple, Patrick Gallo and Dan Fogler stand out in the particularly proven talent dense ensemble.The writing, design and cinematography craft the setting, while the directing and acting take every advantage of those settings to mold moments. I can't wait to see more.I sometimes struggle with portrayals of history on the screen. Especially when it is a history with which I am very familiar. I recognize that weakness and remind myself I was not actually there. That said, I find this offering to be very consistent with almost everything that I think I know...EXCEPT...POSSIBLE SPOILER BUT I DON'T THINK SO...The portrayal of the Sinatra sub plot. The gist seems right. BUT, Frank Sinatra does not call Joe Columbo and tell him to \"handle\" anything...EVER. Sinatra no doubt held power in Hollywood at the time. On the phone to a family boss that came up due to his proficiency as a murderer is not Hollywood. Francis Albert was their puppet. He OWED, not OWNED, them. Phew. Got that off my chest.It's still an awesome series...not a history book. WATCH THIS SHOW!!","rating":"9\/10","date":"7 May 2022"}
{"title":"Most Underappreciated Show Of All Time!","review":"God damn it. Loved this show immediately since early hours of watching, and all of a sudden I realized, this show hasn't received any major credit and got shocked to my core! Why? Just why?This is surly the most underappreciated and underrated show of television history and I felt sorry for myself that I started watching this show a Year after got released and I'm blaming everyone involved from publicists to social media and god knows who...\nAll this discontent aside, that had to be said for all motion pictures enthusiast (such as myself), this is a must watch show, and believe me, it's all worth your time.This show offers you a fresh perspective to what's behind the curtain through eyes of a cast and crew that sacrificed everything in order to achieve their unique visions, hesitations and of course the cold reality of it, Money Making Business.","rating":"10\/10","date":"18 March 2023"}
{"title":"Excellent!!!","review":"I loved it. Hate that its over. Everything was great especially Matthew Goode as Robert Evans. He looked and sounded just like the real Robert Evans. Loved it.ðŸ™‚","rating":"10\/10","date":"16 June 2022"}
{"title":"It was an offer I could not refuse","review":"As a fan of the Godfather movies , yes all 3 of them , I was looking forward to this series. I was not disappointed, it is clearly not a documentary and the actors who play Pancino , Brando , FFC and Puzi are very credible. Miles Teller who plays Ruddy does so with a clear determination. The vibe of the show is classy , it's well shot and I eagerly await the remaining eps .","rating":"10\/10","date":"7 May 2022"}
{"title":"Worth a watch if you like The Godfather.","review":"This show was well done and interesting.You get to see aspects of hollywood, politics, and the mafia.POSITIVES:\nThe story was very good and even though you know it ends with the Godfather being made and released, the show still manages to create a lot of tension and mystery along the way. I think this is the best compliment I can give the series and they did a great job because I had to remind myself at times that I already knew how things would work out even though it looked doubtful not certain actors would be gotten or the movie would be made at all.NEGATIVES:\nColin Hanks gave his typical flat emotionless terrible performance, thankfully he had limited screen time.","rating":"7\/10","date":"27 June 2022"}
{"title":"Self-congratulatory Circle Jerk","review":"In a recent interview, Coppola claimed to have never seen Al Ruddy on the set. So, despite the shill-scented max ratings offered by anonymous fan boys, this is a questionable enterprise attempting to add luster to Paramount's image, but only managing to tarnish it instead.","rating":"1\/10","date":"29 April 2022"}
{"title":"Best Show about a Movie... Ever!","review":"In the end, this show is a masterpiece unto itself. There is some amazing talent in this show, and the production showed a reverence for the original movie that I have rarely seen in any parallel.It's an easy 8 - 10.","rating":"10\/10","date":"11 June 2022"}
{"title":"I'm Shocked by How Much I Love This One","review":"I have zero complaints. Every scene in this show mesmerizes me. The performances from everyone involved; the engaging dialogue; the way it makes me care about each and every character ... \"Well done\" to this entire cast and crew.","rating":"10\/10","date":"12 August 2022"}
{"title":"A joy to watch and learned a lot too!","review":"This was pure joy to watch!! And I learned a ton of things about the movie that I never knew nor imagined. I saw the movie 50 years ago and remembered some, but not all of it.I gave it 9 instead of 10 stars because I got sooooooo tired of hearing Ruddy say \"I'll take care of it.\" and \"I'll make it happen.\" It should be a drinking game. Ruddy is certainly impressed with himself - as he should be. And he does give other people their due, but he puts himself out front and center a bit too much and too often. Of course you absolutely need a MASSIVE ego to deal with the people he dealt with and make the movie he did. His ego matched theirs.I was glad to learn about the Marlon Brando I didn't know existed. (He was not a favorite of mine.) I now have a new appreciation and respect of him.There is never a dull moment. And the end is a montage of what the real people were like and what happened to them after Godfather.After I watched this, of course I had to watch The Godfather again to see the scenes that were highlighted in this series. It was fun to see the actual scenes!This is well worth the watch! All the actors are brilliant at who they play.Enjoy a quality production and a well-told story!","rating":"9\/10","date":"28 August 2022"}
{"title":"The Drama Behind the Film","review":"I can't express how much I loved this series. The show does the impossible: makes Hollywood characters likable! Al, Bob, Bettye, Francis, even the bigwigs at Paramount that get in the way for much of the filming of the Godfather...I fell in love with all of them. Burn Gorman is delightful as always. Much like his character in TURN, he straddles the line between villain and antihero better than most. Giovanni Ribisi slays in the role of Joe Colombo too. He's been one of my favorite actors for 2 decades and he continues to absolutely kill it.I'll be honest...I'm not the most sentimental type...but this show tried to get me misty eyed a couple times...and may have succeeded.I continue to sound the call for Matthew Goode being one of the most underrated actors in the business. He's amazing. And so is The Offer. You won't be disappointed. I hope to find more shows like this.","rating":"10\/10","date":"8 September 2022"}
{"title":"Love it!","review":"This series is excellent. In an era of garbage and woke trash films and series this is a gem. Well written well acted. If you are a fan of the greatest film ever made you will love this. If your not you will at least appreciate this series its well done.","rating":"9\/10","date":"16 June 2022"}
{"title":"Long Awaited!!!!","review":"Ribisi delivers again, Gandolfini surprise also shines, has his old man's class and confidence. This is sailing along real good and I don't intend to miss, many players I don't recognize yet this series is happening. Where did you get the mini Coppola he's awesome. I dread to see Ribisi get whacked because Ribisi the man for Joe Colombo.","rating":"10\/10","date":"19 May 2022"}
{"title":"Casting is superb, Story is Compelling!!!","review":"If you're familiar with the film the \"Godfather\" and want to know the exciting story of how it made it to the screen to become one of the greatest cinematic gems ever produced, watch this show. The story is compelling and sucks you in, which is told my amazing actors filling the shoes of some difficult personalities to portray.If Paramount doesn't secure the rights to Bob Evans life, that's so eloquently told in the documentary \"The Kid Stays in the Picture\" and cast Matthew Goode to play the title role they'd be overlooking a tremendous opportunity to tell and even larger tale that is filled with endless story lines.Yet till then, enjoy The Offer. It's a really good.","rating":"9\/10","date":"7 May 2022"}
{"title":"Bravissimo","review":"When I saw that this was 10 episodes long I wasn't sure I wanted to get into it because that usually indicates drawn out story, boring, pointless middle episodes designed only to extend beyond its value as entertainment. Now I'm sure. I am so glad I didn't dismiss it due to preconceptions because this is one fantastic limited series.First of all it's a great story and the writing is really superb. But what makes it stand out is the acting. Miles Teller., Burn Gorman, Colin Hanks, and Juno Temple are flat out excellent. And I mean award season excellent. But as good as they are in this Matthew Goode as Robert Evans and Dan Fogler as Coppolla are really the true show stoppers here. The only one who I felt wasn't as effective, which is not to say it was bad, was Giovanni Ribisi. He carried his part ok, as good you could expect, I just think it was a little bit of a miscasting. But it didn't detract from this very excellent series. I guess you know if you've just watched something really good when you're sorry it ended. I was sorry when it ended.If you are a fan of The Godfather movies you really should check this series out. Even if you're not it is highly entertaining. It also has one of the best soundtracks I've heard.","rating":"9\/10","date":"6 July 2022"}
{"title":"Another good show hijacked by feminist propaganda","review":"This show was really going ok.It had a good story (accuracy debatable) some excellent performances and was generally very enjoyable until it had to insert the present feminist agenda.It was jarring and completely unnecessary.It's so disappointing we can't enjoy shows and films without being constantly hit on the head by others agandas.There's a time and place but not in a story set 50 years ago about the making of a mafia film.","rating":"7\/10","date":"12 June 2022"}
{"title":"If Francis Ford Coppola was so vapid...","review":"Then how do you explain the fact he followed this movie with The Godfather 2, which was actually superior to The Godfather, and it's hard to outdo the greatest movie ever made, but he did... and then The Conversation followed by Apocalypse Now while Al Ruddy, shown here as the hero and smartest guy in the room, collaborated on a string of Burt Reynolds action comedies...And, so, following The Kid Stays in the Picture where Paramount chief Robert Evans takes credit over Coppola for The Godfather being... The Godfather, now it's Ruddy's turn...Coppola has now entered the Orson Welles Syndrome in that he's shown as a silly stooge about a movie he made while giving everyone else credit, just trade Citizen Kane (John Houseman, Gregg Toland, Herman Mankiewicz) with The Godfather (Evans, Ruddy) but...Seriously... The Godfather 2 makes both Evans and Ruddy basically nonexistent, and yet it's no surprise given how much the stooges running Paramount back then had hated Coppola...Looks like they still got it in for him, or else... being that this subpar jukebox style Goodfellas clone (starring Miles Teller, resembling more of a high school jock than a New York wheeler-dealer) was based on Ruddy's work, a producer... they, Paramount, now want the credit for a movie they really fought hard to be made completely different than it was made in 1971...Just trying imaging Ernest Borgnine as Don Corleone and Robert Redford as Michael, and then thank one man for fighting for Marlon Brando and Al Pacino...And that man is NEITHER Al or Dick.","rating":"1\/10","date":"6 September 2022"}
{"title":"Nailed the movie characters","review":"This is one of the best series I've seen. The acting is superb, the writing is amazing, and the way the movie interweaves with the movie itself is outstanding. Adam Arkin really hit it out of the ballpark, as did everyone else who worked on this production. Matthew Goode deserves some kind of an award because his character is fun to watch.","rating":"9\/10","date":"14 June 2022"}
{"title":"Very Entertaining!","review":"Great idea, making a series about the making of \"The Godfather.\" Now I don't know where the truth ends and the fictional part takes over...the film world has been known to embellish the truth. But as is it's a great story about producer Albert Ruddy as he succeeded in adapting author Mario Puzo's best seller into a great film. The adaptation was faithful, there was nothing in the film that wasn't in the book, although quite a bit had to be left out. According to \"The Offer\" the Mafia didn't want the film made, but Ruddy was able to convince Joe Columbo that it wouldn't be a deragatory presentation. Also Paramount studios, who were now owned by Gulf & Western, were more concerned about production costs than quality and much of the story deals with this infighting. The only weakness is that it becomes too much of a story about Paramount Sr VP Robert Evans, legendary Hollywood womanizer, coke head and egotist, who did throw restrained support to the project, and to Ruddy and Director Francis Coppola. Solid performances from a large cast, quite a bit of humor. One other complaint-signing up to Paramount Plus for a free trial is difficult. As is canceling after completion. Also it has commercials. No thanks, there are better streaming services.","rating":"9\/10","date":"3 November 2022"}
{"title":"fascinating insight to the movie industry","review":"No idea how much is true and hw much is fiction for the sake of a good show but it feels as if it could have happened this way. Excellent viewing, great script, superb performances, especially from Burn Gorman, who I feel has bever been used as well as he could, but in this he is brilliant, as are the rest of the cast. Also, a sneak under the hollywood magic to see how money vs art.","rating":"9\/10","date":"19 May 2022"}
{"title":"Baffled by the Vitriol from Critics","review":"This is the type of series that critics love. And yet, they are trashing it mercilessly. I don't get it. The casting is almost pitch perfect (minus the liberties taken with the height differential between Francis Ford Coppola and Dan Fogler) The story is involving and the characters are ... a part of history. If you love learning about the making of a classic film (which of anyone doesn't consider The Godfather to be an absolute classic piece of cinema, they need to get their heads examined) in docudrama fashion, you're going to enjoy this series. I just don't see why critics have torn this series apart. They live for this type of stuff!","rating":"9\/10","date":"21 May 2022"}
{"title":"Paramount+ once again Hit a Homerun","review":"Paramount+ is becoming one of the best streaming apps available.The shows they put out, are by far some of the best available to watch.They stay away from wholeness for the most part, and have quality acting, from up and comers or veterans who never got the respect they deserve.I watched \"The Offer\" because I was bored, and I was hooked after the first episode.I can't wait to see what else they have coming.Miles Teller is amazing, and Giovanni Ribisi is so underrated it's almost criminal.Only reason I didn't give 10 stars is because, \"The Offer\" had me wanting to watch \"The Godfather\", and it's not available on Paramount+ yet.","rating":"9\/10","date":"5 June 2023"}
{"title":"By Far the Best.","review":"Absolutely the best series produced on any film platform in many many years. Each episode is better and more \"edge of the seat\" than the last. I loved the movies but this telling of the making of them is amazing. The actors\/actresses are amazing and the people they are portraying from RL are even more amazing. You must watch this if you watch nothing else produced for the rest of the year.","rating":"10\/10","date":"3 June 2022"}
{"title":"Thanks for sharing, Ruddy","review":"I have to say when I first started watching this, I was underwhelmed; however, once it gets going, it is such a good show. It is so interesting to see these back stories to the making of the Godfather. These are stories we never knew, and seeing this in the time period of the 70's is very nostalgic. So after watching a few of the episodes of the The Offer and seeing all of the background, especially with actual mafia, I had to rewatch the Godfather plus the sequels. The production of The Offer is great. Outstanding is the music and the writing. The acting is great all around, but the performance of Giovani Ribisi as Joe Columbo is worth watching this show alone.","rating":"10\/10","date":"12 June 2022"}
{"title":"The Offer is Very Good","review":"Just excellent. It;s transporting. I think we could guess how hard The Godfather as a project was to get off the ground. This is that story and brilliantly executed.","rating":"10\/10","date":"17 May 2022"}
{"title":"Started off great in the first half then takes a bit of a nosedive at the end.","review":"First of all, I would like to say that this series is definitely worth a watch. I really liked the historical behind the scenes feel to it. I felt though that it was more of a Al Ruddy tribute than a Godfather one though.Some of the impressions were spot on like actor playing Brando for example. He really sounded just like The Don.But, Pacino?? His nasally impression was downright awful. I also thought that Giovanni Ribisi impression of Colombo was very forced and that made it tough to take him seriously.Matthew Goode was also a little too over the top for my liking as Bob Evans. These were some of the biggest flaws for me, well those and the Hollywood touch of drama with something always going wrong that could shut down the production. I don't doubt that there were many obstacles to overcome but no where as many that were portrayed.Overall solid series though.","rating":"7\/10","date":"7 July 2022"}
{"title":"The offer I'll pass on","review":"Like literally every movie I've seen on topics of famous people, movies, music bands etc. I find myself trapped in the same old formulaic scenario: I watch it, hear those big names that bring me joy, listen to that sweet old music, see those people I adore played by lookalike actors and how am I or any other fan of this art piece supposed to react to this? Give ten out of ten and proclaim it brilliant? Well not in a million years because the execution is awful to say the least. Characters are bland and indistinguishable from one another, they have zero chemistry, zero background, zero emotions and are just out there to deliver the lines and get the plot moving, and for a ten hour movie it is obscenely overstuffed with unnecessary dialogues, expositions and my \"favorite\" conveniences. Everything is convenient here and the events conveniently flow into one another and form a mess that you just can't grasp, even with the undying love for the original that the creators so mercilessly butchered into this. And I'd like to be bland here also and say that The Offer made us an offer we can and should refuse.","rating":"5\/10","date":"8 May 2022"}
{"title":"Too bad it's a miniseries but WOW!!!","review":"I got no complaints. I'd give it a 10 but those ratings are rarely taken seriously and this production and everyone in it deserves at least as much. The making of the greatest movie almost never made is worthy of \"The Godfather\" itself. There are some aspects of this series worth mentioning. All of the cast members were skillfully placed in their roles. I saw everyone at their best. Nobody half-assed anything. Their true mettle was tested and proven. I really want to give Miles Teller a big shout out. What a refreshing, impressive and desperately needed leading man in Hollywood these days. He's so convincing, charismatic, and capable. He can bullseye critical levels of intensity with astonishing ability. Even his subtleties are nothing short of genius. You got to respect an actor with equal parts talent and balls. The man's got guts and true grit. It's always a pleasure watching an artisan at work and Teller always delivers. I'd say the best attribute of \"The Offer\" besides the obvious, is that unlike every other series, this one has no fat and all meat; no chaff just the wheat.","rating":"9\/10","date":"22 May 2022"}
{"title":"Wonderful retelling of the making of 'The Godfather'","review":"Review for the complete tv show:\nBased on the experiences by the real Albert S. Ruddy, the show runners Leslie Greif and Michael Tolkin with the real Albert S. Ruddy and Miles Teller (producer and main cast, playing Ruddy) created a wonderful and excellent tv show about the making of 'The Godfather'.Full of details in set design, production and soundtrack, excellently cast even till the smallest part and full of references to the show business, Hollywood and the creators\/cast of 'The Godfather' during the late 60s and early 70s, this show takes you behind the scene and tells the stories and lives of the women and men behind the movie 'The Godfather'.Divided mainly in three different points of view:\nthe makers\/crew of the movie,\nthe management of the studios (Gulff&Western \/ Paramount),\nsome italian mobsters (Joe Colombo & others)\nthis tv show is like 'The Godfather' itself about family, loyalty, love and business\/money.Although we all know the end, the movie 'The Godfather' got realized by Francis Ford Coppola, got Academy Awards wins, was one of the highest grosses at the Box Office in the 70s and is for a lot of critics the best movie ever made, this show is about the private lives, the drama and conflicts and dilemmas of all participants during the making of the movie. And that's what drives this tv show: it's the characters.Excellently acted,\ngreat cinematography,\nwonderful and detailled set design and production values,\nthis tv show is a winner and surprised me, how good it is.Highly recommended for fans of 'The Godfather', for movie nerds, for fans of character driven stories and for anyone, who likes to watch an excellent drama tv show.","rating":"9\/10","date":"22 June 2022"}
{"title":"Perfection","review":"As good as a series can get. Pure magic for fans of The Godfather AND fans of film-making in general. A masters-level class on the inside of writing, acting, producing and directing a long form series.Hard to pick one performance over another, one episode over another. The whole thing is a masterpiece.The ability of the series to create the same mood and lighting of a movie done 50 years ago is quite stunning. The backstory on casting and the inner-tangles within corporate empires AND organized crime is fascinating.There are literally five or six scenes over the ten episodes that will stick with for a long time.Great work.","rating":"10\/10","date":"12 November 2022"}
{"title":"A Masterpiece.","review":"The Offer is the next best thing to The Godfather! Or is it the other way around! If you're a fan of The Godfather, this is a must watch. Perfectly cast. Perfect pacing. Awesome dialog. One of the very best series currently streaming.","rating":"10\/10","date":"20 July 2022"}
{"title":"behind the scenes epic","review":"Albert S. Ruddy (Miles Teller) is tired of his computer programming job at the Rand Corporation. After a chance encounter, he ends up pitching Hogan's Heroes to CBS. Despite being a success, he walks away and convinces Paramount Pictures senior VP Robert Evans (Matthew Goode) to hire him as a movie producer. Bettye McCartt (Juno Temple) pushes her way into being his assistant. They take on Mario Puzo's The Godfather and hire untested Francis Ford Coppola (Dan Fogler) as the director. They have to convince CEO Charles Bluhdorn (Burn Gorman) on the project while budget-obsessed VP Barry Lapidus (Colin Hanks) constantly pushes for all the wrong moves. That is before the hate from Frank Sinatra and the Italian mafia led by mob boss Joe Colombo (Giovanni Ribisi).Paramount+ is doing Paramount Pictures. Hollywood often does some navel-gazing. Those are often pretty good. This one comes with a healthy dose of the mob. I didn't know much about the Godfather production although I did hear about some light mob involvement or interference. That part is very compelling and eye-opening. I'm not completely convinced with Ribisi as a mob boss. I've seen him do too much. He's always the slacker teenager to me. Matthew Goode is going all out to play Robert Evans. The behind the scene stuff is interesting although some of the 'famous' characters can feel like impersonations. It's a lot of old Hollywood people and films. It's unavoidable, but it is a lot referencing. All in all, this is an epic story by itself.","rating":"8\/10","date":"29 May 2023"}
{"title":"Really, really good!!","review":"I explicitly subscribed to Paramount+ to watch this show, and I'm sooo glad I did. A stylized biography of probably the greatest film ever made. It did not disappoint one bit. Mathew Goode as Robert Evans is Emmy\/Golden Globe stuff. And I learned so much more about a movie I already loved also! A true must watch.","rating":"9\/10","date":"2 July 2022"}
{"title":"Matthew Goode is The Offer","review":"The cast is wonderful , but Matthew Goode takes this to another level. Throughly enjoyed this series. Juno Tempke, Colin Hanks, Burns and Giovanni are great.","rating":"10\/10","date":"22 June 2022"}
{"title":"One performance that makes it truly great.","review":"This is a great series. So much better than I imagined it could be. Such a simple premise but the cast is outstanding. Burn Gorman putting in a great turn. Juno Temple adding to her CV of brilliant roles and then there is a performance that rises to the level of genius with Matthew Goode stepping away from Downtown Abbey blandness and fulfilling the promise he has always had. His performance is WONDERFUL and just gets better as each episode goes by.Brilliant series.For those in the U. K. it's also worth noting that Dexter Fletcher, remember him from 'press gang' he directs with flair and precision and he must have been busy because he's also the U. K. voice of every McDonalds ad. As well as saving Bohemian Rhapsody when it was in trouble.","rating":"9\/10","date":"15 August 2022"}
{"title":"An offer you could refuse.","review":"This show feels off, mainly because of manufacturered conflict some of the characters have. It doesn't seem as real as it happened and I think that's because of the writing in the show, since there needs to be conflict for the story to play out. Some of the conflict, that's not about the making of the movie, is the weakest.It's tons of conflict with getting the movie made but it doesn't translate as a compiling television series. Some of the actors are incredible but it lacks profound writing that heightens the tension within each moment.Lastly, the acting is great at some points and others it isn't. Every scene with Matthew Goode is pure devotion to the character; the Al Pacino character is really good, really gives a perspective to why Evans wouldn't want him. Miles Teller doesn't sale it enough as Albert Luddy, doesn't seem like he's putting in effort. The actor that plays the head of Gulf & Western is committed, he exudes zaniness with his body in every scene.","rating":"6\/10","date":"28 August 2022"}
{"title":"Not very compelling","review":"When your sympathies are with Joe Columbo instead of Albert Ruddy what does that say about the piece. You never get the feeling Ruddy isn't any real danger. He walks through problems so easily there's no sense of tension. I believe the real life obstacles were more compelling. Perhaps for fear of litigation they've been toned down or omitted entirely. For whatever reason the result is a total yawn fest. So sorry. I had high hopes and where was John Cazale? Every minor character or actor was included but not Fredo? For shame.","rating":"1\/10","date":"15 May 2022"}
{"title":"Reference galore for Godfather and period fans","review":"What a great idea by Paramount! Why not make a show about one (if not the biggest) studio success of all time! As a bonus, let's get the main man behind that success (the producer AL Ruddy) to drive it!As a 36-year-old white male, I have to be honest, and say I am a big fan of The Godfather 1 and 2, as is mostly any man I know around my age.When I saw the show announced I was very sceptical, but then saw the producer and casting and though - have to watch this at some point, and perhaps most of you did the same.The cast really makes this one come to life. Outstanding performances in pretty much all areas! No small parts here. Special shout to Giovanni Ribisi (Joe Colombo), Mattheew Goode (Bob Evans) and Dan Fogler (Coppola).Believe me when I say, if you love the Godfather and want to see how this made, but in a TV frame with lots of insight jokes and references - this will be a blast for you, as it was for me.Why not give it a 9 or a 10 then, why just 8? Well, although this is a great ride, it just has too many very, very interesting secondary and third-rate characters that really didn't get too much screen time and stuff to do, but in fairness, the script must have been pretty hard to do with juggling all of these incredible personas on screen.Another problem was the main character and his dialogue. Perhaps the real Al Ruddy wanted to come out as an absolute beast of a producer and the guy that was never wrong or feared nothing, but in the show, the lack of emotional and dialogue range that Ruddy was given was very unlike real life. Even when under very harsh circumstances the guy just remained way too cool for real life.Another thing is the name of the show - The Offer. Not really making you think this is related to the Godfather at all. I believe a lot more people would have seen this (Godfather fans, casuals and even some completely oblivious) if it was named something like \"How the greatest Paramout movie was made\" or \"Producing the Godfather\/Greatest movie of all time\". Believe this one really needed a more catchy\/clickbait title to get to a wider audience and get more appreciation.Believe me, it deserves it!To anyone reading this, just see it - it's exciting, dramatic, funny and charming!","rating":"8\/10","date":"30 October 2022"}
{"title":"The only thing i didnt like was the poster","review":"What an amazing find! I was extremely suspicious and only watched it because I couldn't find anything else interesting to watch. What a mistake I would have made if I had passed. Amazing cast - Matthew Goode is an absolute gem, Miles Teller an exemplary performance, I'm impressed with Juno Temple, she was a real delight. Dan Fogler, sir, amazing and believable acting. Giovanni Ribisi we missed you a lot. A delightful story beautifully recreated for even the most critical eye. And even though we all know how this saga ends in real life, it somehow managed to keep me in suspense until the very end. I highly recommend this show. And after that, watching The Godfather is a must! Enjoy!","rating":"9\/10","date":"2 January 2023"}
{"title":"brilliant!!!!!","review":"This limited tv series is absolutely brilliant! The acting is superb, the sets are breathtaking and the story is captivating! Do yourself a favour and watch this tv show and the Godfather movies again. Cinema and tv series at their best. Enjoy!","rating":"10\/10","date":"4 July 2022"}
{"title":"Engrossing, Excellent, Exquisite","review":"Teller & Goode are beyond fabulous, as are all the other actors in this series. Hooked right away. What a delight! So good. Oscars\/Emmys for all. Ribisi, Temple, Hanks, Gorman. I'm blown away!!","rating":"10\/10","date":"3 July 2022"}
{"title":"Excellent","review":"A great back story for a great movie. Wonderful performances, tremendous\ndrama, and addictive characters. I loved it! A very interesting back story that led to a great movie. Long live The Godfather!","rating":"10\/10","date":"16 August 2022"}
{"title":"Matthew Goode is phenomenal as Robert Evans","review":"As for any other GODFATHER fan, Mr. Ruddy's experience producing the film is a joyride to watch. The recreation of the Era is as good as Tarantino's in Once Upon a Time in Hollywood. Matthew Goode nails it as Bob Evans, Juno Temple's character is endearing, Giovanni Ribisi's evolution as a Capo is his best role so far, Nora Arnezeder is super hot as Fran√ßoise, and overall the original team players are very well cast. Sure, Miles Teller plays himself but it works: you are too busy enjoying everybody else's take, to actually mind. The soundtrack is good, even though you keep on waiting for a closer reference to Nino Rota's Masterpiece.The only flaw I believe grows old after 4 Episodes (which in real life might just have happened like that, over and over), is the dynamics of:\n\"someone has an idea\/pitches the idea to a Superior\/Superior is amazed with the idea\/next scene another Superior gets super pissed off of the idea\", times infinity.Compliments to all the team, for sure I will proceed watching Chapters 5 to 10.","rating":"9\/10","date":"24 February 2023"}
{"title":"Hellava good time","review":"Great story of the making of a great movie. Great performances by actors imitating actors we know w\/o it being parody. Matthew Goode is phenomenal as Bob Evans and Anthony Ippolito as Al Pacino to name 2...oh and Giovanni Ribisi is about as good an actor as there is right now. Really enjoying iit!","rating":"9\/10","date":"25 May 2022"}
{"title":"Not for the ADT..","review":"There is a segment of the population that if it isn't action or super heroes then the attention span is about 5 minutes.. basically cannot sit still long enough when a movie or show is 99% dialogue. Too bad.. this is GOLD!!!!","rating":"10\/10","date":"26 May 2022"}
{"title":"What's the fuss about","review":"OK, we know there has never been so much money sloshing around Hollywood. Anything that can ride on the coat tails of an old hit is almost certain to get made. This TV Show has so much money thrown at it, its not a surprise the streamers are pulling their horns in. My point is when we get the intro of the Al Pacinos character it's a joke. The scene, the voice are so corny I thought I'd dropped back into 1972. You'd like to enjoy this but it's the casting that hits you so hard in the face. Those people who have an interest in the making of the show get to be the good guys (Rudy is nearly a god... don't mention it Dad) anyone else well we can fiddle about with their story anyway you want.8m fed up with the show after episode 2.I think you will be too.","rating":"6\/10","date":"9 May 2022"}
{"title":"Perfect show","review":"If you have the same IQ as the couch you're sitting on.---------------------------------------------------------------------------Sad they could only afford 100 reviews with a rating of 10.","rating":"2\/10","date":"17 June 2022"}
{"title":"Pulls you in right away.","review":"The story of how the Godfather almost never got made is insane. I can see why this story was told over10 episodes, a movie just wouldn't have been enough. There will be multiple nominations and awards for this series. The cast is perfect and the leading actors all gave flawless performances. Teller and Giovanni Ribisi both deserve best actor recognition. The Offer is undeniably the best bioseries put out.","rating":"10\/10","date":"12 June 2022"}
{"title":"Brilliant","review":"Matthew Goode is brilliant as Robert Evans award winning performance. 10 for that .Miles Teller another great performance , Collin Hanks brilliant and understated excellent .Dan Folger was also a great performance .Ribisi knocked it out of the park .Burn Gorman excellentAnthony Ipollito as Pacino excellentI can't find a bad performance in this .The script awesome\nThe story very interestingThis is a masterpiece .","rating":"10\/10","date":"9 June 2022"}
{"title":"Enjoyable I love the robert Evans spot on","review":"Robert Evans was spot on, award worthy. Otherwise suprisingly a lot was true to real life. Seen better 11 hour movies but watched all the way through, so just dont make it a trilogy and i wont have to find and kill the people behind that. Thumbs down me you dick I dare you.","rating":"8\/10","date":"14 June 2022"}
{"title":"GODFATHER FANS WILL LOVE IT","review":"The echelon of the most arrogant critics examined some of the mechanics of the series:*Does it wonder off on subplot tangents? Sometimes.*Are some of the \"famous\" characters one-note? Sure.*Do some of the portrayals border on parody and mimicry? OK.WHO CARES?!For the legions of people who love and cherish The Godfather, this series is thoroughly entertaining! To watch a movie about the making of OUR favorite movie is gratifying time spent. It's fun to see the recreations of actual scenes in what may be the real locations where they were shot. Fogler's Coppola and Gallo's Puzzo are delightful. Matthew Goode's Bob Evans is hilarious and as over the top as the actual Bob Evans. Miles Teller's performance is A-list solid, as is Juno Temple's.NO ONE is comparing this series to Coppola's masterpiece, and to suggest time would be better spent watching the actual movie is absurd and insulting. WE'VE ALL SEEN IT A MILLION TIMES and we will likely see it a million more. The Offer is pure entertainment and it is fun to indulge in the subject matter of our favorite film of all time.","rating":"9\/10","date":"20 May 2022"}
{"title":"What a delight","review":"What a delight to watch, what a story to appreciate. I don't want to repeat the others who already admire this series, and they are thousands indeed. One of the good things in this show is that it is not only about The Godfather, but also about many more masterpieces of that era - Live Story, Chinatown, Paper Moon.Also I like that it is a mafia movie about a mafia movie - the story itself is rich enough, with a lot of interesting and charming characters.For me Ribisi shines above all of them. Matthew Goode is very good too, Burn Gorman (Charlie Bludhorn) is fantastic as well. Juno Temple is forced in too many shows in recent years, but I have to admit that she is perfect here.","rating":"10\/10","date":"16 December 2022"}
{"title":"Extremely addicting and entertaining","review":"I do not know how accurate this series is, but regardless it was incredibly entertaining and held my interest every episode till the end.Furthermore, it isn't necessary at all to have seen any of the Godfather movies to appreciate the series. The series is really about the costs and benefits of pursuing ones dreams.Well written and acted. I highly recommend this series.","rating":"9\/10","date":"14 June 2022"}
{"title":"This is how a TV series is done! Perfect in every way.","review":"If you want an enjoyable entertaining look at how a classic movie was brought to the big screen from start to finish, you got it. The acting was outstanding, or should I say lack of acting because you don't notice anyone is even acting, and that is how it should be. Pacing was perfect, and the length was perfect. How many times do you see a TV series try to stretch it out over 2 seasons when it's really a solid one season show, too many times.As for the reality, was it all 100% as it was in real life? 90%? Don't tell me, I really don't even want to know, it was enjoyable no matter what.One thing I did not do, and don't want to do, is watch the behind the scenes after each episode. I did not watch them, and I'm not going to, at least not now, maybe down the road. To me that just ruins it, I love movies and TV for escape, when I watch I want to really feel like it's some alternate reality and I'm watching the real deal. I never like seeing actors out of character as I'm watching a movie or series. That's just me, some might like that part.This is a fabulous story perfectly written, directed and acted, it's a 10.","rating":"10\/10","date":"10 June 2022"}
{"title":"Yes yes yes","review":"Completely in love with it just after the first 20minutes. A total must watch. Excellent writing and Miles Teller seems like the next Jason Bateman. I don't know what else to say.","rating":"10\/10","date":"9 May 2022"}
{"title":"Solid (Somewhat Bloviated) Series","review":"Pretty good series with a few timeline issues but good nonetheless.Teller and Goode are decent in their roles but the real powerhouses here are Giovanni Ribisi as Joe Columbo, Burn Gorman as. Bludhorn, and finally Dan Fogler as Coppola and his work with Patrick Gallo as Mario Puzo. The chemistry between these two and how they continue to play off each other is truly a masterclass in how to be a part of an ensemble, and reading timing to a T.There's quite a bit to Betty's character that just becomes tedious and difficult to swallow, especially for those of us who were cognitive in that era. You can lead a horse to water but you can't force him to drink the social justice juice. I've no doubt she was somewhat feministic in her drive\/ambition, however, she needn't be drawn (or played) as such a caricature.Ribisi seems to be a leading character actor for this time and does an excellent job of portraying Joe's hubris, which led to his untimely downfall. Burn also is rather skilled at nuances and subtleties and aside from a rather solid Austrian accent, the mannerisms and quirks to his character makes Gorman vanish from the screen.There were a few episodes I felt ready to fast-forward through (the McGraw timeline and complete story arc were yawn-inducing) as well as the Francoise coupling with Ruddy. You don't need to get mired in the relationships to tell the story of characters; a simple cursory look is enough. Especially considering how off the timelines were- McGraw was married to Steve McQueen, THEN to Evans whom she had a child with- and it no longer feels organic in nature. Just the juxtaposition of being with a McQueen THEN moving to someone like Evans is a real conundrum, considering how much of a 'man's man' McQueen was. THAT story would have possibly been an interesting caveat to add.All in all, not a bad telling- interesting tidbits, but I have to wonder how anyone unfamiliar with The Godfather trilogy (number 3 is a cringefest-seriously) would ever be able to latch on to this tale. I'd known a good bit of the trivia behind TG, but seeing it in an arc such as this was much more enjoyable.","rating":"6\/10","date":"26 July 2022"}
{"title":"Good idea for a show, bad execution","review":"How did someone not help Giovanni Ribisi with that awful accent?!!Teller is okay, but overall casting for this seemed lazy. Pacino, Brando, Caan, and Coppola actors were all pretty good, but not great. Again, Ribisi as Colombo is absolutely painful. The story definitely seems more like Al Ruddys fantasy than what actually happened. Oh really, the movie only happened because you put Sinatra in his place and the NY mob thought you were so cool? Yeah right!Makes sense they needed Robert Evans to die before it was made, because they make him look like a complete idiot who didn't Al Pacino or Marlon Brando in the film and he definitely would've said this wasn't how it happened at all.I was able to make it all the way through because I'm a big Godfather fan, but overall Paramount airballed.","rating":"2\/10","date":"30 August 2022"}
{"title":"A Feast for the Eyes & Brain!!!","review":"Could ANYTHING be better than the movie \"The Godfather\"?Perhaps not. But Paramount + \"The Offer\" is close!THE WORLD: \"The Offer\" transports us back to the 1970s - the clothes, the cars, the movie stars, the music - and the making of one of the most famous movies in all time, Paramount's \"The Godfather\".THE CHARACTERS: \"The Offer\" is filled with a myriad of WONDERFUL CHARACTERS - Famous movies stars, Directors, Producers, Writers & Singers and many (many) others.THE PLOT: A struggling Paramount Studios needs another hit movie after a long list of dismal failures. But the Mafia (and certain pissed off Mafia associated famous singers) will do EVERYTHING possible to keep the movie from being made.The Mafia scenes are some of my favorites. But I also enjoyed the scenes with Director Franscis Ford Coppola and writer Mario Puzio bringing the movie to life on the written page and on the screen.IN SHORT: This series has EVERYTHING and is a feast for the eyes and brain!The series ALONE makes my Paramount+ subscription worth it!","rating":"10\/10","date":"21 October 2022"}
{"title":"Absolutely riveting","review":"Top shelf ensemble cast. I know they took a bit of artistic license with the storyline, but it didn't matter. The character development was out of this world. Even the handful of distasteful characters have you rooting for them in the end.It's funny in retrospect that the studio was in such a precarious position when making the movie. It's easy to acknowledge today that the franchise is one of the best of all time. And yet back in the day, this was a huge risk.They do a great job of getting you vested in the venture, even though we know how it turned out. It's a bunch of narcissists, egotists, drunks, power mongers, gangsters and misfits that combine forces to create something magical.A+","rating":"10\/10","date":"26 August 2022"}
{"title":"Isn't the music as important as the movie?","review":"One would wish that such series never ends, got so hooked and loved every detail. Now, one big factor of The Godfather trilogy's success is the music and I was waiting for a whole episode about that, and they broke my heart.","rating":"9\/10","date":"25 July 2022"}
{"title":"AMAZING!","review":"I can't really know what's true in that serie, I guess I should read the book that they used for the series. But what I know is that this is one of the best story I've ever seen. It's fascinating. Each episode is crazy. I honestly don't care if actors look like the originals, or they don't. I thought it would bother me...but you are captivated by every scene, a d they become the real ones, episode after episode.I'm discovering actors I've never seen, and it's making it like we are back to the seventies. They're all fantastic.And Miles. Miles is turning into one of the best actor of his generation for sure.","rating":"10\/10","date":"14 January 2023"}
{"title":"Top-notch entertainment!","review":"I remember when the Godfather first hit the screens and it became a sensation. At the time, Marlon Brando blew everyone away, along with Al Pacino. But the road to making this film is laid bare by the actual person who produced it, Albert S. Ruddy. Miles Teller takes on this role and plays it to the utmost. Then you've got Patrick Gallo, who plays, Mario Puzo. Utterly convincing. Incredible acting. But for me, the star of \"the author\" was Juno Temple, an English, actress who plays Bettye McCartt so convincingly and so professionally it made my mouth drop.The whole story about the making of the Godfather is laid out, so incredibly that it's actually hard to believe is really happened... But it did. A must watch for Godfather fans.","rating":"10\/10","date":"12 March 2023"}
{"title":"Holy Cannoli!!!","review":"Casting is amazing! I haven't finished just yet, but hands down best mini series out there. This is well done with character arcs. The twist and turns and how they weave the story in with real events is impeccably done.","rating":"10\/10","date":"3 June 2022"}
{"title":"Almost As Good As The Movie","review":"What a fantastic series, not just for those who loved the Godfather but for anyone who loves movie and interested in the process of filmmaking A MUST see!","rating":"9\/10","date":"26 May 2022"}
{"title":"Excellent","review":"How they made the Godfather, I'm in.I love that we *know the movie gets made but you're sitting on the edge of your seat the entire episode length wondering if this is the shoe that's going to drop and kill production. It's so awesome to understand more what went into making this absolutely iconic film trilogy.This hands down deserved to win SO MANY AWARDS and somehow it got little reverence.","rating":"10\/10","date":"4 June 2022"}
{"title":"A Blend of Fact and Fiction","review":"I'm a fan of this series. I like it. I like the cast, the actors. I am enjoying them. It's a little bit schmaltzy in places, but I still like it. I very much like the actual films, The Godfather, 1 and 2.I'm reading Puzo's account of the backstory on The Godfather and Mark Seal's account of the backstory. Those two sources seem to match, so far. I'm about 50% through with them. However, there's a mismatch between what these sources say and what The Offer shows us. For example, Puzo and Coppola did collaborate on the screenplay and script; however, they did so at separate locations. Also, a lot of the details about Robert Evans are not accurate in The Offer. I really don't know how many inaccuracies there are, but there are plenty. I encourage you to read those two books.So, you can't rely on The Offer to give you 100% factual information about the making of The Godfather. However, even though the The Offer is a blend of fact and fiction and somewhat shallow and lightweight in places, it's still enjoyable.I very much like Miles Teller as Ruddy. I especially like his hair! In my opinion he is fantastic in this role. I also like Matthew Goode as Robert Evans. However, Evans was not wearing glasses all the time during this time period. But the voice is very much like the voice of the real Evans. Dan Fogler as Coppola is quite good, very good casting. All of the main cast do resemble the actual persons they represent. Burn Gorman as Bluhdorn is excellent. Colin Hanks as Lapidus is so good you'd like to find him and smack him a couple of times for being such a jerk. Giovanni Ribsi as Joe Colombo is excellent, and a familiar face. Juno Temple as Bettye, secretary and assistant to Evans is cute as can be and one of the best things about this series. Patrick Gallo as Puzo is quite good and looks a lot like Puzo. The Sinatra character, played by Frank John Hughes could be stronger. Meredith Garretson as Ali MacGraw is convincing. Anthony Ippolito as Al Pacino is absolutely wonderful in his role. Justin Chambers as Brando does a very good job. I think playing Brando would be difficult.There are a few weak spots in this series. The weakest thing about it is when it departs from actual facts and replaces them with fiction. The actual facts would have been more than adequate. The other weak spot is the whole affair seems a little bit lightweight, lacking the gravitas of the actual Godfather film, or even a series like Mad Men or the current series out now called Gaslit, with Sean Penn and Julia Roberts.","rating":"7\/10","date":"28 May 2022"}
{"title":"Not as good as it could be.","review":"Ok, the idea and premise of this series sounded amazing and we all want more Godfather connects. I did not have any expectations, actually low expectations, there were no known actors (at least that I've ever heard of except Giovanni Ribisi being Giovanni Ribisi with 80 extra lbs). The story is ok, nothing exciting but not bad. Very nicely shot, probably too nice for this fluff.I could overlook all the holes in the writing and poor costume choices... it just all comes off as contrived and self indulgent.Don't get me wrong, there is some really good stuff here, but it's really bogged down by bad acting. When you're playing a real-life person, especially ones who are so embedded into pop culture, you need to find actors who can actually bring at least a semblence to the real person but these unknowns should...well, stay unknown. I felt myself embarassed watching the horrific takes on Brando and Pacino. Alas they all fall creepily short and look like muppets trying to be people. It just doesn't work. The press is dazzling, the offering falls short and flat.","rating":"4\/10","date":"12 May 2022"}
{"title":"My Favorite Series This Year","review":"This is a must see for so mamy reasons The story is fabulous! The Actors all deserve awards as they are phenomenal! Just an incredible cast. Having lived the 60's and 70's it was a terrific walk down memory lane! I felt it was so authentic to the 1970's. So wonderful to have characters of substance. You know it is great when real events have already happened, yet you are rooting for the characters and outcome. As this series plays out it makes you truly worry, wonder and hope. Will they actually get to make \"The Godfather\"? Pure enjoyment to watch, if a nature rarely seen these days! Thanks to the entire cast, crew, set designers and Paramount for putting out great entertainment!","rating":"10\/10","date":"15 September 2022"}
{"title":"A Rare Gem in a Sea of Mediocrity","review":"So much junk television to choose from these days. Every network, be it big or small, new or old is vying for your time. There is a lot of content being made, the problem is two fold: not enough hours in the day, and how to choose what to watch. But ultimately you are going to find something to entertain you.The Offer really is a rare gem. It stands out amongst the crowd of shows and rewards you for your sacrifice of time spent. TV like this is becoming harder to find, especially in our world of go go go. I'm glad I found this show. And whether you're a fan of Mario Puzo's book or the original movies, (you don't need to be) or just looking for something good to watch, I think you will find this right up your alley. Television at its finest.","rating":"10\/10","date":"17 June 2022"}
{"title":"Watch it!","review":"My husband and I really enjoyed this series and couldn't wait for the next episode to come out. The critics don't seem to get that the audience CAN figure out that it's not a documentary, that it's sly and facetious and meant to entertain. Which it did! Don't be a Barry Lapidus and underestimate the audience! It's not business, it's personal!!The entire cast was terrific. We enjoyed them all, but special kudos to Dan Fogler, Matthew Goode, Anthony Ippolito and Justin Chambers for their spot-on portrayals of Frances Ford Coppola, Bob Evans, Al Pacino and Marlon Brando. They were amazing.Just to add, I especially enjoyed the dreaded V-shaped formation of The Offer's poster art, in light of Episode 9.","rating":"10\/10","date":"10 June 2022"}
{"title":"Pretty good.","review":"Pretty good, but I question the accuracy of the dialogue and writing.Certain things just don't seem right for a period picture -- like when the owner of Paramount says \"and expensive as F$##\" -- people didn't really talk like that back then (they would've said \"expensive as sh##\"). Just surprised they read that and nobody caught it, because I definitely would've said something about that line.And the characters really don't look like their real life counterparts, but that's understandable.","rating":"9\/10","date":"2 June 2022"}
{"title":"Well done","review":"As someone who works behind the scenes on movies I appreciate the authenticity of this series. I love the Godfather and I've learned so much I didn't know about what it took to make it.","rating":"9\/10","date":"23 July 2022"}
{"title":"11 Stars! My Favorite Series Ever Amazing","review":"I can't even begin to tell you all how incredible this show is. Full disclosure I am a huge fan of the Godfather movies and Bob Evans. I've read his autobiographyThe Kid Stays in the Picture multiple times and to see him come to life in this series is just amazing. The actors Are All Incredible! Giovanni Ribisi deserves an Oscar(ok it would be an emmy...)\nJust Watch It!This will be one to rewatch for me. Its got everything I love: 1970s, Hollywood, Movie Stars, Gangsters, crazy parties, NY Italians, Artists, NYC, LA AND Sicily... c'mon.A Masterpiece!","rating":"10\/10","date":"22 July 2022"}
{"title":"Marvelous","review":"A beautiful approach about cinema. Unmissable for us who loves cinema. Made with a extraordinary eye. Amazing photography. The performances are impeccables!","rating":"10\/10","date":"4 August 2022"}
{"title":"A phenomenally, intelligently well made miniseries","review":"As a huge fan of The Godfather film it was only a matter of time for me to sit down and watch this series but damn it am I glad I did. The Offer tells the story behind the making of The Godfather. While I'm sure they took many dramatic licensing to make the show more appealing it in no way overshadowed the crazy true story of how much they faced to get this film made.This miniseries has it all great writing, great cinematography, great score it is incredibly reminiscent to The Godfathers score and it just fits the tone of the show so well. Great acting everyone they casted was so authentic to not only The Godfathers characters but to the actors who played those characters. The weakest thing here I'd say is the CGI but so very little is used in the show that it has very little to no impact on the viewing experience. Some nitpicks I would've liked to have seen Nino Rota in the show how brought the films score together. Some more scenes of how they shot the film would be nice to see as well but these are nitpicks and I'm sure there are plenty of documentaries behind the making of The Godfather I can watch that cover these aspects.This show has given me a new found respect for producers and the film making process as my father said multiple times as we were watching this series \"it's a wonder this film was made at all.\" With all the opposition they faced to get this film made just gives me much more of a appreciation for the art, authenticity, and love that went into The Godfather. We truly will never see a film like The Godfather or of it's caliber again.To see how well done this series was it begs the question why couldn't have Paramount do just as good as a job for Halo. Shout out to my brother in law for paying for Paramount+ and his sister for letting me use her login info. I am very glad to have seen this series. Now if you'll excuse me this show has made me an offer I can't refuse... To watch The Godfather again.IMDb: 10\/10\nLetterboxd: 5\/5Watched on Paramount+","rating":"10\/10","date":"26 June 2022"}
{"title":"Great series, but the last three episodes were a let-down.","review":"This series should have been called The Bob Evans Show, not only because Matthew Goode steals the show playing him, but because he is the main centre of attention.The first seven episodes were a blast and everyone in the cast do a superb job. We are introduced to the executives, the production team, the Colombo crime family and the cast of the Godfather-movie. There is a wonderful scene where everyone in the main cast have dinner together and try to play out their part.Then something happens around 2\/3 into the series and many of the characters we were introduced to suddenly just disappears. There is hardly any scenes where you see 'Coppola' directing for example, but there are a LOT of board rooms and offices where Paramount-people are having heated discussions. It becomes repetitive and boring. They did not even bother to include any from the cast of 'The Godfather' during the red-carpet premiere. It is all about the executives and producers.They really nailed it with the casting of Anthony Ippolito playing Al Pacino and Justin Chambers playing Brando. Sadly both only had parts a little bigger than cameos.","rating":"7\/10","date":"17 June 2022"}
{"title":"An actual representation of the movie making process","review":"Series takes us into the creation process of the legendary movie \"The Godfather\" from the beginning where the director writer work on the script from the source book,\nand goes all the way till the end when the movie gets released and covers the events happening in the backdrop of how the producer Al ruddy handled the mob and the budget issues.Casting is good, Miles teller is good as a lead, i like him from Spectacular now a lot, but the show stealer is Paramount CEO Evans. His acting and the character arc is beautiful. Rest cast was also good.Production was good, only issue was that in between, sometimes it was bit boring, it could have been a 8 episode series with better intensity. But it is a must watch for every cinephile.","rating":"8\/10","date":"4 July 2022"}
{"title":"Just great","review":"Every episode is just great. One of the best dramas I have seen in a long time.This drama should win awards galore.Great performance's across the board.","rating":"9\/10","date":"3 August 2022"}
{"title":"Excellent binge worthy tv series regardless if you like the film it relates to","review":"First off, My rating of 10 is not based on some magic formula based on whatever critics think makes something great. A 10 from me means its a rewatch, and i am on my second viewing even though i only finished it last week thats how good this show is.Secondly this is a review from someone who does not adore the actual films and thus may be slanted to give this a ten well just because Godfather. I have watched the original movies, i enjoyed them and how they were crafted, but are they my top films, nope far from it.However, once in a while a show or film crosses your path where literally everything is pure perfection. This show is most definitely one of themEvery single actor chosen to play their character does so in a way that you believe they are that person, i see people criticise Colin Hanks, yet when you think about what his character is meant to be, you realise how well he played the part. I thought Matthew Goode was ott not knowing much about Robert Evans, but after looking him up on youtube you realise how spot on he actually was. This repeats throughout every character.The story itself is great sure theres probably a lot of exaggeration but it's never to far fetched and infact a few times i was thinking that would never have happened to see the actual event listed in the films trivia section, so it offers a fascinating insight in to the whole back story of making the film.Overall it is a perfect blend of great characters, great story lines, great production values. It's unique and a breath of fresh air and not a single bad moment throughout the 10 episodes.The only other show that i rave about is The Shield, that was very similar in that all the actors choosen to play their roles were born to play those roles, and the storylines were great, the type of show that when you get too the end you wish it was not over, and this is right up there as an all time great television show, one that you will binge but wish you had not as you really do not want it to end..","rating":"10\/10","date":"28 June 2022"}
{"title":"Greatest show!","review":"I am in awe of this show. I can't keep my eyes off off it. The actor that plays Al Pacino is AMAZING!! It's so fun to watch a show with such history. I've never been so interested in how a movie is made. There are so many great performances. This show proves how great Mafia movies are.","rating":"10\/10","date":"3 July 2022"}
{"title":"Phenomenal!","review":"I used to review & then stopped because I found it pointless & tedious. I even deleted all my other reviews, whether good or bad. However, when I'm so pleasantly surprised like I was on this series, I can't help it.This series deserves awards. Not a weak link in this production. Brilliant. Matthew Goode, as some have mentioned, steals the show. Extraordinary!One of the better series I'd seen in a while & I hope it gets some wins.","rating":"8\/10","date":"22 June 2022"}
{"title":"Brilliant show","review":"This show is brilliant. I watched \"The Offer\" because I used to work for Paramount in London, and I remember Charles Bludhorn. I nearly did not watch it because it received a 50% score on Rotten Tomatoes. Sandra Bullock's latest film was badly written crap and it got 79%. I gave up on Bullock's film after twenty minutes. The critics serve no purpose these days. Most of them are clueless and tasteless. The IMDB score is a more useful guide to quality. This show was brilliantly written and well-acted. It was funny and full of zany characters. However, I don't remember Paramount being like that in the 1970s.","rating":"9\/10","date":"24 June 2022"}
{"title":"Fun dramatization for Godfather fans","review":"Okay, this is not a documentary. Those people who hate it because it only shows one possibly exaggerated viewpoint are missing the point. The Godfather is an unforgettable film that can never be remade. Those of us who keep watching it over again just want more. And this series gives us an enjoyable trip behind the scenes. Some of the actors are great, a few not so much. But overall, I love it. This is sort of like watching The Crown. It's not history so much as just a dramatic interpretation of real events.","rating":"8\/10","date":"28 May 2022"}
{"title":"Significant and Special Series","review":"First the story telling and the sequence of events are amazing, its great how the show didn't lose my intrest in any point of the events. How they have spotlighted the show at the production and the other things that we don't see, is so admirable and distinctive. I got goosebumps from a lot of admiration in some scenes. Also I loved Miles Teller as Albert Ruddy such a priceless actor. Overall I enjoyed seeing the series so much.","rating":"8\/10","date":"28 June 2022"}
{"title":"Could have been so much better","review":"What a great idea. A great premise for a TV series. What could go wrong? Well - the casting, the direction and the acting. It's impossible to know who was responsible but many of the actors, notably Matthew Goode (as Evans), Born Gorman (as Bluhdorn) and Giovanni Ribisi (as Colombo) were so intent on aping their characters that they played them like caricatures. Their performances were risible. On the other hand Dan Fogler (Coppola), Juno Temple (Bettye), Patrick Gallo (Puzo) and Justin Chambers (Brando) managed to deliver nuanced performances and be completely believable as their characters.Which brings me to the lead - Miles Teller as Albert Ruddy. Where on earth did they find this guy? I've seen tables with more charisma; chairs with better acting ability. He was truly awful and wooden and the casting director should be shot.It was a great story and could have been executed so much better.","rating":"6\/10","date":"7 June 2023"}
{"title":"Amazed no mention not a word about 'Carlo'...","review":"Aka Gianni Russo. He made some incredible claims of his deep involvement with making these two films possible through his lifetime friendship with Frank Columbo.You tube.How Gianni Russo Got In The Godfather Movie: Gianni Russo Interview 12th September 2020.","rating":"3\/10","date":"4 May 2022"}
{"title":"Good but Episode10","review":"This show was super fun.But why they didn't stop and end with episode 9 I don't understand- the \"finale\" is so fluffy and self indulgent that it left me with a \"when will this end attitude\".But the first 9 episodes are well done and keep you watching. Love how much they honor the art of making movies while showing all the crazy show biz wheelin' and dealin'I recommend. Just stop after 9. But you won't I know it :)","rating":"8\/10","date":"3 August 2022"}
{"title":"Dan Fogler as Frances","review":"Dan Fogler's unbelievable performance as Francis made the show for me. Now they need to make a show about the making of Apocalypse Now with Dan returning to this role.I don't know what the critics are smoking but this is one of the best shows I've seen in years. The writing and acting is just amazing. I love classic Hollywood movies and this is one of the best modern portrayals of classic Hollywood. This was the turning of the tide when the old studio system started falling apart and the artists like Brian DePalma, George Lucas, Steven Spielberg, and Marty Scorsese changed the game. That's probably why the critics don't like this show. Because we are about to see another turning of the tide... big business and their support of superficial sociopolitical movements are destroying the film industry, it's time for the artists to take the power back.","rating":"9\/10","date":"26 October 2023"}
{"title":"Brilliant drama series on a brilliant film","review":"Al Ruddy is working as a programmer at the Rand Corporation but sees an opportunity to produce TV shows and movies. Mario Puzo is a struggling author whose wife gives him an idea to write a book on the Mafia. Joe Colombo is a rising crime boss. Their three worlds are about to collide, resulting in the making of one of the greatest films of all time - The Godfather.I watched this because it tells of the making of one of the greatest films of all time, The Godfather, and I am a keen follower of cinema and the film-making process. However, I was half-expecting a dry documentary-like telling of the making of The Godfather so didn't set my expectations very high.How wrong I was. The plot, whose writing involves input from Al Ruddy himself, is very interesting and engaging. You get a great feel for what goes into making of a movie: the creative process, the production aspect and issues, the production company hampering the creative process and the constant threat of the project been cancelled. We also get to see how this affects peoples lives.Most tellingly though, you get to experience how a masterpiece of cinema was made.On the negative side some aspects seem overly melodramatic: some problems seem exaggerated for dramatic purposes. Some timelines are also a bit contrived.These are minor issues as the series is incredibly enthralling and entertaining. In a positive spin-off, I'm now going to rewatch The Godfather and The Godfather II.","rating":"9\/10","date":"23 April 2024"}
{"title":"Surprising Gem","review":"I tuned into this series without much expectation. After all I viewed it during the writers and actors strike, so there was not much of interest to watch. What a pleasant surprise. The acting, the writing, the sets were top notch. Not knowing the story behind the difficulties of making \"The Godfather\" was a revelation. Matthew Goode and Miles Teller were spectacular. All the actors were so good. I didn't recognize Giovani Ribisi, that's how wonderful and believably he became a Mafia boss.Al Ruddy, the producer of the \"The Godfather\", had to overcome so many obstacles to get that film made. I don't remember the controversy at the time when the film was being made. It is an interesting piece of cinematic history. Do yourself a favor. Try the first episode. You will be hooked.","rating":"9\/10","date":"13 January 2024"}
{"title":"Flawed but very entertaining.","review":"This series was recommended to my wife and me by a \"The Godfather\" lover. We on the other hand did not know all the details about the film or any of the \"inside\" challenges about its making. We were looking for entertainment and so were not offended by any of the inaccuracies or exaggerations pointed out by some of the professional critics who loathed it. Granted, the Mafia characters were almost absurdly portrayed, the Pacino depiction was bizarre and the Al Ruddy character surprisingly uninteresting. Nevertheless, the story was really entertaining. Of course we knew a tremendously successful film would emerge at the end, but the many challenges and obstacles to its success kept us glued. The romantic side stories were a drag, but we thought Matthew Good and Juno Temple were wonderful. I will recommend it to friends and family.","rating":"8\/10","date":"10 February 2024"}
{"title":"Its an Offer I cant refuse","review":"I loved this series! Like many people Ive seen The Godfather innumerable times, and Ive heard many stories about its production. Although I haven't heard much about how accurate Al Ruddy's version of events making the movie is, it is very entertaining and seemingly enlightening. It was interesting to me how they didn't show scenes from the movie. They showed the setup for scenes, and discussions with the actors about scenes, and you would see the film makers reaction to watching the scenes, but not the scenes themselves. Which is great. We all know the movie and what they're filming, just hearing it is sufficient to imagine what we've seen many times. Whether its the Don being shot in the street, or Michael in the restaurant changing the course of His life, or Sonny beating up His brother-in-law, we know the film, we don't have to actually see it. If they had tried to show the actual scenes it wouldn't have meshed with the real thing, that we know so well. Also fascinating is how much the Mafia was involved in the whole production, how without their approval it wouldn't have been possible to complete the film. Really well done!","rating":"9\/10","date":"14 June 2023"}
{"title":"Critics are wrong","review":"It is hard to understand why many professional critics have lambasted this entertaining series. Perhaps they take themselves too seriously.This is a fascinating trip through one of the Golden ages of movie making, with fascinating Easter eggs and references dropping throughout.The passion and risks of being a producer are well shown and we realise the difference between a hit and a flop is a close call.I would definitely recommend seeing the movie first or again if you have not seen it recently.","rating":"9\/10","date":"13 June 2022"}
{"title":"So happy to have this show!","review":"I love this! The Godfather has long been my favorite book, and getting to be steeped in this aspect of its world is fascinating and a joy. Matthew Goode is a phenomenon as Robert Evans; I've always enjoyed MG as an actor but this role let's him take his art to a new level. I don't pretend I'm a film critic, so I won't go on and on, but I just wanted to share my enthusiasm that this show is as good as I'd hoped it would be.","rating":"8\/10","date":"28 May 2022"}
{"title":"Enjoyable, decently acted, somewhat awkward love affair with Paramount","review":"Like most streaming shows, this one runs about 4 hours longer than it should. That said, it's enjoyable, and an homage to The Godfather. Lots of pluses, but plenty of minuses. The elephant in the room is the constant product placement for Paramount+, which I had to purchase in order to watch the series. Scripting goes sideways and clumsily portrays a reality in which persons outside of Hollywood are concerned about the Paramount studio, its reputation, logo, etc. Again: an awkward love affair with Paramount, made by Paramount, in order to sell Paramount+, which we already bought. The Godfather stuff - pretty decent.","rating":"7\/10","date":"22 June 2022"}
{"title":"A meandering, middling movie-maker myth","review":"Myopic biopics are currently ubiquitous. A few of them are good, but most of them are mediocre to poor. Sadly, this falls into the latter category, no doubt the story is interesting to read about in a paragraph or two, but to hold an entire ten hours TV, not so much.The costumes, cars and other period paraphernalia are as one would expect, but the story and resulting dialogue is terminally trite and turgid.","rating":"4\/10","date":"28 April 2022"}
{"title":"Excellent! Thoroughly enjoyed","review":"My family loved this series. The casting was excellent. The acting was excellent. Loved the storyline. It was cool to learn the story behind the movie. It was good how they worked in lines from the movie into the episodes. One of my favorite scenes is the pre-filming dinner with the Corleone family. I am amazed at the skill and talent required to cast the movie. I found myself thinking \"what if Al Pacino had nit been cast as Michael? What if Brando had not been Vito? What a loss it would have been for the movie and the arts. I love the inclusion if the real Italian families in making the movie possible.Loved it.","rating":"9\/10","date":"27 September 2022"}
{"title":"Just excellent","review":"Really wasn't expecting much from a series about the making of a movie, but the Godfather intrigued me, I had absolutely no idea of the hardship it took to get this epic film off the ground and the even greater hardship it took to get it finished, superb all through...casting was top notch, acting was too notch, story was told superbly. If it piques your interest give thus a try, its a great watch.","rating":"9\/10","date":"19 June 2022"}
{"title":"Almost Great","review":"Episodes 1-8 were very good. Episodes 9 & 10 lost points for me bringing the series to a crawl. Started strong and finished weak. Somewhat like The Godfather Trilogy. I get that this was Al Ruddy's POV but other parts of the storyline were either pumped up or made up. With the ability to check facts online this made no sense to me. Tell the story and let the audience decide. Leaving out the fact the Evans had a child while going through the divorce with Ali McGraw stole a depth to his despair that would have made more sense. And as a NYker with \"friends\" in that world I know that some of what was portrayed wasn't true about certain decisions and interactions with outside influences in the making of The Godfather. Again, tell the story and let the facts play out. The acting was great and I enjoyed watching them immensely. The cast was stellar and compelling. Except for where noted I recommend this series heartily.","rating":"8\/10","date":"20 June 2022"}
{"title":"Excellent serie , Excellent Goode !!!","review":"What an amazing serie!!!Before I start , I would like to speak about the amazing performance of Matthew Goode , he was awesome and without his performance I think the serie wouldn't be the same. No words about him , just WOW.So about the serie , I really enjoy it , a wonderful story about the movie icon of the whole cinema. Ofc we saw just the surface of how Godfather came out and they didn't get deeper. The entire cast was really great with many famous actors.My opinion about the duration of the serie is that 10 episodes are what we really needed. More seasons would be too much .........","rating":"9\/10","date":"15 February 2023"}
{"title":"If you're a Godfather person - you're going to LOVE IT!","review":"I'm a Godfather nerd. I know the back stories seem all the different cuts read all the books.The Offer is the funnest romp through all that iconic movie history background info, with GF1 Easter eyes through out all from the mouth of Al Ruddy who lived it.Special shout out Matthew Goode who is an outstanding Robert Evans. I don't think anyone else could'a done that job that good.","rating":"9\/10","date":"13 June 2022"}
{"title":"Get Paramount+ just for this limited series","review":"If you don't have Paramount+ you are missing one of the best limited series made to date. It's a story everyone should experience and it is written to perfection. The casting is perfect and the performances suck you into the drama. I didn't think Juno Temple could be any better than she is on Ted Lasso but she has proven me dead wrong. Miles Teller is taking Hollywood by storm right now, and it doesn't stop here. Giovanni Rabisi plays the powerful but a little timid when faced with other bosses mob boss to perfection. Matthew Goode is crazy, angry, caring, and just plain off the charts. I could go in and in about every actor in thus series. As Giovanni would say, see this series for your own good.","rating":"9\/10","date":"29 May 2022"}
{"title":"Get past the first 2 episodes.","review":"After watching the first 2 episodes of The Offer, I was thinking it was missing everything The Godfather had, namely great writing, great acting, great drama, suspense, vision and a number of other things. It came across as low budget and an exploitation of the original movie.The only saving grace was Dan Fogler as Coppola.I forced myself to turn on episode 3 and it slowly began to grow on me. Giovani Ribisi's role as Joe Columbo originally came across as a buffoon, but the role improved.Characters developed, Fogler got more screen time, and the \"meat\" of the movie making kicked in. It never transformed itself into The Godfather, it shouldn't be expected to. But it did become more watchable and intriguing.If you are a fan of the movie, get past the first two episodes and you may enjoy it.","rating":"8\/10","date":"13 June 2022"}
{"title":"I'm going to be sad when this is done!","review":"I am loving this show! Cast is superb. Everything about this show is great. Can't wait to watch it each week. I don't know how The Godfather ever got made. Lol. I'm just glad it did. I'm equally glad that this series got made.","rating":"10\/10","date":"4 June 2022"}
{"title":"I","review":"Watched an episode of this a while back and liked it! Then when I got Paramount I finished it! Which is hard as things don't stream easily for me on there. So I watched the rest and the excitement just left?!? I'm not a huge fan of the Godfather but I was really liking this after the one episode. And I think it should have been condensed down to 8 episodes. The 10 th one was a waste! Then I read how horribly inaccurate the whole thing is and then I have less respect and enjoy it less. Wheahter about the Godfather or what I love 70's based themes but this just kind of fell short after the 1st episode!","rating":"6\/10","date":"28 June 2023"}
{"title":"A great piece of...","review":"Fiction. Shouldn't a movie based on a movie's history told from the perspective of a studio that created said movie and is now creating a narrative about the whole thing be interested in telling an accurate nuanced portrayal of events? Especially, considering the whole thing is on a network which namesakes and is owned by the studio in question? I would think so. But alas, the whole thing is a farce told by the recollection of a dying man and the writing of a man who, prior to this created such soulless nuggets such as deep impact. Yes, Tolkin has an academy award but that was for adapting works and not his own creations.Sure, I am still waiting for my Oscar nod but at this point I am only famous enough to blather on to a message board such as this. Either way, I have enjoyed this fiction. Everything I read by those involved in the film seem to all recollect everything in this story happening a good portion differently than the way it is portrayed here. The sin that only one individual, actually involved, was approached to retell the set of events is arrogantly obtuse and shows the writer had no actual intention of telling an actual story of true events. Read the Deadline article about the movie as well as an article about an attempted meeting with th writer on the San Francisco Chronicle's site datebook.I enjoy the acting and it is fun watching a period piece with excellent set design and costuming and though the acting seems over the top it is still a valiant effort in recreating individuals the public know well. It is nearly impossible to handle characters always in the limelight without making them seem caricatures and that is how it all appears here. It all boils down to fun without actual substance. I enjoy the story in telling the Herculean efforts involved in making a movie however the story relies more on parable involving very little fact to the surface veneer.I gave it a five because it is legitimately fun but I would have preferred it be legitimately factual.","rating":"5\/10","date":"16 May 2022"}
{"title":"The Offer","review":"The Offer is a Mini-Series produced by Leslie Grief (never seen anything from her) and Michael Tolkin who has proven to be a very good writer with The Player, Escape at Dannemora and more.Obviously, the pivotal point of focus in this mini-series is The Godfather, arguably the best movie ever made but what stunned me the most was that soon you forget you're watching something related to The Godfather and you are engolfed by this force of nature that is Albert S. Ruddy.It takes a vision of a genius to be that committed to something when everyone is against you and that applies to Ruddy but also for Coppola and Puzo. The cast is superb, Matthew Goode is carismatic and you can't take your eyes off of him, Juno is remarkable as a sidekick (her line of \"Is it legal?\" always gets me) to Ruddy and lastly, I loved Miles Teller on this mini-series and it may be some of his best work.The look-alikes were very good, some uncanny. The storytelling is medium-paced (not slow but not very fast) and it locks your attention from beginning to end.I really loved this show, watched it all in a week and if you haven't watched, it doesn't even matter if you're a fan of The Godfather or not (most likely you will be), you're still going to enjoy it.","rating":"9\/10","date":"17 June 2022"}
{"title":"Better than expected","review":"It's incredible how this entire series can both be so good and also appear so much like a shameless self promotion for Paramount. After all it is all about producers and executives for Paramount and it is streaming on Paramount plus.It's an interesting ride to see all of the components necessary to produce this film, given its mafia overtones and how known the story was from the book prior to pre-production. It's interesting to see all of the many ways the wrong decision could have been made and nearly were made. I'm sure some of the specifics aren't perfectly presented how they really happened like many stories based on real events. But it never feels like it's crazy different from what likely really happened.The characters are well written. No prominent character is perfectly good or evil. Some of the main characters are more likable than others in different ways. From time to time they are backstabbing each other or putting themselves on the line to support a co-worker for the sake of the project. It just feels very authentic to what it was likely like to make a movie at that time in that environment. Collaborative art is messy in the best of circumstances. The series address issues of work culture of the time without seeming to scold everyone for ever being associated with the workplace of the late 60s and early 70s.It's probably more fun if you're into filmmaking in general rather than into The Godfather specifically. But those who are into both will probably like it the most.","rating":"9\/10","date":"22 October 2022"}
{"title":"Very good show - a gem we werent expecting","review":"Family had recommended we watch this and am glad they did. My wife and I are binging on this at nights. Really good episodes with thoughtful scenes - doesnt feel like things are being drawn out for the sake of creating a series. In fact it seems like they are trying to squeeze all their ideas into a limited about of episides, which is quite entertaining.I appreciate the casting, and trying to find similar characteristics between the original actors of the godfather and the offer. We are only about halfway through but am assuming this might not be the only season already.If you watch this show make sure to do it when the kids are down and you have some scotch available :)","rating":"10\/10","date":"25 November 2022"}
{"title":"Sincerest form of flattery....","review":"I admire the use of imagery and scenes mirroring The Godfather in may respects throughout the series. Casting was a bit off on some characters....but Teller is believable and passioned but lacking some Ruddy....the connections between characters plays through on scene and makes for a compelling story telling that plays fluidly through the key players.... Puzo\/Coppola, Cohen\/the Mob, Paramount\/Evans and Ruddy.","rating":"8\/10","date":"14 May 2022"}
{"title":"A 10+","review":"The Godfather is my favorite movie. This history of how The Godfather was made and the connection to the mafia were presented in the most amazing way. The show is just amazing. Episodes 5 and 6 - FANTASTIC ! They really kick it into gear.","rating":"10\/10","date":"20 May 2022"}
{"title":"Grit and Gold","review":"Not only does this series tell the story of how the most famous and arguably best film of all time was made, it also shows the depths of film production.Miles Teller as producer Al Rudy, and Mathew Goode as Head of Paramount Bob Evans both shine on screen. Mathew Goode has had some great performances in the past, and he really shows his chops here. But Miles Teller is both protagonist and star. For a man often type cast as either nerdy or wimpish, he has proven in recent years he is capable of much more. In my opinion he has given his best performance, certainly his most macho. And yet human also. The lengths he goes to make his movie a reality are extensive, dark, but also necessary. Including befriending a mafia boss who at first wanted to shut down his production. Giovanni Ribisi as Joe Columbo is a surprising yet great casting choice. Definitely a must see series for those who love mafia movies.","rating":"10\/10","date":"5 November 2022"}
{"title":"Critics Have Never Been So Wrong","review":"What a great mini series! This was way under the radar for me, never heard a peep about it until it popped up on Paramount +. Felt like someone invaded my brain and made a series just for me. I took off a point for episode 10, it just didn't deliver. But every other episode was top notch. Any critic who rated this negatively should have their credentials pulled, what were they watching... Miles Teller is quickly becoming our next big star.","rating":"9\/10","date":"17 June 2022"}
{"title":"Amazing show","review":"I am a long time Vail local ranch owner and pro snowboarder (90s) and usually get around 85-90 days on my home mountain of Vail snowboarding and skiing and after surgery I had to sit around (which is extremely hard for me) and find good things to watch on tv. Two of my dear friends are producers in LA (Stellarhead ) and they told me of a few streaming shows to watch (PIG, etc.) but I found this \"The Offer\" show on my own. It is the best thing I have seen in forever, great story line and each actor was mesmerizing to watch. PLEASE have at least a season two if not ten!!! Acting\/story was incredible!","rating":"10\/10","date":"11 March 2023"}
{"title":"What a way to ruin a classic","review":"It's a great show with great actors and actresses. That's it. 70% of the plot is made up, the rest is cool. If you're looking for a factual set of events, don't bother, it's just pure imagination. To be fair though, the production value is very high and it makes the whole show feel complete. But it's not, I recommend to read up on the real events that took place so you'll see how much it is that is actually completely made up. But it's not, I recommend to read up on the real events that took place so you'll see how much it is that is actually completely made up. But it's not, I recommend to read up on the real events that took place so you'll see how much it is that is actually completely made up.","rating":"","date":"14 September 2023"}
{"title":"Background tv at its best","review":"If you are interested in the making of the Godfather it is a really well done show. The acting is stellar (Ribbisi stands out). The plot and dialogue is fairly simple so it would make a great show to watch while doing chores.","rating":"6\/10","date":"22 June 2022"}
{"title":"You're kidding, right?","review":"This show is nothing but bad memory nostalgia, insulting cultural cliches, and simply bad acting and writing. It's bloated as heck and did not need 10 hours. The characters are all paint by numbers bad cliches of 70s era Mafia goons, studio execs and \"creatives\". The almost unanimous 10s really blow my mind. I could see MAYBE a bunch of 6s peppered in amongst mostly 4 to 7 rankings. But almost all 10? I really don't get it. Comedies and musicals trade in these one dimensional caricatures of people and they have no place in a show like this. The pacing is like molasses and the Puzo and Colombo characters are simply place holders. The best thing that can be said about the Coppola character is that he vaguely looks like Coppola. I really don't get how this was green lit and why people are so glowing in their reviews.","rating":"2\/10","date":"27 January 2023"}
{"title":"Wonderful Show","review":"This show is extremely interesting and to learn all the background that went into the making of The Godfather is mind boggling. Also, seeing the stories on all the different characters was riveting.","rating":"10\/10","date":"14 June 2022"}
{"title":"Sleeper Hit of 2022","review":"I only discovered this now 3\/4 the way through January 2023 and had my brother not of been watching it I would have never heard of it.All I can say is wow, wow, wow! If you are anything at all interesting in the art of making a movie from start to finish this will inspire you ten-fold! The cast, characters, production, and cinematography are all on point. It's shot like a movie and each episode plays out as such.The reason why this is good is simple (and also overlooked by modern media); Struggle. Every episode is compounded with struggle to get the movie made and it keeps escalating. There is never a dull moment in the story and it will have you wanting to watch the next episode until it's complete.In all honesty I wish every film-maker could see this. It would inspire them to finish their movies and want to work at paramount, although I can't say that the work environment is anything like what was portrayed in the show, even if they make a damn good job of what it could be like.9\/10 with 1 point lost for making me watch the godfather for the 900th time.","rating":"9\/10","date":"25 January 2023"}
{"title":"GIOVANNI RIBISI as Joe Colombo steals the show","review":"We all love history. We've also watched the crown, godfather of Harlem and narcos to watch history rewritten and us the audience feel very much like we are part of unraveling.For me this series taught me about creating something and what it takes to do something against all odds. It is a very inspired show, whether or not everything in the narrative is true or not, it is still a very great show.I love all the performances but one for me stood out, RIBISI, I've been a fan of his since BOILER ROOM. His impersonation of JOE COLOMBO was too good. He even outclassed Miles Teller.Dan Fogler's casting was also fitting.Loved the show, keep them coming.","rating":"9\/10","date":"28 January 2023"}
{"title":"Perfect insight for film lovers","review":"I adored this series on Paramount and didn't want it to end. If you are a fan of the film The Godfather, this is the 'even stranger than fiction' true story of the blood sweat and tears that went in to making it. Miles Teller has gone up even more in my estimations. A true star. Plus he had a lot to do with producing and bring the series to life. So life imitating art, imitating life . Mathew Goode, Giivanni Ribissi and Juno temple are also fantastic. You really get to know these people and truly care about what happens to them. For a movie fan like me, it made me appreciate even more what a collaborative difficult process making a movie is. Enjoy. ðŸŽ¥ðŸ’¯ðŸ˜Ž","rating":"10\/10","date":"7 September 2022"}
{"title":"What were the critics watching?","review":"I'm not one often to leave reviews, but having seen the first two critics swipes at what I thought was an excellent show. I felt the need to leave this.I must confess to being a massive fan of the Godfather trilogy (okay, the first two films), and this subject material and actually find both compelling and exciting, but where the critics seem to see cliches I saw fascination, one reviewer said it was harking back to a generation who quoted and saw The Godfather as some form of code in adolescence, I was and still am that generation and still quote and believe in Respect, Honour, Family and being true to yourself...\nThus show is superb, I would be astonished if any fan of the film didn't find. This show brilliant, and I would be very confident recommending it to anyone with an interest in filmmaking or Hollywood..Watch it, I bet you love it.","rating":"9\/10","date":"21 December 2022"}
{"title":"Entertaining, Informative, Well acted","review":"Such a gem - everyone involved gave their best. An amazing script transformed into a wonderful and very entertaining Series. I wish everyone would take such care in creating movies\/series. It hooks you from the first episode and tells a very interesting tale. The characters a very well developed and all actors gave their best.Cinematographic magic! Highly recommended.","rating":"10\/10","date":"12 August 2022"}
{"title":"A great Paramount's series about Paramount's greatest film.","review":"The offer.Oscar winning Robert S. Ruddy and his never before released experience of making the iconic 1972 \"the Godfather\".It's just a great series about the greatest movie ever \"the godfather\" ,can you imagine !Well, it's a bit more than that and it's definitely one of my favorites shows this year ,I loved it.I didn't know that there was a whole story behind making \"the godfather\" and how tough it was , it's a whole different independent movie .Paramount has just made a series about making her greatest movie and It was fine that they were trying to give credits to their selves through this series ,it's totally right .I haven't mentioned my favorite part yet , characters .The charismatic Al Ruddy , the electric Bob Evans, the crazy boss Charles ,the master Coppola ,the lovely Betty , the godfather Joe Colombo and Barry that I have mixed feelings about and a lot more of great characters.Great work from everyone in the cast really ,they all were perfect as their chemistry was.A special appreciation for Miles Teller ,he's been doing a great job lately !What I'm not sure about is if the story was delivered as it is or there were some modifications for the thrilling part, anyway it comes together really good and I enjoyed it.Thank you paramount for making \"the godfather\" and thanks for this great offer too!","rating":"9\/10","date":"25 August 2022"}
{"title":"Excellent, Juno don't ruin your beautiful appearance.","review":"Great production, acting, cinematography, script.Now that I have seen it I will watch The Godfather (still another time) to see the nuances referred to in The Offer.Sadly, one can already see the damage to Juno's skin that cigarette smoking is doing, Excellent actress, needs to take better care of herself.Overall, A+ series.","rating":"9\/10","date":"22 June 2022"}
{"title":"Oh noooo","review":"Oh man, is there anything good coming out anymore? I am a huge fan of the first two Godfathers and probably the best films ever made so when I recently saw a trailer for this I was so stoked, but that didn't last long.From the hammy caricature performances to the fake-looking sets to the bad dialogue I couldn't hang in for long. I had the same criticism of Sopranos that it was a bad version of previous Americano gangster films like Godfather and Goodfellas.If you can't do it better or differently don't do it at all. The cast wasn't very good, but Matthew Goode was good as Evans. Miles didn't resemble Al Ruddy one bit and looked way too young and immature for the part. Ruddy had a rough around his edge, a manly man, which Miles just doesn't have. Nora Arnezeder was way too pretty to play Francoise Glazer.Getting one thing wrong is forgivable, but not a majority.It was flash over substance. It looked like people dressing like the 70s, rather than BEING and LIVING the 70s. Could they have a make-up and wardrobe person that can get it right?Then the expositions dumping data and tidbits like Puza saying \"I don't know what to write\" and his girl saying \"why don't you write the mafia story?\" and of course, it was his wife that inspired him to write the book. I didn't buy any of it.The lighting was also terrible. Sometimes just not warranted and too stylized.In the end, they jammed too many characters and stories into this way too long series.","rating":"1\/10","date":"7 May 2022"}
{"title":"The acting is a tour de force!!!!","review":"Miles Teller reminds me of a young Clint Eastwood. I could list another 12-15 actors and review how good they were. The story and filming was also phenomenal. For 9 episodes (so far), I have felt like I was employed by Paramount and helping to make the show. Two final words: WATCH IT!!!","rating":"10\/10","date":"14 June 2022"}
{"title":"Great Entertainment!","review":"I love, love, loved this! Casting was spot on........with one exception for me: Matthew Goode. Why on earth cast an Englishman with an unreliable American accent? Why did he play Robert Evans as an adenoidal clown? I checked old interviews with Evans and he didn't sound nasal to me so there goes that excuse. I thought he overacted throughout.Miles Teller totally owned the screen and Juno Temple as Bettye McCartt was outstanding. The Godfather was such a seminal movie it was fascinating to get some of the inside story on how it all came about while bearing in mind that it's through the highly subjective filter of Al Ruddy. Gorgeous production values too.It really seems to capture the atmosphere of Hollywood at that time and I thoroughly enjoyed it.One pet peeve: Why so much\/any smoking? We all know it's historically accurate but it wouldn't have damaged anything to leave it out.I'm guessing not everyone in the film industry is immune to lung cancer.","rating":"9\/10","date":"15 January 2023"}
{"title":"Absolutely not to be missed","review":"One of the best series I've ever seen. Excellent screenplay, direction, cinematography and editing. Acted well by all the actors. Never trivial or obvious, it involves and excites. It allows you to discover what lies behind the making of a film, from a point of view normally little considered by the viewer, often led to consider, above all, actors and directors: that of production. An interesting story develops around the production of The Godfather, at least as much as the one narrated in the film. A story, probably, partially fictionalized, but with many references to real people who built the history of the Paramount production company. An impeccable realization which, except in rare moments, does not lack attraction, from start to finish. Well done to all who made it.Absolutely not to be missed.","rating":"10\/10","date":"2 January 2023"}
{"title":"Amazing series! A tribute to acting! Incredible writing! A must see!!","review":"I fell in love with this show entirely! It's honestly a treat! One of the best series I've seen this year! The plot, the cast really did an outstanding job!!! I want to see them win some Emmys!","rating":"10\/10","date":"27 May 2022"}
{"title":"A show about making a movie? AND THANK YOU","review":"I love the godfather. Thought the idea of a show, about the steps to making it would be...meh. But I'm so glad I was wrong. Just wow, every scene with the actors playing the actual cast was incredible. \"Kiss the ring\", don't wanna say too much. Just watch!","rating":"9\/10","date":"19 June 2022"}
{"title":"Outstanding","review":"In a sea of streaming platforms choked with hours of very average programming, The Offer stands tall. One of the best limited series I have seen. The story has legendary status because of The Godfather. The actors performances are without peer especially Matthew Goode. It's so good it can be watched over 3 or 4 times, and you see story elements that you missed on first viewing.","rating":"10\/10","date":"29 May 2022"}
{"title":"Fantastic series about the greatest movie ever made","review":"I just finished episode 6. I wasn't aware of all the things that were going on behind the scenes of The Godfather. This series is great. The cast is so damn good. I binge watched the first 6 episodes and can't wait for number 7. I first saw the Godfather at a drive in...1972. I have probably watched it 100 times since then. Anyways if you're a fan, you will love this series.","rating":"10\/10","date":"23 May 2022"}
{"title":"I LOVE IT SO MUCH! I have rarely seen a series done so well!","review":"This show is a masterpiece and I feel as if I have been taken back in time! I was very skeptical when I saw the first trailer on TV but these people have delivered, BIGTIME! Please give these folks almost all of the hardware they have coming but try to save some for Bosch: Legacy.","rating":"10\/10","date":"24 May 2022"}
{"title":"Seriously Who Cares?!","review":"Can anyone care about this? The hype and subsequent yawn fest is not to be believed. Horrendous. Bad acting. Bad writing. Bad director. Just bad. Its really concerning that anyone actually sat down and thought this was a good idea.","rating":"2\/10","date":"19 May 2022"}
{"title":"A modern classic","review":"After reading many reviews and watching the trailer my expectations were very high but I was still blown away by this spectacular series. Watching this series made me realize how little the great majority of us really knew about what was going on behind the scenes involving the mob, their influence and the power they were exerting to get the movie done..The acting and cinematography were outstanding in every way..Anyone who watches the first episode will not be able to stop just like a great book. Great acting combined with an unbelievable storyline makes this one of the best series this century.. Kudos to all involved, u crushed it ..","rating":"10\/10","date":"1 December 2022"}
{"title":"Amazing","review":"This show is incredible! What an incredible story and amazing acting. Matthew Goode is electric, Miles is teller does an amazing job. I honestly don't have anything negative to say about it. The show keeps you on the edge of your seat waiting for what's going to happen next. The cast for this show couldn't have been any better and the screenplay is incredible. This is my new favorite show. I'm recommending to all my friends!","rating":"10\/10","date":"6 June 2022"}
{"title":"Critics haven't a clue!","review":"Have read many critics reviews panning The Offer. They know nothing of what they speak, as is often the case. Have enjoyed The Offer immensely. Everything about is well done. Trust the users reviews, much more in tune with this most remarkable mini-series. Paramount+ has quickly become a must have streaming platform.","rating":"10\/10","date":"27 May 2022"}
{"title":"One of the best one season shows out there","review":"I wish I could have binged it all in one shot but I had to wait. Luckily for you, if you haven't watched it yet, you can watch the full season. It's a must watch. Fantastic performances by all. Never a dull moment. You will love this show.","rating":"9\/10","date":"18 June 2022"}
{"title":"You Could Refuse The Offer, But Don't","review":"The Offer is my favorite series right now. I look forward to it every week. Some slag it, but you can usually tell by their writing they're no critics. Sure, it's a bit ham handed at times and a mixed bag. It's filled with nods to the movie and anachronisms, such as the assassination of Joe Colombo and Hit on Crazy Joe Gallo. Both of those happened in the late 70s, well after the filming of The Godfather. And not all of the actors nailed the people they're portraying, but enough of it is right to make it enjoyable viewing whether you know the people and the stories or not. I would have like to have seen more on Gianni Russo. He was the one actor that, as a courier for Frank Costello, was mobbed up enough to make the filming in New York happen. But the series is all from the point of view of Al Ruddy. So, of course, he's the hero of the story. The two lesser bosses Ruddy and Lapidus argue like kids. But the two big Bosses fight like Titans! Gorman is a psycho as Bluhdorn. Barking mad! And Goode is really good as Evans. He has the voice down. For those who don't know it, it's a great story. And, for those who do, it's fun to see what they got right and what they went Hollywood on. Do yourself a favor. Don't refuse The Offer.","rating":"8\/10","date":"9 June 2022"}
{"title":"paramount is the mountain top!","review":"As bob evans delivers the line paramount is the mountain top. I find it poetic justice that for me paramount is becoming that once again, with all sheridan's shows and now this! They are producing the best tv out of all the networks. The offer is just simply a masterpiece! Masterfully written and acted by everyone and multi layered this is not to be missed!Even though all the actors are superb, i found giovanni ribisi and matthew goode in particular oustanding in there roles as mob boss and studio head.If you have not seen the godfather you will love it, and if you have seen the godfather you will love it even more. Either way your in for a treat.","rating":"10\/10","date":"30 December 2022"}
{"title":"Stallone must got money invested into Rotten Tomatoes,cause this show smokes Tulsa King.","review":"I agree with Ali. 56% with rotten tomatoes WTF. This series is excellent and like I stated Stallone must have money invested with rotten tomatoes or rotten tomatoes just doesn't know what you're looking for. In my opinion this show is much better than Tulsa King. They did a great job for trying the actors and the people at Paramount Plus in the 70s. The show kept me at the edge of my seat and I can't give a higher review than 10 but I would. Hats off to the producers. Gallo, Colombo and all the other Mafia actors were so legit. It's just amazes me that rotten tomatoes would only give this show a 56%. I almost didn't watch it because of that. Last time I listen to their reviews.","rating":"10\/10","date":"3 January 2023"}
{"title":"ABSOLUTELY FANTASTIC!","review":"Great dramatization of the story behind the making of the best movie of all time! Fantastic writing, casting, acting, sets, costumes, and pacing! This is one of the best television shows on any streaming service. I hope they bring The Offer back for another season to show behind the scenes of The Godfather Part II!","rating":"10\/10","date":"2 June 2022"}
{"title":"Not a huge godfather fan","review":"I couldn't find anything to watch and seen the preview to this and it looked decent, first off, I do not like the guy who plays the main character, Ruddy, I believe he produced it too, he's a bad actor, has no charisma, he's like a cardboard cutout, Juno Temple, who I usually like, is annoying in this and looks like Anne Heche, this is way too long, its so boring and the characters who play Coppola and Puzo are annoying as well, I guess they thought the buddy, buddy thing with them would be cute, didn't find anything humorous about it, most if it is unbelievable, Giovanni Ribisi fails here, the portrayal of the mob is all wrong. Who wrote this crap. I watched 3 episodes, longest 3 hours of my life. This did not need 10 episodes, maybe 5. They dragged it on and on, I liked that it was set in the 70s, but alot of the outfits and stuff were all wrong, this feels like it was written by an amateur kids 1st script, everything is extemely over exaggerated, yes Matthew Goode is good in this but is over played. It's just alot of the same in each dragged out episode, I hated it!","rating":"2\/10","date":"3 September 2022"}
{"title":"Excellent","review":"Brilliantly cast series with few surprises. Binged watched first six episodes. Miles Teller great in a cool portrayal in what would have been immense reality pressure Matthew Goode is simply outstanding.","rating":"10\/10","date":"10 June 2022"}
{"title":"Brilliant","review":"As a lifelong fan of the Godfather movies, I was delighted when I learned this biographical drama was being made, starring some of my favorite actors - the ever-so-charming and talented Matthew Goode, fearless and beautiful, one-of-a-kind Juno Temple, and very likable and funny Dan Fogler of the Fantastic Beasts series - to name a few.The series was a lot more than I had hoped for. A stellar cast, excellent script, superb acting and directing, great cinematography, a wonderful balance of drama and wits - it's got it all. I must say Matthew Goode is brilliant. He is sharp, funny, entertaining, still charming despite the character's edginess - he's better than ever. His performance has surpassed my expectations - I hope he wins an Emmy and a Golden Globe for this! Anthony Ippolito as Al Pacino is impressive. My favorite Juno Temple's sensitive but fierce presence and acting, as good as ever. Other cast are all terrific.Got nothing bad to say about the series. Thank you, Paramount, for creating and producing it. Forget the critics' bad reviews. So what if not every scene is as it really happened because it's based on Ruddy's autobiography. It's a biopic, not docuseries, it doesn't all have to be true to the facts. And what if it's a little over the top. This is an incredibly well-made, fun and fascinating must-watch that's sure to make time fly. A pure entertainment as this, is a treasure, especially in this day and age.","rating":"9\/10","date":"29 June 2022"}
{"title":"I think it's my first review here...","review":"Amazing Show... Outstanding Performances !Before i watched this show, i rewatched all the Godfather saga.It's so well made and presented, and i never see a show with so many amazing performances from the main caracteres.Even if you are not a Godfather fan, this show will give you 10 hours of pure entertainement.","rating":"10\/10","date":"28 June 2022"}
{"title":"false note","review":"Just one misnote, not a single time music and Nino Rota were mentioned in the show. Matthew Goode was Brandonian, ten breathtaking episodes I must say, I watched them in one night.","rating":"9\/10","date":"25 June 2022"}
{"title":"Wow THE serie about making THE film of all time and it feels GREAT","review":"Wow THE serie about making THE film of all time and it feels GREAT. The look and feel are in line witje the best film ever. The actors are real the story line is exciting and as the movie it is way tooooooo long but at the end it you think oh no it is over !!!","rating":"10\/10","date":"26 June 2022"}
{"title":"Great Story for the Godfather Fans!","review":"I have been intrigued by this show. Great story, good acting, and very interesting to see the hurdles that had to be overcome to make this film. They did a great job of casting all the players in this story.","rating":"10\/10","date":"12 July 2022"}
{"title":"Pure class, straight up & down - 10\/10","review":"Rarely do you find television of this quality. This series just exudes style from it's pores: rich, classy & sharp as hell.Whether you're a fan of The Godfather or not (if you're not, what the hell is wrong with you???) this is simply a 'must watch' without equivocation or hesitation & the casting is both an inspiration and a revelation; Matthew Goode as Robert Evans & Dan Fogler as Francis Ford Coppola, put in the performances of their careers.Don't sleep on this!","rating":"10\/10","date":"2 July 2022"}
{"title":"If You've Watched The Godfather, this is a trip!","review":"The casting and acting is so GOOD! If you truly know these actors, you will see what the casting crew saw in these people!I also really hope this is accurate, because the subplots are insane for those who have seen the movie.","rating":"10\/10","date":"14 July 2022"}
{"title":"Unlikelihood at this best","review":"I was excited to watch the series but I stopped at the middle of first episode. Could not watch it anymore. Bad writing and bag direction. Things did not happen as they showed. The audience does not like and do no have confidence in scripts that deliver things so flawless. A good director cannot do a good thing with a bad script.","rating":"5\/10","date":"30 April 2022"}
{"title":"Absolutely Fantastic","review":"While I have watched The Godfather literally hundreds of times, I learned a lot about the obstacles that had to be overcome to produce this movie. The highlight of the series (for me) was the premier scene in the final episode. SPOILER ALERT - The scene where Bob Evans opens the door to find Ali McGraw standing there to accompany him to the premier was beautiful, and so was she. Anyone who is a fan of The Godfather will love this series.","rating":"10\/10","date":"3 July 2022"}
{"title":"It's great","review":"I didn't know the story surrounding the creation of the Godfather, but this series delivers it interestingly, with excellent story telling, directing and most of all - acting. Miles is great as always and the rest of the cast are great and just a joy to watch.","rating":"10\/10","date":"23 June 2022"}
{"title":"True brilliance!","review":"With a soundtrack to make anyone air guitar, dance or simply regale in the knowledge that music used to be so much more than just something to listen to, combined with a subject matter which, for anyone over the age of... well... there are no age limits to the appreciation of 'The Godfather,' this series captures everything a drama should.The acting, writing, editing, production, direction is just superb. This is what everyone in the aforementioned list should aspire to.Bravo to Paramount. In a time of political correctness, adherence to 'the current thing,' and other streaming services desperate need to comply with what the crazy idiots now in charge of our world deem acceptable, they take the bull by the horns and create a series worthy - if not demanding, due to its pure brilliance - a show everyone needs to see.10\/10, and please continue to break from the norm!","rating":"10\/10","date":"8 August 2022"}
{"title":"Superb!","review":"Every now and then something special comes along and I am riveted to the tv screen.. It took one episode to reel me in! All I can say is 'Wow' !!Any fan of that epic movie called The Godfather .. This one is for you!","rating":"10\/10","date":"14 July 2022"}
{"title":"Is the the offer: watch the Offer!","review":"This show is so much fun and has great actors. Miles the one of the best right now and Pacino and Brando characters were on point. If you loved the Godfather, watch it.","rating":"9\/10","date":"9 July 2022"}
{"title":"An offer I couldn't refuse....","review":"This is so interesting, having watched The Godfather a few times, it amazing to see some of the background of how the film came to be. I'm literally obsessed with Matthew Goode's voice in this, I find myself repeating his lines after him...And the method involved in Marlon Brando's actual performance is totally fascinating!","rating":"9\/10","date":"4 August 2022"}
{"title":"A show you can't refuse","review":"Wow! What can I say. Absolutely amazing 10 part series on the making of possibly the greatest movie ever made.Acting was slick and engaging. A huge shout out to the casting on this series as there were some really stand out performances, Matthew Goode, Juno Temple get a special mention as does Miles Teller whom I don't know much about apart from Whiplash.The guy you played Pacino absolutely nailed his voice!I'm a huge Godfather fan anyway but there were some great insights in to the making of the film.If you like the godfather please watch this series. Outstanding!Oh and I cannot leave this without saying what an underrated actor Giovanni Ribisi is! Legend!","rating":"9\/10","date":"1 August 2022"}
{"title":"Unreal","review":"Absolutely incredible show which gives such a insight into one of the greatest films of all time. I bet most people who have watched this great movie had absolutely no idea the trials and tribulations paramount and everybody involved has to go through! Bob Evans what a man! 10\/10 tv show in which I was hooked and couldn't stop watching!","rating":"10\/10","date":"11 August 2022"}
{"title":"Waste of Two Hours I'll Never Get Back","review":"I made it through 2 episodes which inspired me to watch The Godfather again...followed by The Godfather 2. The constant jabs at Sinatra are ridiculously annoying.","rating":"2\/10","date":"6 July 2022"}
{"title":"Best Series this Season","review":"Every episode of this series was phenomenal! Justin as Marlon Brando was incredible, Emmy worthy. This series has everything, drama, comedy, sweetness. The entire cast\/performances were wonderful!","rating":"10\/10","date":"11 August 2022"}
{"title":"What a cracker!","review":"From the very first few minutes to the very sad last scene The Offer had it all.The cast were amazing, the writing gripping, the sets so original, nothing was spared on this production.Matthew Goode was outstanding!I could watch The Offer many times over.","rating":"10\/10","date":"11 July 2022"}
{"title":"It does the Godfather justice.","review":"Matthew Goode and Miles are two stunning actors in this series. It is well worth watching and seems to not be a sell out commercially in terms of\nartistic choices. Great to see how a film like the Godfather came about. Found it so interesting. Great performances, great script. 10 out 10 all day long. Wish there was an opening at the end for season 2.","rating":"10\/10","date":"6 July 2022"}
{"title":"Like this better then the G-father","review":"Yes I liked this better then the g-d father and I really liked the g-d father. The dude who plays the producer was beyond brilliant !!! Stole the whole movie for me. Francis ford Coppola is portrayed perfectly if you're a fan of the GF this is a must watch.these not a bad actor or performance in this series. Based on a true accounts on how they got this movie made if this is true ( and alot is based on true accounts, as I researched alot of this material ) it's amazing this film ( the original GF ) ever got made. I can't recommend this series anymore it's a brilliant piece of filmmaking on one of ( arguably ) greatest movies ever made. State of grace is my favorite mafia type movie but that's a whole other review lol.","rating":"8\/10","date":"2 February 2024"}
{"title":"This is your next binge","review":"Stuck for something to binge on!! I got you! I give this a 10 out of 10!! Great cast great especially Matthew Goode who plays Bob Evans Paramount movies boss is one funny crazy fella! A young Al Pacino just too good and Giovanni Ribisi as gangster Jo Colombo is utter genius casting and acting!! It's crazy to even think \"The Godfather\" nearly was never ever made! Too good to miss! You're welcome..","rating":"10\/10","date":"24 June 2022"}
{"title":"This is definitely an Offer you can't refuse!","review":"The Godfather trilogy is such an important part of my life and the first is my favourite film of all time - and that of my late father. We watched it together dozens of times. It was \"our thing\" and it gave me a deep love of cinema that I still gave to this day.This mini series tells (even if a little exaggerated no doubt) the story behind the blockbuster film in such a way that one can't help but get carried away by it.The actors selected to play key roles are fantastic and the mood set by each of the directors works beautifully.It feels like a prequel to the films and is undeniably a homage to Albert, Bob, Francis and Mario in particular with a very special mention to Marlon and Al Pacino.Like the films, this is a work of art that I'll very happily revisit.","rating":"10\/10","date":"9 August 2022"}
{"title":"One of the best series of 2022, an excellent tribute to The Godfather","review":"To be honest, I only watched The Godfather (and it was a long time ago), and didn't watch the sequels for no reason at all, but I've been hearing everywhere what a great trilogy it is. I'm interested in the production process of any movie or TV show, so I really enjoyed watching this mini series. Not only the story, script and the acting is great, but a big applause to the great casting - every actor portraying real life producers, actors, director etc. Really let you see them perfectly in the series. Had no idea how Mario Puzo began to write The Godfather, how the book was managed to be adapted to a movie, the struggles etc., so watching all that process for a movie that is older than me (my father was 24 when the movie came out!) was phenomenal. I highly recommend everyone to watch the series; you'll love it either you're a Godfather fan or simply a movie\/series fan.","rating":"9\/10","date":"6 August 2022"}
{"title":"The best series ever made","review":"Funny, spontaneous, hilarious, interesting, loved every second of it. The story is perfectly well told throughout time, characters, and talent.This is a very rich story.","rating":"10\/10","date":"29 June 2022"}
{"title":"It will help with sleeping problems","review":"It's slow. It's boring. It's not even worth it. This shouldn't of been made. I was expecting more from this show but I was disappointed. Casting should've been done better than all these D list actors. It will probably help you if you can't fall asleep because I wanted to lay down and go to sleep while watching it because it's that boring.","rating":"1\/10","date":"28 April 2022"}
{"title":"The Cast!","review":"What an incredible cast ....each actor\/actress steals the show , just when you've watched a great performance another actor comes along a gives a better one ....it's so well done by everyone...but I gotta give props to Matthew Gorman as Bob Evans and Burn Gorman as Charlie Bludhorn ...I'm impressed!","rating":"10\/10","date":"19 June 2022"}
{"title":"Masterpiece","review":"It is such a beautiful show.I enjoyed all the aspects of every episode.They really could make a sequel.It could really be watched without having knowledge of The Godfather, but being a lover of the Trilogy, this gives a special importance.It touched me in so many aspects.The Godfather is a masterpiece, the story of The Godfather is a masterpiece, too. It really is above all other categories. And 50 years later, the story flows so easily and after finishing it I realized that even complete story was missing this and that was unimaginable before watching this mini series.The acting is great and Matthew Goode's performance is outstanding.I enjoyed watching the details of how Frances Ford Coppola is standing for his work and fight for it despite all the obstacles that we simple didn't know existed.It grew even more in my eyes, and I will be very happy to watch The Godfather again, now, from the different perspective.Big Bravo!","rating":"10\/10","date":"21 June 2022"}
{"title":"Very well done","review":"Teller is someone I have never liked but in this show, I finally could tolerate him because he played just a normal person which I can buy.But the show was stolen by Goode as Evans, Fogler as Coppola, and Ippolito as Pacino, even if he didn't have much screen time.Great series overall learning the dramatized story of Paramount and how the Godfather got made.","rating":"9\/10","date":"18 August 2022"}
{"title":"Amazing show about making an amazing movie","review":"Best series of the year! Lightning in a bottle ;)\nMichael Tolkin has done it again..and the cast is perfectEach episode blows my mind at how well the story n drama unfolds.","rating":"10\/10","date":"21 June 2022"}
{"title":"Just amazing!","review":"Giovanni Ribisi is just spectacular! Don't get me wrong everyone did fantastic job. But Giovanni, bravissimo!!! Great script, amazing story and above and beyond the performance!","rating":"10\/10","date":"20 August 2022"}
{"title":"Cheesy But Fabulous!!!","review":"Great acting! The parallels to the movie are cheesy but well done.Give the guy who plays Evans an award!Feel like watching the original trilogy again - have any of the actors in the original commented on it?","rating":"10\/10","date":"12 June 2022"}
{"title":"Amazing!!!!!","review":"I can't believe how good this is! All the characters are amazing. Love The Godfather. Love the making of The Godfather. I was surprised at how much I loved this show. Made me laugh cry and everything else. I hope they come up with more seasons with the same actors. They really hit the nail on the head.","rating":"10\/10","date":"19 June 2022"}
{"title":"Love it!!","review":"Any fan of The Godfather should enjoy this show! It is so interesting, as they show what it takes to make a movie.Although I'm only on Episode 6, but, I love it! The acting is outstanding! I love the, almost, comical relationships between Al Ruddy (Miles Teller) and Joe Columbo (Giovanni Ribisi ) and the actors who play Mario Puzo & Francis Ford Coppola! I also love the character, Bettye!As I watch it, I see that Al Ruddy is similar to a ring master at a Circus!!If you choose to watch this, you won't regret it!","rating":"10\/10","date":"2 June 2022"}
{"title":"This show is only 45-50 years to late to be interesting!","review":"You know that when a show comes out 50 years after the making of the movie that it is about, you are going to be revisional history! Since most of the people who had the greatest imput are now deceased or at an age they cannot recall things clearly!","rating":"1\/10","date":"29 April 2022"}
{"title":"Almost Perfect! Could do without Temple...","review":"Wonderful behind the curtain depiction of the making of The Godfather. Unfortunately despite a brilliant ensemble, I could not get past the poor casting of Juno Temple. She was completely wrong for the part. She is not a transformative actor, unfortunately. Just wasn't believable and annoyingly distracting. Anyone else, and I mean anyone, would have been better suited. Yet, despite that, the remaining cast hit the marks perfectly. I especially appreciated the \"gaudy\" sense of humor of Matthew Goode as Robert Evans. His role as the misogynist playboy was perfectly balanced with portraying the genius that Evans truly was.Can't wait to rewatch The Godfather now. Will have a whole new level of context bringing the greatest film of all time to a whole other level.","rating":"8\/10","date":"6 July 2022"}
{"title":"JUST LOVE IT!!!!","review":"It don't get much better than this.Don't know how much of it thats true to what actually went down but I guess a whole lot. The story and pacing is great. The cast is fantastic. And it would surprise me a lot if Miles Teller isn't the biggest star in movies\/tv in like ten years from now. And Matthew Goode as Bob Evans is electric. What more can I say? I couldn't have asked for more. Bravo!!!!!!","rating":"10\/10","date":"19 June 2022"}
{"title":"Best show of 2022 so far!!","review":"To tell everyone the truth i pre judged this show and decided in my ignorance that i wasn't interested in watching it since it was only about the making of a movie. I then was told by a friend who's taste in movies and shows is similar to my own, that this show was the best thing he has seen on tv since Game of Thrones ended a few years back. This obviously changed my outlook on watching it and i watched it in it's entirety over this past weekend.2 days later and i can only say that this is must see tv show. The acting, the sets, the attention to detail are incredible. I can honestly say that i will never look at the masterpiece which is the Godfather again in the same light, and i mean for the better. Knowing all the difficulties which were overcome to make the movie has made me appreciate it even more and even though it's hinted at the making of a Godfather Part 2, i'd love to see a second season of this show to get even more background on the making of that movie.","rating":"9\/10","date":"2 August 2022"}
{"title":"\"Funtastic\"","review":"One of the most entertaining series I have seen this year, is addicted; I saw it all in two days.Very good actors, and Anthony Ippolito, who plays Al Pacino playing Mikel Corleone, tremendous.And the feminist touch. Among others and to let out a good laugh since it is real, the real beating in a scene given by James Caan to the actor Gianni Russo for having previously hit an actress.","rating":"9\/10","date":"23 June 2022"}
{"title":"Wild As One Would Expect","review":"I must say that the Paramount+ series #TheOffer based on the book written by Albert Ruddy about his experience making the first Godfather movie is one of the best short series I've watched in a while.There's a few things that stand out about this production. First, the casting is impeccable; Miles Teller #MilesTeller as Ruddy and his assistant played by the irrepressible Juno Temple (Keely on Ted Lasso) are the central figures in what is really an ensemble cast performance. Particularly shout outs to Matthew Goode #matthewgoode who plays the Paramount studio head Bob Evans with all of the unctuous narcissism you'd imagine a studio head would possess. But, despite his insincerity he's likeable for his breezy social skills and his creative vision. And Burn Gorman #burngorman as Gulf & Western's CEO, Charles Bludhorn is remarkable for his unabashed love for and fear of not having, money. There are other's who are great, but one last shout out to Colin Hanks #ColinHanks for his role as Barry Lapidus, the terminally buttoned-up executive who thinks he can replace Evans and goes about it in a most duplicitous manner. Wow.The script, the costumes, the location scouting, the direction (by many different directors but I did recognize of the name Adam Arkin, son of one of my favorite actors, Alan Arkin. Adam also directed Get Shorty among many other things.); all outstanding. It's set in the 70s and it captures that crazy decade where humans were sorting out the consequences of the 1960s.Check it out if you get the time.","rating":"8\/10","date":"6 February 2023"}
{"title":"Truly excellent.","review":"A stylish drama for any movie fans. Whether u know about the making of the godfather or not this drama is excellent. Brilliant performances from a British and American cast bringing to life Hollywood in the early 70s and the struggle of getting a movie made when everything is against u. Including the mafia.Loved it.","rating":"10\/10","date":"19 June 2022"}
{"title":"Who wants to watch a miniseries about the making of a 50 year old film?","review":"That's what I thought. I mean I love The Godfather, but the making of a movie doesn't sound that interesting. However, lets remember that The Godfather is one of the best movies ever made & this series highlights how great it is as well as what it took to get the greatest film made. The casting, directing, & producing of this series is just as good as The Godfather. Watch this series & find something that you WILL watch again I Guarantee It!","rating":"10\/10","date":"25 June 2022"}
{"title":"BRAVO!","review":"This is greatness! Acting is amazing!!!!Leave it to Adam Arkin to direct this masterpiece! In love with these actors who transform themselves and I feel like I am actually a fly on the wall during the making of one of my favorite movies!","rating":"10\/10","date":"18 June 2022"}
{"title":"Interesting, but marred by poor acting and a simplistic script","review":"The series is an interesting watch but the acting is so amateurish, and the script childish at times. Rather than bringing the characters to life as the movie did, this \"backstory\" portrays the players involved, in a very stereotypical manner. The actors are \"Indie\" or \"Artsy\" movie types, not top tier, with a couple dragged back from oblivion to play some of the roles. You have to be a real fan to stick with it as it does drag a bit in parts. Some of the editing is just silly, and I guess is an attempt to portray the era and ambience of the time. It's watchable, average, but not great!","rating":"5\/10","date":"18 June 2022"}
{"title":"Wow","review":"I really had no idea what to expect here and based on prior roles, I was not the biggest fan of Miles Teller! He was amazing, the story was remarkable and fascinating for a movie I've loved for decades and I was riveted! I had to look up some of the things presented in this because it seemed absurd and over the top! Everything I looked up was true and supported the concept that actual life can be even crazier than movies! For anyone with even a modest attraction to The Godfather, you have to watch this. I almost guarantee that you will immediately go back and watch the movie with a new point of view!","rating":"10\/10","date":"20 June 2022"}
{"title":"The best TV show I have seen in a long long time","review":"After days I binged a show crazily like this. This show had everything mafiz crime drama. The Hollywood life and most of all the story of how God father was made. It gave me goose bumps after goosebumps. A phenomenal work. The way they presented the whole story could not take my eyes off it for a minute. The casting was sublime and acting out of the world. It inspired me to rewatch the God father trilogy for the 4th time.","rating":"10\/10","date":"20 June 2022"}
{"title":"I loved this show","review":"From the very first episode I was hooked, I watched most of the episodes, I had started it back in April on Paramount +. Then I went back to it in November, cause I was watching other shows, and I didn't have time to watch more of the offer, so one night I watched it up to episode 9. I would like to restart the series sometime because I enjoy the story of how the Godfather was made. I'm actually reading the godfather book right now. I'm almost finished with it, I'm on page 322. So the show really got me into the story of how movies were made. And all about the casting that goes into them. The offer is the best series to watch. Also I enjoy miles teller's acting.","rating":"10\/10","date":"26 December 2022"}
{"title":"How did I not watch this sooner!","review":"I had been hesitating because I thought a show about the making of The Godfather would be moody and slow. I was so wrong. This is incredible story telling that had me hooked right from the start.The cast is absolutely amazing...all extremely strong performances. Mathew Goode as Bob Evans is perfect in every single scene. I thought Justin Chambers as Marlon Brando was a strange choice, but he really pulled it off. Miles Teller and Juno Temple also were incredible and had great chemistry in the show.It might not all be historically accurate, but it was extremely entertaining. It's really my favourite show of the year.","rating":"10\/10","date":"11 October 2022"}
{"title":"Total joy","review":"Wow a rare 10 amazing cast top to bottom lead by miles teller ,I can see why Matty Goode missed the Downton movie he was extraordinary it was a total joy for all 10 episodes.","rating":"10\/10","date":"18 June 2022"}
{"title":"Thank you, you did a great job","review":"It's been a while since I thought I could even state an opinion without stopping and considering what I would say would be deleted or somehow considered \"okay boomer\" even though I am not from that generation. I just wanted to stop by and tell the creators what a fine job they did on this series and let them know that they are appreciated. Considering everything they now have to go through had to make them feel ill trying to accomplish their jobs without offending someone. Being under mandates to make entertainment has to be a gut-wrenching experience and when all your are trying to do is make something that people will enjoy. The production, acting, writing and screenplay are all top notch and I applaud you all for doing what you do best, entertain. Keep uo the good work and thank you.","rating":"10\/10","date":"6 February 2023"}
{"title":"First Rate Cast, Compelling Story","review":"10 content-driven episode showcase for Miles Teller, Robert Goode and Juno Temple about the seemingly insurmountable problems making the first Godfather movie. Teller nicely underplays producer, Al Ruddy with Goode just nailing movie mogul Robert Evans and Temple turning a supporting role into a starring role. Also, great turn by Giovanni Ribissi as \"gangster with a heart\", Joe Columbo. So sorry it's over. Best thing I've seen on TV since \"The Crown\".","rating":"9\/10","date":"17 June 2022"}
{"title":"THE BEST SERIES IN A LONG TIME","review":"This show is a fresh breath among all the mediocre shows out there for the past few years. All from the idea, cast, cinematography, storytelling, delivery etc. There's just no flaws!!!! I certainly hope that it will be renewed for more seasons (please renew it damn studio!!!)","rating":"10\/10","date":"3 June 2022"}
{"title":"Dumbed down for a modern binge audience?","review":"An endless number of animation movies are turned out these days and the mannerisms of the characters are repeated over and over again. Those really are computer generated.There is also large demand for 'drama' series to be made by, or for, the competing outlets, and in a manner that is comfortable for the audience..Here. The story is fed to the viewer in bite-sized pieces requiring little grey matter. It's easily consumed by the binging market, given a 10 rating, and then forgotten about.I made it three quarters of the way through the first episode. The full-screen turned to a window and finally my head hurt with the banality of what was being rolled out.","rating":"4\/10","date":"9 January 2023"}
{"title":"Love it!","review":"Considering The Godfather is my all time fav movie,of course I couldn't wait to see The Offer. Interesting seeing all the crazy complications that went into making this amazing movie classic. The actors did a great job as well.","rating":"10\/10","date":"3 June 2022"}
{"title":"Perfection. Absolute entertainment.","review":"Everyone cast is magnificent. Script, sets, acting, style, engagement, historical, all 150%. Evans character especially, rises, but everyone else are very close.This exact team should do Apocalypse Now next.","rating":"10\/10","date":"2 June 2022"}
{"title":"Captivating storytelling at its best","review":"A seemingly mostly true story that cements The Godfather as even more of a cinematic masterpiece. Watching all of the cogs turning and the pieces fall into place to make the movie happen is exhilarating.","rating":"10\/10","date":"2 June 2022"}
{"title":"Simply AMAZING!!!!!","review":"We already know that The Godfather is one of the best movies of all time. Having watched The Offer, it takes The Godfather to an entire new level of an amazing movie.","rating":"9\/10","date":"17 June 2022"}
{"title":"Wonderful. A great binge watch","review":"If you liked \"The Godfather\", and if you like biopics, the this is the one you should watch. Clever writing, great acting, and a great story about the executive battles, egos, and drama that were behind the movie \"The Godfather.\" This movie is like an Italian multicourse meal, you go in, you pace yourself, and you enjoy it.","rating":"10\/10","date":"22 May 2022"}
{"title":"Can it go to 11?","review":"If I could turn up my rating (like that amp in Spinal Tap) to 11 I would. This series is by far the best \"movie\" on movies I've ever seen. I thought I knew The Godfather.... I had no idea. Not only did it make me understand the courage and commitment that went into making this the best film of all time, it also revealed the additional depth and personal experience layered into the film that I never realized before. This series made me feel like I was there. I was part of the scene. Part of that center of the universe at a very special time in history. Bravo! All the actors are nothing short of spectacular!","rating":"10\/10","date":"20 June 2022"}
{"title":"One of the best shows ever made","review":"I am fan of The Godfather and yet I had no idea of the back story of getting the film made . The casting , the acting the story is absolutely brilliant ! Matthew Goode and Giovanni are both amazing !","rating":"10\/10","date":"9 June 2022"}
{"title":"I love the show but hate the ignorant dialogue","review":"What is the matter with writers these days. Back then people didn't use the completely ignorant phrase 'try and...\" as in \"You're still gonna try and make this thing?\"This happens in old period pieces way too much. Didn't today's writer's go to school to learn grammar?If you stop to think about it, how does \"try and\" make any logical sense?From Grammar Girl - Try to Versus Try andIf you use \"and\", as in -- I am going to try and call Grammar Girl -- you are separating trying and calling. You are describing two things: trying and calling. When you use \"try to\" -- as in I am going to try to call Grammar Girl -- you are using the preposition \"to\" to link the trying to the calling.Another option that works in some cases is to skip try to -- I am going to call Grammar GirlAs professional writers, we should work to make the language better.Oh Wait! You need an education to do that.","rating":"9\/10","date":"3 July 2022"}
{"title":"One of the best series in History","review":"This was absolutely pristine. A memorable experience and stacked with solid performances. This was a joy to watch a slow burn style drama series with heightened suspense that maintained a steady climb.I'm not a Hollywood fanatic by any means. This series actually made me lose myself in the actors and it seems like everyone who participated in this chronicle were super committed to giving their all and it showed.Any person who loves \"The Godfather\" will adore this series. I hope that they make a second season for part two, but the need the right cast. Another cool aspect of this is how they included strong female roles. It really added so much sincerity.","rating":"10\/10","date":"3 March 2023"}
{"title":"Take the cannoli and The Offer, don't refuse them.","review":"I didn't know what to expect but my family and I were hooked after thew first episode. Excellent acting, funny, great story, a really good period glimpse into Hollywood and the mob (can't say \"Mafia\"). I found myself pausing to google and IMDB the real people and actors to do a \"reality check\". The likenesses and similarities to the real people was amazing. Could not believe the actor who played Bettye was British after hearing her accent! The detail that went into the series was remarkable. There were few instances of taking dramatic license, the story was pretty spot on to real events, timelines and people. The homages to the actual movie and people played very well into the series. If you loved The Godfather, you're going to love this!!!","rating":"10\/10","date":"17 June 2022"}
{"title":"Great storytelling. Very enjoyable.","review":"I gave this series a 9 because I never give a 10 to anything but this one came very close. As a movie fan and a movie buff I really enjoyed The Offer from start to finish. Great storytelling and great acting by all especially Mathew Goode and Giovanni Ribisi. Miles Teller had a great presence. You can feel the process of what went on and what problems were encounteted to make the great Godfather movie. I can not believe this series did not get any Emmy nominations. I can only say shame on them.","rating":"9\/10","date":"30 July 2022"}
